zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
  AUDIO_EDMA3_CH0_IRQn         = 271,              /**< AUDIO EDMA3: Channel 0 interrupt */
  AUDIO_EDMA3_CH1_IRQn         = 272,              /**< AUDIO EDMA3: Channel 1 interrupt */
  AUDIO_EDMA3_CH2_IRQn         = 273,              /**< AUDIO EDMA3: Channel 2 interrupt */
  AUDIO_EDMA3_CH3_IRQn         = 274,              /**< AUDIO EDMA3: Channel 3 interrupt */
  AUDIO_EDMA3_CH4_IRQn         = 275,              /**< AUDIO EDMA3: Channel 4 interrupt */
  AUDIO_EDMA3_CH5_IRQn         = 276,              /**< AUDIO EDMA3: Channel 5 interrupt */
  AUDIO_EDMA3_CH6_IRQn         = 277,              /**< AUDIO EDMA3: Channel 6 interrupt */
  AUDIO_EDMA3_CH7_IRQn         = 278,              /**< AUDIO EDMA3: Channel 7 interrupt */
  AUDIO_ASRC_IRQn              = 288,              /**< AUDIO ASRC interrupt */
  AUDIO_FREQME_IRQn            = 289,              /**< AUDIO FREQME interrupt */
  COMM_TRDC_IRQn               = 295,              /**< COMM TRDC interrupt */
  COMM_ENET_QOS_IRQn           = 296,              /**< COMM ENET_QOS interrupt */
  COMM_ENET_QOS_TX_IRQn        = 297,              /**< ENET_QOS: Per Channel Transmit Interrupt Signal To Host System */
  COMM_ENET_QOS_RX_IRQn        = 298,              /**< ENET_QOS: Per Channel Receive Interrupt Signal To Host System */
  COMM_ENET_TX_IRQn            = 299,              /**< COMM ENET TX interrupt */
  COMM_ENET_RX_IRQn            = 300,              /**< COMM ENET RX interrupt */
  COMM_ENET_OTHER_IRQn         = 301,              /**< ENET_1G_MAC: ETH OTHER_INT0_17 */
  COMM_ENET_1588_IRQn          = 302,              /**< ENET_1G_MAC: IEEE-1588 Timer Interrupt */
  COMM_FLEXSPI_SLV_IRQn        = 303,              /**< COMM FlexSPI follower interrupt */
  COMM_USB0_IRQn               = 304,              /**< COMM USBHS interrupt */
  COMM_USBPHY_IRQn             = 305,              /**< COMM USBPHY interrupt */
  COMM_USB1_IRQn               = 306,              /**< COMM USBFS interrupt */
  COMM_USDHC0_IRQn             = 307,              /**< COMM USDHC0 interrupt */
  COMM_USDHC1_IRQn             = 308,              /**< COMM USDHC1 interrupt */
  COMM_TENBASET_PHY0_IRQn      = 310,              /**< XENO_PHY0:Functional IRQ1 interrupt request  */
  COMM_TENBASET_PHY1_IRQn      = 312,              /**< XENO_PHY1:Functional IRQ1 interrupt request  */
  COMM_FREQME_IRQn             = 314,              /**< COMM FREQME interrupt */
  MEDIA_TRDC_IRQn              = 315,              /**< MEDIA TRDC interrupt */
  MEDIA_DCIF_CH0_IRQn          = 317,              /**< MEDIA DCIF channel 0 interrupt */
  MEDIA_DCIF_CH1_IRQn          = 318,              /**< MEDIA DCIF channel 1 interrupt */
  MEDIA_DCIF_CH2_IRQn          = 319,              /**< MEDIA DCIF channel 2 interrupt */
  MEDIA_DCIF_CH3_IRQn          = 320,              /**< MEDIA DCIF channel 3 interrupt */
  MEDIA_DCIF_CH4_IRQn          = 321,              /**< MEDIA DCIF channel 4 interrupt */
  MEDIA_DCIF_CH5_IRQn          = 322,              /**< MEDIA DCIF channel 5 interrupt */
  MEDIA_DCIF_CH6_IRQn          = 323,              /**< MEDIA DCIF channel 6 interrupt */
  MEDIA_DCIF_CH7_IRQn          = 324,              /**< MEDIA DCIF channel 7 interrupt */
  MEDIA_DCIF_CH8_IRQn          = 325,              /**< MEDIA DCIF channel 8 interrupt */
  Reserved342_IRQn             = 326,              /**< Reserved interrupt */
  MEDIA_REFORMATTER_IRQn       = 327,              /**< MEDIA REFORMATTER interrupt */
  MEDIA_ISI_IRQn               = 328,              /**< MEDIA ISI interrupt */
  MEDIA_TINGPU_IRQn            = 329,              /**< MEDIA TINGPU interrupt */
  MEDIA_JPEGDEC_IRQn           = 330,              /**< MEDIA JPEGDEC interrupt */
  Reserved347_IRQn             = 331,              /**< Reserved interrupt */
  Reserved348_IRQn             = 332,              /**< Reserved interrupt */
  MEDIA_FREQME_IRQn            = 333               /**< MEDIA FREQME interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M85 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M85 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __ICACHE_PRESENT               1         /**< Defines if an ICACHE is present or not */
#define __DCACHE_PRESENT               1         /**< Defines if an DCACHE is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  1         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            1         /**< Defines if an SAU is present or not */

#include "core_cm85.h"                 /* Core Peripheral Access Layer */
#include "system_MIMXRT2660.h"         /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef MIMXRT2660_SERIES
#define MIMXRT2660_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT2660_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup asrc_clock_source
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief The ASRC clock source
 */

typedef enum _asrc_clock_source
{
    kASRC_ClockSourceNotAvalible    = -1,          /**< not avalible */
    kASRC_ClockSourceBitClock0_AUD_PLL_DIV_CLK0 = 0U, /**< DSC clock output 0 */
    kASRC_ClockSourceBitClock1_AUD_PLL_DIV_CLK1 = 1U, /**< DSC clock output 1 */
    kASRC_ClockSourceBitClock2_AUD_CLK0 = 2U,      /**< Audio Clock Multiplexer 0 output */
    kASRC_ClockSourceBitClock3_AUD_CLK1 = 3U,      /**< Audio Clock Multiplexer 1 output */
    kASRC_ClockSourceBitClock4_eSAI0_RX_CLK = 4U,  /**< eSAI0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock5_eSAI0_TX_CLK = 5U,  /**< eSAI0 Transmitter serial bit clock */
    kASRC_ClockSourceBitClock6_SPDIF0_RX = 6U,     /**< SPDIF0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock7_SPDIF1_RX = 7U,     /**< SPDIF1 Receiver serial bit clock */
    kASRC_ClockSourceBitClock8_SAI0_RX_BCLK = 8U,  /**< SAI0 Receiver serial bit clock */
    kASRC_ClockSourceBitClock9_SAI0_TX_BCLK = 9U,  /**< SAI0 Transmitter serial bit clock */
    kASRC_ClockSourceBitClocka_SAI1_RX_BCLK = 10U, /**< SAI1 Receiver serial bit clock */
    kASRC_ClockSourceBitClockb_SAI1_TX_BCLK = 11U, /**< SAI1 Transmitter serial bit clock */
    kASRC_ClockSourceBitClockc_SAI2_RX_BCLK = 12U, /**< SAI2 Receiver serial bit clock */
    kASRC_ClockSourceBitClockd_SAI3_RX_BCLK = 13U, /**< SAI3 Receiver serial bit clock */
    kASRC_ClockSourceBitClocke_ASRC0_PRE_SEL = 14U, /**< ASRC0 pre-selector multiplexer */
    kASRC_ClockSourceMax            = 14U,         /**< max value */
} asrc_clock_source_t;

/*!
 * @addtogroup edma0_request
 * @{ */

