zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Enumeration for the DMA1 hardware request
 *
 * Defines the enumeration for the DMA1 hardware request collections.
 */
typedef enum _main_edma3_request_source
{
    kDmaRequestMux1MainXSPI0Rx      = 1|0x200U,    /**< MAIN XSPI0 Rx Buffer Drain Request */
    kDmaRequestMux1MainXSPI0Tx      = 2|0x200U,    /**< MAIN XSPI0 Tx Buffer Fill Request */
    kDmaRequestMux1MainXSPI1Rx      = 3|0x200U,    /**< MAIN XSPI1 Rx Buffer Drain Request */
    kDmaRequestMux1MainXSPI1Tx      = 4|0x200U,    /**< MAIN XSPI1 Tx Buffer Fill Request */
    kDmaRequestMux1HspXBAR0OUT0     = 10|0x200U,   /**< HSP XBAR_OUT0 Request */
    kDmaRequestMux1HspXBAR0OUT1     = 11|0x200U,   /**< HSP XBAR_OUT1 Request */
    kDmaRequestMux1HspXBAR0OUT2     = 12|0x200U,   /**< HSP XBAR_OUT2 Request */
    kDmaRequestMux1HspXBAR0OUT3     = 13|0x200U,   /**< HSP XBAR_OUT3 Request */
    kDmaRequestMux1HspXBAR0OUT4     = 14|0x200U,   /**< HSP XBAR_OUT4 Request */
    kDmaRequestMux1HspXBAR0OUT5     = 15|0x200U,   /**< HSP XBAR_OUT5 Request */
    kDmaRequestMux1HspXBAR0OUT6     = 16|0x200U,   /**< HSP XBAR_OUT6 Request */
    kDmaRequestMux1HspXBAR0OUT7     = 17|0x200U,   /**< HSP XBAR_OUT7 Request */
    kDmaRequestMux1HspADC0Channel0  = 18|0x200U,   /**< HSP ADC0 Fifo 0 Request */
    kDmaRequestMux1HspADC0Channel1  = 19|0x200U,   /**< HSP ADC0 Fifo 1 Request */
    kDmaRequestMux1HspADC1Channel0  = 20|0x200U,   /**< HSP ADC1 Fifo 0 Request */
    kDmaRequestMux1HspADC1Channel1  = 21|0x200U,   /**< HSP ADC1 Fifo 1 Request */
    kDmaRequestMux1HspDAC           = 22|0x200U,   /**< HSP DAC Fifo Request */
    kDmaRequestMux1HspEFLEXPWM0Capture0 = 23|0x200U, /**< HSP EFLEXPWM0 Read Request For Capture Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM0Capture1 = 24|0x200U, /**< HSP EFLEXPWM0 Read Request For Capture Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM0Capture2 = 25|0x200U, /**< HSP EFLEXPWM0 Read Request For Capture Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM0Capture3 = 26|0x200U, /**< HSP EFLEXPWM0 Read Request For Capture Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM0Value0 = 27|0x200U, /**< HSP EFLEXPWM0 Write Request For Value Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM0Value1 = 28|0x200U, /**< HSP EFLEXPWM0 Write Request For Value Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM0Value2 = 29|0x200U, /**< HSP EFLEXPWM0 Write Request For Value Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM0Value3 = 30|0x200U, /**< HSP EFLEXPWM0 Write Request For Value Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM1Capture0 = 31|0x200U, /**< HSP EFLEXPWM1 Read Request For Capture Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM1Capture1 = 32|0x200U, /**< HSP EFLEXPWM1 Read Request For Capture Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM1Capture2 = 33|0x200U, /**< HSP EFLEXPWM1 Read Request For Capture Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM1Capture3 = 34|0x200U, /**< HSP EFLEXPWM1 Read Request For Capture Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM1Value0 = 35|0x200U, /**< HSP EFLEXPWM1 Write Request For Value Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM1Value1 = 36|0x200U, /**< HSP EFLEXPWM1 Write Request For Value Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM1Value2 = 37|0x200U, /**< HSP EFLEXPWM1 Write Request For Value Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM1Value3 = 38|0x200U, /**< HSP EFLEXPWM1 Write Request For Value Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM2Capture0 = 39|0x200U, /**< HSP EFLEXPWM2 Read Request For Capture Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM2Capture1 = 40|0x200U, /**< HSP EFLEXPWM2 Read Request For Capture Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM2Capture2 = 41|0x200U, /**< HSP EFLEXPWM2 Read Request For Capture Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM2Capture3 = 42|0x200U, /**< HSP EFLEXPWM2 Read Request For Capture Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM2Value0 = 43|0x200U, /**< HSP EFLEXPWM2 Write Request For Value Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM2Value1 = 44|0x200U, /**< HSP EFLEXPWM2 Write Request For Value Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM2Value2 = 45|0x200U, /**< HSP EFLEXPWM2 Write Request For Value Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM2Value3 = 46|0x200U, /**< HSP EFLEXPWM2 Write Request For Value Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM3Capture0 = 47|0x200U, /**< HSP EFLEXPWM3 Read Request For Capture Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM3Capture1 = 48|0x200U, /**< HSP EFLEXPWM3 Read Request For Capture Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM3Capture2 = 49|0x200U, /**< HSP EFLEXPWM3 Read Request For Capture Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM3Capture3 = 50|0x200U, /**< HSP EFLEXPWM3 Read Request For Capture Registers Of Submodule 3 */
    kDmaRequestMux1HspEFLEXPWM3Value0 = 51|0x200U, /**< HSP EFLEXPWM3 Write Request For Value Registers Of Submodule 0 */
    kDmaRequestMux1HspEFLEXPWM3Value1 = 52|0x200U, /**< HSP EFLEXPWM3 Write Request For Value Registers Of Submodule 1 */
    kDmaRequestMux1HspEFLEXPWM3Value2 = 53|0x200U, /**< HSP EFLEXPWM3 Write Request For Value Registers Of Submodule 2 */
    kDmaRequestMux1HspEFLEXPWM3Value3 = 54|0x200U, /**< HSP EFLEXPWM3 Write Request For Value Registers Of Submodule 3 */
    kDmaRequestMux1HspQUADTPM0Count0 = 55|0x200U,  /**< HSP QUADTPM0 Counter 0 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Count1 = 56|0x200U,  /**< HSP QUADTPM0 Counter 1 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Count2 = 57|0x200U,  /**< HSP QUADTPM0 Counter 2 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Count3 = 58|0x200U,  /**< HSP QUADTPM0 Counter 3 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Channel02 = 59|0x200U, /**< HSP QUADTPM0 Channel 0/2 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Channel13 = 60|0x200U, /**< HSP QUADTPM0 Channel 1/3 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Channel46 = 61|0x200U, /**< HSP QUADTPM0 Channel 4/6 Overflow Request */
    kDmaRequestMux1HspQUADTPM0Channel57 = 62|0x200U, /**< HSP QUADTPM0 Channel 5/7 Overflow Request */
    kDmaRequestMux1HspQTMR0Channel0 = 79|0x200U,   /**< HSP QTMR0 Channel 0 Capture Request */
    kDmaRequestMux1HspQTMR0Channel1 = 80|0x200U,   /**< HSP QTMR0 Channel 1 Capture Request */
    kDmaRequestMux1HspQTMR0Channel2 = 81|0x200U,   /**< HSP QTMR0 Channel 2 Capture Request */
    kDmaRequestMux1HspQTMR0Channel3 = 82|0x200U,   /**< HSP QTMR0 Channel 3 Capture Request */
    kDmaRequestMux1HspQTMR0Channel0Load1 = 83|0x200U, /**< HSP QTMR0 Channel 0 Load Register 1 Request */
    kDmaRequestMux1HspQTMR0Channel0Load2 = 84|0x200U, /**< HSP QTMR0 Channel 0 Load Register 2 Request */
    kDmaRequestMux1HspQTMR0Channel2Load1 = 85|0x200U, /**< HSP QTMR0 Channel 2 Load Register 1 Request */
    kDmaRequestMux1HspQTMR0Channel2Load2 = 86|0x200U, /**< HSP QTMR0 Channel 2 Load Register 2 Request */
    kDmaRequestMux1HspQTMR1Channel0 = 87|0x200U,   /**< HSP QTMR1 Channel 0 Capture Request */
    kDmaRequestMux1HspQTMR1Channel1 = 88|0x200U,   /**< HSP QTMR1 Channel 1 Capture Request */
    kDmaRequestMux1HspQTMR1Channel2 = 89|0x200U,   /**< HSP QTMR1 Channel 2 Capture Request */
    kDmaRequestMux1HspQTMR1Channel3 = 90|0x200U,   /**< HSP QTMR1 Channel 3 Capture Request */
    kDmaRequestMux1HspQTMR1Channel0Load1 = 91|0x200U, /**< HSP QTMR1 Channel 0 Load Register 1 Request */
    kDmaRequestMux1HspQTMR1Channel0Load2 = 92|0x200U, /**< HSP QTMR1 Channel 0 Load Register 2 Request */
    kDmaRequestMux1HspQTMR1Channel2Load1 = 93|0x200U, /**< HSP QTMR1 Channel 2 Load Register 1 Request */
    kDmaRequestMux1HspQTMR1Channel2Load2 = 94|0x200U, /**< HSP QTMR1 Channel 2 Load Register 2 Request */
    kDmaRequestMux1HspQTMR2Channel0 = 95|0x200U,   /**< HSP QTMR2 Channel 0 Capture Request */
    kDmaRequestMux1HspQTMR2Channel1 = 96|0x200U,   /**< HSP QTMR2 Channel 1 Capture Request */
    kDmaRequestMux1HspQTMR2Channel2 = 97|0x200U,   /**< HSP QTMR2 Channel 2 Capture Request */
    kDmaRequestMux1HspQTMR2Channel3 = 98|0x200U,   /**< HSP QTMR2 Channel 3 Capture Request */
    kDmaRequestMux1HspQTMR2Channel0Load1 = 99|0x200U, /**< HSP QTMR2 Channel 0 Load Register 1 Request */
    kDmaRequestMux1HspQTMR2Channel0Load2 = 100|0x200U, /**< HSP QTMR2 Channel 0 Load Register 2 Request */
    kDmaRequestMux1HspQTMR2Channel2Load1 = 101|0x200U, /**< HSP QTMR2 Channel 2 Load Register 1 Request */
    kDmaRequestMux1HspQTMR2Channel2Load2 = 102|0x200U, /**< HSP QTMR2 Channel 2 Load Register 2 Request */
    kDmaRequestMux1HspQTMR3Channel0 = 103|0x200U,  /**< HSP QTMR3 Channel 0 Capture Request */
    kDmaRequestMux1HspQTMR3Channel1 = 104|0x200U,  /**< HSP QTMR3 Channel 1 Capture Request */
    kDmaRequestMux1HspQTMR3Channel2 = 105|0x200U,  /**< HSP QTMR3 Channel 2 Capture Request */
    kDmaRequestMux1HspQTMR3Channel3 = 106|0x200U,  /**< HSP QTMR3 Channel 3 Capture Request */
    kDmaRequestMux1HspQTMR3Channel0Load1 = 107|0x200U, /**< HSP QTMR3 Channel 0 Load Register 1 Request */
    kDmaRequestMux1HspQTMR3Channel0Load2 = 108|0x200U, /**< HSP QTMR3 Channel 0 Load Register 2 Request */
    kDmaRequestMux1HspQTMR3Channel2Load1 = 109|0x200U, /**< HSP QTMR3 Channel 2 Load Register 1 Request */
    kDmaRequestMux1HspQTMR3Channel2Load2 = 110|0x200U, /**< HSP QTMR3 Channel 2 Load Register 2 Request */
    kDmaRequestMux1HspEQDC0         = 111|0x200U,  /**< HSP EQDC0 Request Triggered By Loading Values From Outer- To Inner-Set Registers */
    kDmaRequestMux1HspEQDC1         = 112|0x200U,  /**< HSP EQDC1 Request Triggered By Loading Values From Outer- To Inner-Set Registers */
    kDmaRequestMux1HspEQDC2         = 113|0x200U,  /**< HSP EQDC2 Request Triggered By Loading Values From Outer- To Inner-Set Registers */
    kDmaRequestMux1HspEQDC3         = 114|0x200U,  /**< HSP EQDC3 Request Triggered By Loading Values From Outer- To Inner-Set Registers */
    kDmaRequestMux1HspSINC0Fifo0    = 115|0x200U,  /**< HSP SINC0 fifo0 */
    kDmaRequestMux1HspSINC0Alt0     = 116|0x200U,  /**< HSP SINC0 alt0 */
    kDmaRequestMux1HspSINC0Fifo1    = 117|0x200U,  /**< HSP SINC0 fifo1 */
    kDmaRequestMux1HspSINC0Alt1     = 118|0x200U,  /**< HSP SINC0 alt1 */
    kDmaRequestMux1HspSINC0Fifo2    = 119|0x200U,  /**< HSP SINC0 fifo2 */
    kDmaRequestMux1HspSINC0Alt2     = 120|0x200U,  /**< HSP SINC0 alt2 */
    kDmaRequestMux1HspSINC0Fifo3    = 121|0x200U,  /**< HSP SINC0 fifo3 */
    kDmaRequestMux1HspSINC0Alt3     = 122|0x200U,  /**< HSP SINC0 alt3 */
    kDmaRequestMux1HspSINC1Fifo0    = 123|0x200U,  /**< HSP SINC1 fifo0 */
    kDmaRequestMux1HspSINC1Alt0     = 124|0x200U,  /**< HSP SINC1 alt0 */
    kDmaRequestMux1HspSINC1Fifo1    = 125|0x200U,  /**< HSP SINC1 fifo1 */
    kDmaRequestMux1HspSINC1Alt1     = 126|0x200U,  /**< HSP SINC1 alt1 */
    kDmaRequestMux1HspSINC1Fifo2    = 127|0x200U,  /**< HSP SINC1 fifo2 */
    kDmaRequestMux1HspSINC1Alt2     = 128|0x200U,  /**< HSP SINC1 alt2 */
    kDmaRequestMux1HspSINC1Fifo3    = 129|0x200U,  /**< HSP SINC1 fifo3 */
    kDmaRequestMux1HspSINC1Alt3     = 130|0x200U,  /**< HSP SINC1 alt3 */
    kDmaRequestMux1HspFlexCAN0      = 131|0x200U,  /**< HSP FlexCAN0 */
    kDmaRequestMux1HspFlexCAN1      = 132|0x200U,  /**< HSP FlexCAN1 */
    kDmaRequestMux1HspFlexCAN2      = 133|0x200U,  /**< HSP FlexCAN2 */
    kDmaRequestMux1HspFlexIO0Request0Request8 = 134|0x200U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux1HspFlexIO0Request1Request9 = 135|0x200U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux1HspFlexIO0Request2Request10 = 136|0x200U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux1HspFlexIO0Request3Request11 = 137|0x200U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux1HspFlexIO0Request4Request12 = 138|0x200U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux1HspFlexIO0Request5Request13 = 139|0x200U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux1HspFlexIO0Request6Request14 = 140|0x200U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux1HspFlexIO0Request7Request15 = 141|0x200U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux1HspFlexIO1Request0Request8 = 142|0x200U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux1HspFlexIO1Request1Request9 = 143|0x200U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux1HspFlexIO1Request2Request10 = 144|0x200U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux1HspFlexIO1Request3Request11 = 145|0x200U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux1HspFlexIO1Request4Request12 = 146|0x200U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux1HspFlexIO1Request5Request13 = 147|0x200U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux1HspFlexIO1Request6Request14 = 148|0x200U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux1HspFlexIO1Request7Request15 = 149|0x200U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux1HspFlexIO2Request0Request8 = 150|0x200U, /**< HSP FlexIO0 Request 0 and Request 8 */
    kDmaRequestMux1HspFlexIO2Request1Request9 = 151|0x200U, /**< HSP FlexIO0 Request 1 and Request 9 */
    kDmaRequestMux1HspFlexIO2Request2Request10 = 152|0x200U, /**< HSP FlexIO0 Request 2 and Request 10 */
    kDmaRequestMux1HspFlexIO2Request3Request11 = 153|0x200U, /**< HSP FlexIO0 Request 3 and Request 11 */
    kDmaRequestMux1HspFlexIO2Request4Request12 = 154|0x200U, /**< HSP FlexIO0 Request 4 and Request 12 */
    kDmaRequestMux1HspFlexIO2Request5Request13 = 155|0x200U, /**< HSP FlexIO0 Request 5 and Request 13 */
    kDmaRequestMux1HspFlexIO2Request6Request14 = 156|0x200U, /**< HSP FlexIO0 Request 6 and Request 14 */
    kDmaRequestMux1HspFlexIO2Request7Request15 = 157|0x200U, /**< HSP FlexIO0 Request 7 and Request 15 */
    kDmaRequestMux1HspI3CFromBus    = 158|0x200U,  /**< HSP I3C From-bus DMA Request */
    kDmaRequestMux1HspI3CToBus      = 159|0x200U,  /**< HSP I3C to-bus DMA Request */
    kDmaRequestMux1HspLPI2C0Tx      = 161|0x200U,  /**< HSP LPI2C0 Master/Slave Transmit */
    kDmaRequestMux1HspLPI2C0Rx      = 162|0x200U,  /**< HSP LPI2C0 Master/Slave Receive */
    kDmaRequestMux1HspLPI2C1Tx      = 163|0x200U,  /**< HSP LPI2C1 Master/Slave Transmit */
    kDmaRequestMux1HspLPI2C1Rx      = 164|0x200U,  /**< HSP LPI2C1 Master/Slave Receive */
    kDmaRequestMux1HspLPSPI0Tx      = 169|0x200U,  /**< HSP LPSPI0 Master/Slave Transmit */
    kDmaRequestMux1HspLPSPI0Rx      = 170|0x200U,  /**< HSP LPSPI0 Master/Slave Receive */
    kDmaRequestMux1HspLPSPI1Tx      = 171|0x200U,  /**< HSP LPSPI1 Master/Slave Transmit */
    kDmaRequestMux1HspLPSPI1Rx      = 172|0x200U,  /**< HSP LPSPI1 Master/Slave Receive */
    kDmaRequestMux1HspLPSPI2Tx      = 173|0x200U,  /**< HSP LPSPI2 Master/Slave Transmit */
    kDmaRequestMux1HspLPSPI2Rx      = 174|0x200U,  /**< HSP LPSPI2 Master/Slave Receive */
    kDmaRequestMux1HspLPSPI3Tx      = 175|0x200U,  /**< HSP LPSPI3 Master/Slave Transmit */
    kDmaRequestMux1HspLPSPI3Rx      = 176|0x200U,  /**< HSP LPSPI3 Master/Slave Receive */
    kDmaRequestMux1HspLPSPI4Tx      = 177|0x200U,  /**< HSP LPSPI4 Master/Slave Transmit */
    kDmaRequestMux1HspLPSPI4Rx      = 178|0x200U,  /**< HSP LPSPI4 Master/Slave Receive */
    kDmaRequestMux1HspLPUART0Tx     = 179|0x200U,  /**< HSP LPLPUART0 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART0Rx     = 180|0x200U,  /**< HSP LPLPUART0 Master/Slave Receive */
    kDmaRequestMux1HspLPUART1Tx     = 181|0x200U,  /**< HSP LPLPUART1 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART1Rx     = 182|0x200U,  /**< HSP LPLPUART1 Master/Slave Receive */
    kDmaRequestMux1HspLPUART2Tx     = 183|0x200U,  /**< HSP LPLPUART2 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART2Rx     = 184|0x200U,  /**< HSP LPLPUART2 Master/Slave Receive */
    kDmaRequestMux1HspLPUART3Tx     = 185|0x200U,  /**< HSP LPLPUART3 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART3Rx     = 186|0x200U,  /**< HSP LPLPUART3 Master/Slave Receive */
    kDmaRequestMux1HspLPUART4Tx     = 187|0x200U,  /**< HSP LPLPUART4 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART4Rx     = 188|0x200U,  /**< HSP LPLPUART4 Master/Slave Receive */
    kDmaRequestMux1HspLPUART5Tx     = 189|0x200U,  /**< HSP LPLPUART5 Master/Slave Transmit */
    kDmaRequestMux1HspLPUART5Rx     = 190|0x200U,  /**< HSP LPLPUART5 Master/Slave Receive */
    kDmaRequestMux1HspRGPIO0Channel0 = 191|0x200U, /**< HSP RGPIO0 Channel 0 */
    kDmaRequestMux1HspRGPIO0Channel1 = 192|0x200U, /**< HSP RGPIO0 Channel 1 */
    kDmaRequestMux1HspRGPIO1Channel0 = 193|0x200U, /**< HSP RGPIO1 Channel 0 */
    kDmaRequestMux1HspRGPIO1Channel1 = 194|0x200U, /**< HSP RGPIO1 Channel 1 */
    kDmaRequestMux1HspRGPIO2Channel0 = 195|0x200U, /**< HSP RGPIO2 Channel 0 */
    kDmaRequestMux1HspRGPIO2Channel1 = 196|0x200U, /**< HSP RGPIO2 Channel 1 */
    kDmaRequestMux1HspRGPIO3Channel0 = 197|0x200U, /**< HSP RGPIO3 Channel 0 */
    kDmaRequestMux1HspRGPIO3Channel1 = 198|0x200U, /**< HSP RGPIO3 Channel 1 */
    kDmaRequestMux1HspRGPIO4Channel0 = 199|0x200U, /**< HSP RGPIO4 Channel 0 */
    kDmaRequestMux1HspRGPIO4Channel1 = 200|0x200U, /**< HSP RGPIO4 Channel 1 */
} main_edma3_request_source_t;

/* @} */

/*!
 * @addtogroup edma2_request
 * @{ */

