zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Enumeration for the DMA2 hardware request
 *
 * Defines the enumeration for the DMA2 hardware request collections.
 */
typedef enum _audio_edma3_request_source
{
    kDmaRequestMux2AudioMic         = 1|0x300U,    /**< AUDIO MICFIL Request */
    kDmaRequestMux2AudioSAI0Tx      = 3|0x300U,    /**< AUDIO SAI0 Tx Request */
    kDmaRequestMux2AudioSAI0Rx      = 4|0x300U,    /**< AUDIO SAI0 Rx Request */
    kDmaRequestMux2AudioSAI1Tx      = 5|0x300U,    /**< AUDIO SAI1 Tx Request */
    kDmaRequestMux2AudioSAI1Rx      = 6|0x300U,    /**< AUDIO SAI1 Rx Request */
    kDmaRequestMux2AudioSAI2Tx      = 7|0x300U,    /**< AUDIO SAI2 Tx Request */
    kDmaRequestMux2AudioSAI2Rx      = 8|0x300U,    /**< AUDIO SAI2 Rx Request */
    kDmaRequestMux2AudioSpdifRx     = 15|0x300U,   /**< AUDIO SPDIF Rx Request */
    kDmaRequestMux2AudioSpdifTx     = 16|0x300U,   /**< AUDIO SPDIF Tx Request */
    kDmaRequestMux2AudioAsrcPairAInput = 17|0x300U, /**< AUDIO ASRC PairA input Request */
    kDmaRequestMux2AudioAsrcPairBInput = 18|0x300U, /**< AUDIO ASRC PairB input Request */
    kDmaRequestMux2AudioAsrcPairCInput = 19|0x300U, /**< AUDIO ASRC PairC input Request */
    kDmaRequestMux2AudioAsrcPairAOutput = 20|0x300U, /**< AUDIO ASRC PairA Output Request */
    kDmaRequestMux2AudioAsrcPairBOutput = 21|0x300U, /**< AUDIO ASRC PairB Output Request */
    kDmaRequestMux2AudioAsrcPairCOutput = 22|0x300U, /**< AUDIO ASRC PairC Output Request */
} audio_edma3_request_source_t;

/* @} */

/*!
 * @addtogroup edma3_request
 * @{ */

/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Enumeration for the DMA3 hardware request
 *
 * Defines the enumeration for the DMA3 hardware request collections.
 */
typedef enum _wake_edma3_request_source
{
    kDmaRequestMux3WakeXbarOut0     = 1|0x400U,    /**< WAKE XBAR OUT0 Request */
    kDmaRequestMux3WakeXbarOut1     = 2|0x400U,    /**< WAKE XBAR OUT1 Request */
    kDmaRequestMux3WakeCMP0         = 3|0x400U,    /**< WAKE ACMP0 Request */
    kDmaRequestMux3WakeCMP1         = 4|0x400U,    /**< WAKE ACMP1 Request */
    kDmaRequestMux3WakeCMP2         = 5|0x400U,    /**< WAKE ACMP2 Request */
    kDmaRequestMux3WakeCMP3         = 6|0x400U,    /**< WAKE ACMP3 Request */
    kDmaRequestMux3WakeLPTMR0       = 7|0x400U,    /**< WAKE LPTMR0 Request */
    kDmaRequestMux3WakeLPTMR1       = 8|0x400U,    /**< WAKE LPTMR1 Request */
    kDmaRequestMux3WakeQUADTPMCount0 = 9|0x400U,   /**< WAKE QUADTPM Counter 0 Overflow Request */
    kDmaRequestMux3WakeQUADTPMCount1 = 10|0x400U,  /**< WAKE QUADTPM Counter 1 Overflow Request */
    kDmaRequestMux3WakeQUADTPMCount2 = 11|0x400U,  /**< WAKE QUADTPM Counter 2 Overflow Request */
    kDmaRequestMux3WakeQUADTPMCount3 = 12|0x400U,  /**< WAKE QUADTPM Counter 3 Overflow Request */
    kDmaRequestMux3WakeQUADTPMChannel02 = 13|0x400U, /**< WAKE QUADTPM Channel 0/2 Overflow Request */
    kDmaRequestMux3WakeQUADTPMChannel13 = 14|0x400U, /**< WAKE QUADTPM Channel 1/3 Overflow Request */
    kDmaRequestMux3WakeQUADTPMChannel46 = 15|0x400U, /**< WAKE QUADTPM Channel 4/6 Overflow Request */
    kDmaRequestMux3WakeQUADTPMChannel57 = 16|0x400U, /**< WAKE QUADTPM Channel 5/7 Overflow Request */
    kDmaRequestMux3WakeI3CFromBus   = 17|0x400U,   /**< WAKE I3C From-bus DMA Request */
    kDmaRequestMux3WakeI3CToBus     = 18|0x400U,   /**< WAKE I3C to-bus DMA Request */
    kDmaRequestMux3WakeLPI2C0Tx     = 20|0x400U,   /**< WAKE LPI2C0 Master/Slave Transmit */
    kDmaRequestMux3WakeLPI2C0Rx     = 21|0x400U,   /**< WAKE LPI2C0 Master/Slave Receive */
    kDmaRequestMux3WakeLPI2C1Tx     = 22|0x400U,   /**< WAKE LPI2C1 Master/Slave Transmit */
    kDmaRequestMux3WakeLPI2C1Rx     = 23|0x400U,   /**< WAKE LPI2C1 Master/Slave Receive */
    kDmaRequestMux3WakeLPSPITx      = 24|0x400U,   /**< WAKE LPSPI Master/Slave Transmit */
    kDmaRequestMux3WakeLPSPIRx      = 25|0x400U,   /**< WAKE LPSPI Master/Slave Receive */
    kDmaRequestMux3WakeLPUART0Tx    = 26|0x400U,   /**< WAKE LPLPUART0 Master/Slave Transmit */
    kDmaRequestMux3WakeLPUART0Rx    = 27|0x400U,   /**< WAKE LPLPUART0 Master/Slave Receive */
    kDmaRequestMux3WakeLPUART1Tx    = 28|0x400U,   /**< WAKE LPLPUART1 Master/Slave Transmit */
    kDmaRequestMux3WakeLPUART1Rx    = 29|0x400U,   /**< WAKE LPLPUART1 Master/Slave Receive */
    kDmaRequestMux3WakeRGPIOChannel0 = 30|0x400U,  /**< WAKE RGPIO Channel 0 */
    kDmaRequestMux3WakeRGPIOChannel1 = 31|0x400U,  /**< WAKE RGPIO Channel 1 */
    kDmaRequestMux3WakeMic          = 32|0x400U,   /**< WAKE MICFIL Request */
    kDmaRequestMux3VbatLPTMR        = 35|0x400U,   /**< VBAT LPTMR Request */
    kDmaRequestMux3VbatLrRGPIOChannel0 = 36|0x400U, /**< VBAT RGPIO Channel 0 */
    kDmaRequestMux3VbatLrRGPIOChannel1 = 37|0x400U, /**< VBAT RGPIO Channel 1 */
} wake_edma3_request_source_t;

/* @} */

typedef enum _xbar_input_signal
{
    kAUDIO__XBAR_InputLogicLow      = 0|0x10000U,  /**< LOGIC_LOW output assigned to AUDIO_XBAR_IN0 input. */
    kAUDIO__XBAR_InputLogicHigh     = 1|0x10000U,  /**< LOGIC_HIGH output assigned to AUDIO_XBAR_IN1 input. */
    kAUDIO__XBAR_InputAudioEdmaTrigOut0 = 2|0x10000U, /**< AUDIO_EDMA_TRIG_OUT0 output assigned to AUDIO_XBAR_IN2 input. */
    kAUDIO__XBAR_InputRESERVED3     = 3|0x10000U,  /**< AUDIO_XBAR_IN3 input is reserved. */
    kAUDIO__XBAR_InputAudioEdmaIdle = 4|0x10000U,  /**< AUDIO_EDMA_IDLE output assigned to AUDIO_XBAR_IN4 input. */
    kAUDIO__XBAR_InputAudioSai0TxBclk = 5|0x10000U, /**< AUDIO_SAI0_TX_BCLK output assigned to AUDIO_XBAR_IN5 input. */
    kAUDIO__XBAR_InputAudioSai0RxBclk = 6|0x10000U, /**< AUDIO_SAI0_RX_BCLK output assigned to AUDIO_XBAR_IN6 input. */
    kAUDIO__XBAR_InputAudioSai0TxSync = 7|0x10000U, /**< AUDIO_SAI0_TX_SYNC output assigned to AUDIO_XBAR_IN7 input. */
    kAUDIO__XBAR_InputAudioSai0RxSync = 8|0x10000U, /**< AUDIO_SAI0_RX_SYNC output assigned to AUDIO_XBAR_IN8 input. */
    kAUDIO__XBAR_InputAudioSai1TxBclk = 9|0x10000U, /**< AUDIO_SAI1_TX_BCLK output assigned to AUDIO_XBAR_IN9 input. */
    kAUDIO__XBAR_InputAudioSai1RxBclk = 10|0x10000U, /**< AUDIO_SAI1_RX_BCLK output assigned to AUDIO_XBAR_IN10 input. */
    kAUDIO__XBAR_InputAudioSai1TxSync = 11|0x10000U, /**< AUDIO_SAI1_TX_SYNC output assigned to AUDIO_XBAR_IN11 input. */
    kAUDIO__XBAR_InputAudioSai1RxSync = 12|0x10000U, /**< AUDIO_SAI1_RX_SYNC output assigned to AUDIO_XBAR_IN12 input. */
    kAUDIO__XBAR_InputAudioSai2TxBclk = 13|0x10000U, /**< AUDIO_SAI2_TX_BCLK output assigned to AUDIO_XBAR_IN13 input. */
    kAUDIO__XBAR_InputAudioSai2RxBclk = 14|0x10000U, /**< AUDIO_SAI2_RX_BCLK output assigned to AUDIO_XBAR_IN14 input. */
    kAUDIO__XBAR_InputAudioSai2TxSync = 15|0x10000U, /**< AUDIO_SAI2_TX_SYNC output assigned to AUDIO_XBAR_IN15 input. */
    kAUDIO__XBAR_InputAudioSai2RxSync = 16|0x10000U, /**< AUDIO_SAI2_RX_SYNC output assigned to AUDIO_XBAR_IN16 input. */
    kAUDIO__XBAR_InputRESERVED17    = 17|0x10000U, /**< AUDIO_XBAR_IN17 input is reserved. */
    kAUDIO__XBAR_InputRESERVED18    = 18|0x10000U, /**< AUDIO_XBAR_IN18 input is reserved. */
    kAUDIO__XBAR_InputRESERVED19    = 19|0x10000U, /**< AUDIO_XBAR_IN19 input is reserved. */
    kAUDIO__XBAR_InputRESERVED20    = 20|0x10000U, /**< AUDIO_XBAR_IN20 input is reserved. */
    kAUDIO__XBAR_InputRESERVED21    = 21|0x10000U, /**< AUDIO_XBAR_IN21 input is reserved. */
    kAUDIO__XBAR_InputRESERVED22    = 22|0x10000U, /**< AUDIO_XBAR_IN22 input is reserved. */
    kAUDIO__XBAR_InputRESERVED23    = 23|0x10000U, /**< AUDIO_XBAR_IN23 input is reserved. */
    kAUDIO__XBAR_InputRESERVED24    = 24|0x10000U, /**< AUDIO_XBAR_IN24 input is reserved. */
    kAUDIO__XBAR_InputRESERVED25    = 25|0x10000U, /**< AUDIO_XBAR_IN25 input is reserved. */
    kAUDIO__XBAR_InputRESERVED26    = 26|0x10000U, /**< AUDIO_XBAR_IN26 input is reserved. */
    kAUDIO__XBAR_InputRESERVED27    = 27|0x10000U, /**< AUDIO_XBAR_IN27 input is reserved. */
    kAUDIO__XBAR_InputRESERVED28    = 28|0x10000U, /**< AUDIO_XBAR_IN28 input is reserved. */
    kAUDIO__XBAR_InputAudioSpdifRecClk = 29|0x10000U, /**< AUDIO_SPDIF_REC_CLK output assigned to AUDIO_XBAR_IN29 input. */
    kAUDIO__XBAR_InputAudioMicfilMicFilter = 30|0x10000U, /**< AUDIO_MICFIL_MIC_FILTER output assigned to AUDIO_XBAR_IN30 input. */
    kAUDIO__XBAR_InputRESERVED31    = 31|0x10000U, /**< AUDIO_XBAR_IN31 input is reserved. */
    kAUDIO__XBAR_InputRESERVED32    = 32|0x10000U, /**< AUDIO_XBAR_IN32 input is reserved. */
    kAUDIO__XBAR_InputRESERVED33    = 33|0x10000U, /**< AUDIO_XBAR_IN33 input is reserved. */
    kAUDIO__XBAR_InputRESERVED34    = 34|0x10000U, /**< AUDIO_XBAR_IN34 input is reserved. */
    kAUDIO__XBAR_InputRESERVED35    = 35|0x10000U, /**< AUDIO_XBAR_IN35 input is reserved. */
    kAUDIO__XBAR_InputRESERVED36    = 36|0x10000U, /**< AUDIO_XBAR_IN36 input is reserved. */
    kAUDIO__XBAR_InputRESERVED37    = 37|0x10000U, /**< AUDIO_XBAR_IN37 input is reserved. */
    kAUDIO__XBAR_InputRESERVED38    = 38|0x10000U, /**< AUDIO_XBAR_IN38 input is reserved. */
    kAUDIO__XBAR_InputRESERVED39    = 39|0x10000U, /**< AUDIO_XBAR_IN39 input is reserved. */
    kAUDIO__XBAR_InputRESERVED40    = 40|0x10000U, /**< AUDIO_XBAR_IN40 input is reserved. */
    kAUDIO__XBAR_InputRESERVED41    = 41|0x10000U, /**< AUDIO_XBAR_IN41 input is reserved. */
    kAUDIO__XBAR_InputRESERVED42    = 42|0x10000U, /**< AUDIO_XBAR_IN42 input is reserved. */
    kHSP__XBAR_0_InputLogicLow      = 0|0x20000U,  /**< LOGIC_LOW output assigned to HSP_XBAR_0_IN0 input. */
    kHSP__XBAR_0_InputLogicHigh     = 1|0x20000U,  /**< LOGIC_HIGH output assigned to HSP_XBAR_0_IN1 input. */
    kHSP__XBAR_0_InputHspXbar2Out0  = 2|0x20000U,  /**< HSP_XBAR2_OUT0 output assigned to HSP_XBAR_0_IN2 input. */
    kHSP__XBAR_0_InputHspXbar2Out1  = 3|0x20000U,  /**< HSP_XBAR2_OUT1 output assigned to HSP_XBAR_0_IN3 input. */
    kHSP__XBAR_0_InputHspXbar2Out2  = 4|0x20000U,  /**< HSP_XBAR2_OUT2 output assigned to HSP_XBAR_0_IN4 input. */
    kHSP__XBAR_0_InputHspXbar2Out3  = 5|0x20000U,  /**< HSP_XBAR2_OUT3 output assigned to HSP_XBAR_0_IN5 input. */
    kHSP__XBAR_0_InputHspXbar2Out4  = 6|0x20000U,  /**< HSP_XBAR2_OUT4 output assigned to HSP_XBAR_0_IN6 input. */
    kHSP__XBAR_0_InputHspXbar2Out5  = 7|0x20000U,  /**< HSP_XBAR2_OUT5 output assigned to HSP_XBAR_0_IN7 input. */
    kHSP__XBAR_0_InputHspXbar2Out6  = 8|0x20000U,  /**< HSP_XBAR2_OUT6 output assigned to HSP_XBAR_0_IN8 input. */
    kHSP__XBAR_0_InputHspXbar2Out7  = 9|0x20000U,  /**< HSP_XBAR2_OUT7 output assigned to HSP_XBAR_0_IN9 input. */
    kHSP__XBAR_0_InputHspXbar2Out8  = 10|0x20000U, /**< HSP_XBAR2_OUT8 output assigned to HSP_XBAR_0_IN10 input. */
    kHSP__XBAR_0_InputHspXbar2Out9  = 11|0x20000U, /**< HSP_XBAR2_OUT9 output assigned to HSP_XBAR_0_IN11 input. */
    kHSP__XBAR_0_InputHspXbar2Out10 = 12|0x20000U, /**< HSP_XBAR2_OUT10 output assigned to HSP_XBAR_0_IN12 input. */
    kHSP__XBAR_0_InputHspXbar2Out11 = 13|0x20000U, /**< HSP_XBAR2_OUT11 output assigned to HSP_XBAR_0_IN13 input. */
    kHSP__XBAR_0_InputHspXbar2Out12 = 14|0x20000U, /**< HSP_XBAR2_OUT12 output assigned to HSP_XBAR_0_IN14 input. */
    kHSP__XBAR_0_InputHspXbar2Out13 = 15|0x20000U, /**< HSP_XBAR2_OUT13 output assigned to HSP_XBAR_0_IN15 input. */
    kHSP__XBAR_0_InputHspXbar2Out14 = 16|0x20000U, /**< HSP_XBAR2_OUT14 output assigned to HSP_XBAR_0_IN16 input. */
    kHSP__XBAR_0_InputHspXbar2Out15 = 17|0x20000U, /**< HSP_XBAR2_OUT15 output assigned to HSP_XBAR_0_IN17 input. */
    kHSP__XBAR_0_InputHspXbar2Out16 = 18|0x20000U, /**< HSP_XBAR2_OUT16 output assigned to HSP_XBAR_0_IN18 input. */
    kHSP__XBAR_0_InputHspXbar2Out17 = 19|0x20000U, /**< HSP_XBAR2_OUT17 output assigned to HSP_XBAR_0_IN19 input. */
    kHSP__XBAR_0_InputHspXbar2Out18 = 20|0x20000U, /**< HSP_XBAR2_OUT18 output assigned to HSP_XBAR_0_IN20 input. */
    kHSP__XBAR_0_InputHspXbar2Out19 = 21|0x20000U, /**< HSP_XBAR2_OUT19 output assigned to HSP_XBAR_0_IN21 input. */
    kHSP__XBAR_0_InputHspXbar2Out20 = 22|0x20000U, /**< HSP_XBAR2_OUT20 output assigned to HSP_XBAR_0_IN22 input. */
    kHSP__XBAR_0_InputHspXbar2Out21 = 23|0x20000U, /**< HSP_XBAR2_OUT21 output assigned to HSP_XBAR_0_IN23 input. */
    kHSP__XBAR_0_InputHspXbar2Out22 = 24|0x20000U, /**< HSP_XBAR2_OUT22 output assigned to HSP_XBAR_0_IN24 input. */
    kHSP__XBAR_0_InputHspXbar2Out23 = 25|0x20000U, /**< HSP_XBAR2_OUT23 output assigned to HSP_XBAR_0_IN25 input. */
    kHSP__XBAR_0_InputHspXbar2Out24 = 26|0x20000U, /**< HSP_XBAR2_OUT24 output assigned to HSP_XBAR_0_IN26 input. */
    kHSP__XBAR_0_InputHspXbar2Out25 = 27|0x20000U, /**< HSP_XBAR2_OUT25 output assigned to HSP_XBAR_0_IN27 input. */
    kHSP__XBAR_0_InputHspXbar2Out26 = 28|0x20000U, /**< HSP_XBAR2_OUT26 output assigned to HSP_XBAR_0_IN28 input. */
    kHSP__XBAR_0_InputHspXbar2Out27 = 29|0x20000U, /**< HSP_XBAR2_OUT27 output assigned to HSP_XBAR_0_IN29 input. */
    kHSP__XBAR_0_InputHspXbar2Out28 = 30|0x20000U, /**< HSP_XBAR2_OUT28 output assigned to HSP_XBAR_0_IN30 input. */
    kHSP__XBAR_0_InputHspXbar2Out29 = 31|0x20000U, /**< HSP_XBAR2_OUT29 output assigned to HSP_XBAR_0_IN31 input. */
    kHSP__XBAR_0_InputHspXbar2Out30 = 32|0x20000U, /**< HSP_XBAR2_OUT30 output assigned to HSP_XBAR_0_IN32 input. */
    kHSP__XBAR_0_InputHspXbar2Out31 = 33|0x20000U, /**< HSP_XBAR2_OUT31 output assigned to HSP_XBAR_0_IN33 input. */
    kHSP__XBAR_0_InputHspXbar2Out32 = 34|0x20000U, /**< HSP_XBAR2_OUT32 output assigned to HSP_XBAR_0_IN34 input. */
    kHSP__XBAR_0_InputHspXbar2Out33 = 35|0x20000U, /**< HSP_XBAR2_OUT33 output assigned to HSP_XBAR_0_IN35 input. */
    kHSP__XBAR_0_InputHspXbar2Out34 = 36|0x20000U, /**< HSP_XBAR2_OUT34 output assigned to HSP_XBAR_0_IN36 input. */
    kHSP__XBAR_0_InputHspXbar2Out35 = 37|0x20000U, /**< HSP_XBAR2_OUT35 output assigned to HSP_XBAR_0_IN37 input. */
    kHSP__XBAR_0_InputHspXbar2Out36 = 38|0x20000U, /**< HSP_XBAR2_OUT36 output assigned to HSP_XBAR_0_IN38 input. */
    kHSP__XBAR_0_InputHspXbar2Out37 = 39|0x20000U, /**< HSP_XBAR2_OUT37 output assigned to HSP_XBAR_0_IN39 input. */
    kHSP__XBAR_0_InputHspXbar2Out38 = 40|0x20000U, /**< HSP_XBAR2_OUT38 output assigned to HSP_XBAR_0_IN40 input. */
    kHSP__XBAR_0_InputHspXbar2Out39 = 41|0x20000U, /**< HSP_XBAR2_OUT39 output assigned to HSP_XBAR_0_IN41 input. */
    kHSP__XBAR_0_InputHspEvtg0Outa0 = 42|0x20000U, /**< HSP_EVTG0_OUTA0 output assigned to HSP_XBAR_0_IN42 input. */
    kHSP__XBAR_0_InputHspEvtg0Outb0 = 43|0x20000U, /**< HSP_EVTG0_OUTB0 output assigned to HSP_XBAR_0_IN43 input. */
    kHSP__XBAR_0_InputHspEvtg0Outa1 = 44|0x20000U, /**< HSP_EVTG0_OUTA1 output assigned to HSP_XBAR_0_IN44 input. */
    kHSP__XBAR_0_InputHspEvtg0Outb1 = 45|0x20000U, /**< HSP_EVTG0_OUTB1 output assigned to HSP_XBAR_0_IN45 input. */
    kHSP__XBAR_0_InputHspEvtg0Outa2 = 46|0x20000U, /**< HSP_EVTG0_OUTA2 output assigned to HSP_XBAR_0_IN46 input. */
    kHSP__XBAR_0_InputHspEvtg0Outb2 = 47|0x20000U, /**< HSP_EVTG0_OUTB2 output assigned to HSP_XBAR_0_IN47 input. */
    kHSP__XBAR_0_InputHspEvtg0Outa3 = 48|0x20000U, /**< HSP_EVTG0_OUTA3 output assigned to HSP_XBAR_0_IN48 input. */
    kHSP__XBAR_0_InputHspEvtg0Outb3 = 49|0x20000U, /**< HSP_EVTG0_OUTB3 output assigned to HSP_XBAR_0_IN49 input. */
    kHSP__XBAR_0_InputHspEvtg1Outa0 = 50|0x20000U, /**< HSP_EVTG1_OUTA0 output assigned to HSP_XBAR_0_IN50 input. */
    kHSP__XBAR_0_InputHspEvtg1Outb0 = 51|0x20000U, /**< HSP_EVTG1_OUTB0 output assigned to HSP_XBAR_0_IN51 input. */
    kHSP__XBAR_0_InputHspEvtg1Outa1 = 52|0x20000U, /**< HSP_EVTG1_OUTA1 output assigned to HSP_XBAR_0_IN52 input. */
    kHSP__XBAR_0_InputHspEvtg1Outb1 = 53|0x20000U, /**< HSP_EVTG1_OUTB1 output assigned to HSP_XBAR_0_IN53 input. */
    kHSP__XBAR_0_InputHspEvtg1Outa2 = 54|0x20000U, /**< HSP_EVTG1_OUTA2 output assigned to HSP_XBAR_0_IN54 input. */
    kHSP__XBAR_0_InputHspEvtg1Outb2 = 55|0x20000U, /**< HSP_EVTG1_OUTB2 output assigned to HSP_XBAR_0_IN55 input. */
    kHSP__XBAR_0_InputHspEvtg1Outa3 = 56|0x20000U, /**< HSP_EVTG1_OUTA3 output assigned to HSP_XBAR_0_IN56 input. */
    kHSP__XBAR_0_InputHspEvtg1Outb3 = 57|0x20000U, /**< HSP_EVTG1_OUTB3 output assigned to HSP_XBAR_0_IN57 input. */
    kHSP__XBAR_0_InputHspEvtg2Outa0 = 58|0x20000U, /**< HSP_EVTG2_OUTA0 output assigned to HSP_XBAR_0_IN58 input. */
    kHSP__XBAR_0_InputHspEvtg2Outb0 = 59|0x20000U, /**< HSP_EVTG2_OUTB0 output assigned to HSP_XBAR_0_IN59 input. */
    kHSP__XBAR_0_InputHspEvtg2Outa1 = 60|0x20000U, /**< HSP_EVTG2_OUTA1 output assigned to HSP_XBAR_0_IN60 input. */
    kHSP__XBAR_0_InputHspEvtg2Outb1 = 61|0x20000U, /**< HSP_EVTG2_OUTB1 output assigned to HSP_XBAR_0_IN61 input. */
    kHSP__XBAR_0_InputHspEvtg2Outa2 = 62|0x20000U, /**< HSP_EVTG2_OUTA2 output assigned to HSP_XBAR_0_IN62 input. */
    kHSP__XBAR_0_InputHspEvtg2Outb2 = 63|0x20000U, /**< HSP_EVTG2_OUTB2 output assigned to HSP_XBAR_0_IN63 input. */
    kHSP__XBAR_0_InputHspEvtg2Outa3 = 64|0x20000U, /**< HSP_EVTG2_OUTA3 output assigned to HSP_XBAR_0_IN64 input. */
    kHSP__XBAR_0_InputHspEvtg2Outb3 = 65|0x20000U, /**< HSP_EVTG2_OUTB3 output assigned to HSP_XBAR_0_IN65 input. */
    kHSP__XBAR_0_InputHspEvtg3Outa0 = 66|0x20000U, /**< HSP_EVTG3_OUTA0 output assigned to HSP_XBAR_0_IN66 input. */
    kHSP__XBAR_0_InputHspEvtg3Outb0 = 67|0x20000U, /**< HSP_EVTG3_OUTB0 output assigned to HSP_XBAR_0_IN67 input. */
    kHSP__XBAR_0_InputHspEvtg3Outa1 = 68|0x20000U, /**< HSP_EVTG3_OUTA1 output assigned to HSP_XBAR_0_IN68 input. */
    kHSP__XBAR_0_InputHspEvtg3Outb1 = 69|0x20000U, /**< HSP_EVTG3_OUTB1 output assigned to HSP_XBAR_0_IN69 input. */
    kHSP__XBAR_0_InputHspEvtg3Outa2 = 70|0x20000U, /**< HSP_EVTG3_OUTA2 output assigned to HSP_XBAR_0_IN70 input. */
    kHSP__XBAR_0_InputHspEvtg3Outb2 = 71|0x20000U, /**< HSP_EVTG3_OUTB2 output assigned to HSP_XBAR_0_IN71 input. */
    kHSP__XBAR_0_InputHspEvtg3Outa3 = 72|0x20000U, /**< HSP_EVTG3_OUTA3 output assigned to HSP_XBAR_0_IN72 input. */
    kHSP__XBAR_0_InputHspEvtg3Outb3 = 73|0x20000U, /**< HSP_EVTG3_OUTB3 output assigned to HSP_XBAR_0_IN73 input. */
    kHSP__XBAR_0_InputAudioXbarOut5 = 74|0x20000U, /**< AUDIO_XBAR_OUT5 output assigned to HSP_XBAR_0_IN74 input. */
    kHSP__XBAR_0_InputAudioXbarOut6 = 75|0x20000U, /**< AUDIO_XBAR_OUT6 output assigned to HSP_XBAR_0_IN75 input. */
    kHSP__XBAR_0_InputAudioXbarOut7 = 76|0x20000U, /**< AUDIO_XBAR_OUT7 output assigned to HSP_XBAR_0_IN76 input. */
    kHSP__XBAR_0_InputAudioXbarOut8 = 77|0x20000U, /**< AUDIO_XBAR_OUT8 output assigned to HSP_XBAR_0_IN77 input. */
    kHSP__XBAR_0_InputWakeXbarOut21 = 78|0x20000U, /**< WAKE_XBAR_OUT21 output assigned to HSP_XBAR_0_IN78 input. */
    kHSP__XBAR_0_InputWakeXbarOut22 = 79|0x20000U, /**< WAKE_XBAR_OUT22 output assigned to HSP_XBAR_0_IN79 input. */
    kHSP__XBAR_0_InputWakeXbarOut23 = 80|0x20000U, /**< WAKE_XBAR_OUT23 output assigned to HSP_XBAR_0_IN80 input. */
    kHSP__XBAR_0_InputWakeXbarOut24 = 81|0x20000U, /**< WAKE_XBAR_OUT24 output assigned to HSP_XBAR_0_IN81 input. */
    kHSP__XBAR_0_InputWakeXbarOut25 = 82|0x20000U, /**< WAKE_XBAR_OUT25 output assigned to HSP_XBAR_0_IN82 input. */
    kHSP__XBAR_0_InputWakeXbarOut26 = 83|0x20000U, /**< WAKE_XBAR_OUT26 output assigned to HSP_XBAR_0_IN83 input. */
    kHSP__XBAR_0_InputWakeXbarOut27 = 84|0x20000U, /**< WAKE_XBAR_OUT27 output assigned to HSP_XBAR_0_IN84 input. */
    kHSP__XBAR_0_InputWakeXbarOut28 = 85|0x20000U, /**< WAKE_XBAR_OUT28 output assigned to HSP_XBAR_0_IN85 input. */
    kHSP__XBAR_0_InputHspXbar0In0   = 86|0x20000U, /**< HSP_XBAR0_IN0 output assigned to HSP_XBAR_0_IN86 input. */
    kHSP__XBAR_0_InputHspXbar0In1   = 87|0x20000U, /**< HSP_XBAR0_IN1 output assigned to HSP_XBAR_0_IN87 input. */
    kHSP__XBAR_0_InputHspXbar0In2   = 88|0x20000U, /**< HSP_XBAR0_IN2 output assigned to HSP_XBAR_0_IN88 input. */
    kHSP__XBAR_0_InputHspXbar0In3   = 89|0x20000U, /**< HSP_XBAR0_IN3 output assigned to HSP_XBAR_0_IN89 input. */
    kHSP__XBAR_0_InputHspXbar0In4   = 90|0x20000U, /**< HSP_XBAR0_IN4 output assigned to HSP_XBAR_0_IN90 input. */
    kHSP__XBAR_0_InputHspXbar0In5   = 91|0x20000U, /**< HSP_XBAR0_IN5 output assigned to HSP_XBAR_0_IN91 input. */
    kHSP__XBAR_0_InputHspXbar0In6   = 92|0x20000U, /**< HSP_XBAR0_IN6 output assigned to HSP_XBAR_0_IN92 input. */
    kHSP__XBAR_0_InputHspXbar0In7   = 93|0x20000U, /**< HSP_XBAR0_IN7 output assigned to HSP_XBAR_0_IN93 input. */
    kHSP__XBAR_0_InputHspXbar0In8   = 94|0x20000U, /**< HSP_XBAR0_IN8 output assigned to HSP_XBAR_0_IN94 input. */
    kHSP__XBAR_0_InputHspXbar0In9   = 95|0x20000U, /**< HSP_XBAR0_IN9 output assigned to HSP_XBAR_0_IN95 input. */
    kHSP__XBAR_0_InputHspXbar0In10  = 96|0x20000U, /**< HSP_XBAR0_IN10 output assigned to HSP_XBAR_0_IN96 input. */
    kHSP__XBAR_0_InputHspXbar0In11  = 97|0x20000U, /**< HSP_XBAR0_IN11 output assigned to HSP_XBAR_0_IN97 input. */
    kHSP__XBAR_0_InputHspXbar0In12  = 98|0x20000U, /**< HSP_XBAR0_IN12 output assigned to HSP_XBAR_0_IN98 input. */
    kHSP__XBAR_0_InputHspXbar0In13  = 99|0x20000U, /**< HSP_XBAR0_IN13 output assigned to HSP_XBAR_0_IN99 input. */
    kHSP__XBAR_0_InputHspXbar0In14  = 100|0x20000U, /**< HSP_XBAR0_IN14 output assigned to HSP_XBAR_0_IN100 input. */
    kHSP__XBAR_0_InputHspXbar0In15  = 101|0x20000U, /**< HSP_XBAR0_IN15 output assigned to HSP_XBAR_0_IN101 input. */
    kHSP__XBAR_0_InputHspXbar0In16  = 102|0x20000U, /**< HSP_XBAR0_IN16 output assigned to HSP_XBAR_0_IN102 input. */
    kHSP__XBAR_0_InputHspXbar0In17  = 103|0x20000U, /**< HSP_XBAR0_IN17 output assigned to HSP_XBAR_0_IN103 input. */
    kHSP__XBAR_0_InputHspXbar0In18  = 104|0x20000U, /**< HSP_XBAR0_IN18 output assigned to HSP_XBAR_0_IN104 input. */
    kHSP__XBAR_0_InputHspXbar0In19  = 105|0x20000U, /**< HSP_XBAR0_IN19 output assigned to HSP_XBAR_0_IN105 input. */
    kHSP__XBAR_0_InputHspXbar0In20  = 106|0x20000U, /**< HSP_XBAR0_IN20 output assigned to HSP_XBAR_0_IN106 input. */
    kHSP__XBAR_0_InputHspXbar0In21  = 107|0x20000U, /**< HSP_XBAR0_IN21 output assigned to HSP_XBAR_0_IN107 input. */
    kHSP__XBAR_0_InputHspXbar0In22  = 108|0x20000U, /**< HSP_XBAR0_IN22 output assigned to HSP_XBAR_0_IN108 input. */
    kHSP__XBAR_0_InputHspXbar0In23  = 109|0x20000U, /**< HSP_XBAR0_IN23 output assigned to HSP_XBAR_0_IN109 input. */
    kHSP__XBAR_0_InputHspXbar0In24  = 110|0x20000U, /**< HSP_XBAR0_IN24 output assigned to HSP_XBAR_0_IN110 input. */
    kHSP__XBAR_0_InputHspXbar0In25  = 111|0x20000U, /**< HSP_XBAR0_IN25 output assigned to HSP_XBAR_0_IN111 input. */
    kHSP__XBAR_0_InputHspXbar0In26  = 112|0x20000U, /**< HSP_XBAR0_IN26 output assigned to HSP_XBAR_0_IN112 input. */
    kHSP__XBAR_0_InputHspXbar0In27  = 113|0x20000U, /**< HSP_XBAR0_IN27 output assigned to HSP_XBAR_0_IN113 input. */
    kHSP__XBAR_0_InputHspXbar0In28  = 114|0x20000U, /**< HSP_XBAR0_IN28 output assigned to HSP_XBAR_0_IN114 input. */
    kHSP__XBAR_0_InputHspXbar0In29  = 115|0x20000U, /**< HSP_XBAR0_IN29 output assigned to HSP_XBAR_0_IN115 input. */
    kHSP__XBAR_0_InputHspXbar0In30  = 116|0x20000U, /**< HSP_XBAR0_IN30 output assigned to HSP_XBAR_0_IN116 input. */
    kHSP__XBAR_0_InputHspXbar0In31  = 117|0x20000U, /**< HSP_XBAR0_IN31 output assigned to HSP_XBAR_0_IN117 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut0 = 118|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT0 output assigned to HSP_XBAR_0_IN118 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut1 = 119|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT1 output assigned to HSP_XBAR_0_IN119 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut2 = 120|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT2 output assigned to HSP_XBAR_0_IN120 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut3 = 121|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT3 output assigned to HSP_XBAR_0_IN121 input. */
