zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
    kHSP__XBAR_0_InputHspTrgsync1TrigOut4 = 122|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT4 output assigned to HSP_XBAR_0_IN122 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut5 = 123|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT5 output assigned to HSP_XBAR_0_IN123 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut6 = 124|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT6 output assigned to HSP_XBAR_0_IN124 input. */
    kHSP__XBAR_0_InputHspTrgsync1TrigOut7 = 125|0x20000U, /**< HSP_TRGSYNC1_TRIG_OUT7 output assigned to HSP_XBAR_0_IN125 input. */
    kHSP__XBAR_1_InputLogicLow      = 0|0x30000U,  /**< LOGIC_LOW output assigned to HSP_XBAR_1_IN0 input. */
    kHSP__XBAR_1_InputLogicHigh     = 1|0x30000U,  /**< LOGIC_HIGH output assigned to HSP_XBAR_1_IN1 input. */
    kHSP__XBAR_1_InputHspXbar2Out0  = 2|0x30000U,  /**< HSP_XBAR2_OUT0 output assigned to HSP_XBAR_1_IN2 input. */
    kHSP__XBAR_1_InputHspXbar2Out1  = 3|0x30000U,  /**< HSP_XBAR2_OUT1 output assigned to HSP_XBAR_1_IN3 input. */
    kHSP__XBAR_1_InputHspXbar2Out2  = 4|0x30000U,  /**< HSP_XBAR2_OUT2 output assigned to HSP_XBAR_1_IN4 input. */
    kHSP__XBAR_1_InputHspXbar2Out3  = 5|0x30000U,  /**< HSP_XBAR2_OUT3 output assigned to HSP_XBAR_1_IN5 input. */
    kHSP__XBAR_1_InputHspXbar2Out4  = 6|0x30000U,  /**< HSP_XBAR2_OUT4 output assigned to HSP_XBAR_1_IN6 input. */
    kHSP__XBAR_1_InputHspXbar2Out5  = 7|0x30000U,  /**< HSP_XBAR2_OUT5 output assigned to HSP_XBAR_1_IN7 input. */
    kHSP__XBAR_1_InputHspXbar2Out6  = 8|0x30000U,  /**< HSP_XBAR2_OUT6 output assigned to HSP_XBAR_1_IN8 input. */
    kHSP__XBAR_1_InputHspXbar2Out7  = 9|0x30000U,  /**< HSP_XBAR2_OUT7 output assigned to HSP_XBAR_1_IN9 input. */
    kHSP__XBAR_1_InputHspXbar2Out8  = 10|0x30000U, /**< HSP_XBAR2_OUT8 output assigned to HSP_XBAR_1_IN10 input. */
    kHSP__XBAR_1_InputHspXbar2Out9  = 11|0x30000U, /**< HSP_XBAR2_OUT9 output assigned to HSP_XBAR_1_IN11 input. */
    kHSP__XBAR_1_InputHspXbar2Out10 = 12|0x30000U, /**< HSP_XBAR2_OUT10 output assigned to HSP_XBAR_1_IN12 input. */
    kHSP__XBAR_1_InputHspXbar2Out11 = 13|0x30000U, /**< HSP_XBAR2_OUT11 output assigned to HSP_XBAR_1_IN13 input. */
    kHSP__XBAR_1_InputHspXbar2Out12 = 14|0x30000U, /**< HSP_XBAR2_OUT12 output assigned to HSP_XBAR_1_IN14 input. */
    kHSP__XBAR_1_InputHspXbar2Out13 = 15|0x30000U, /**< HSP_XBAR2_OUT13 output assigned to HSP_XBAR_1_IN15 input. */
    kHSP__XBAR_1_InputHspXbar2Out14 = 16|0x30000U, /**< HSP_XBAR2_OUT14 output assigned to HSP_XBAR_1_IN16 input. */
    kHSP__XBAR_1_InputHspXbar2Out15 = 17|0x30000U, /**< HSP_XBAR2_OUT15 output assigned to HSP_XBAR_1_IN17 input. */
    kHSP__XBAR_1_InputHspXbar2Out16 = 18|0x30000U, /**< HSP_XBAR2_OUT16 output assigned to HSP_XBAR_1_IN18 input. */
    kHSP__XBAR_1_InputHspXbar2Out17 = 19|0x30000U, /**< HSP_XBAR2_OUT17 output assigned to HSP_XBAR_1_IN19 input. */
    kHSP__XBAR_1_InputHspXbar2Out18 = 20|0x30000U, /**< HSP_XBAR2_OUT18 output assigned to HSP_XBAR_1_IN20 input. */
    kHSP__XBAR_1_InputHspXbar2Out19 = 21|0x30000U, /**< HSP_XBAR2_OUT19 output assigned to HSP_XBAR_1_IN21 input. */
    kHSP__XBAR_1_InputHspXbar2Out20 = 22|0x30000U, /**< HSP_XBAR2_OUT20 output assigned to HSP_XBAR_1_IN22 input. */
    kHSP__XBAR_1_InputHspXbar2Out21 = 23|0x30000U, /**< HSP_XBAR2_OUT21 output assigned to HSP_XBAR_1_IN23 input. */
    kHSP__XBAR_1_InputHspXbar2Out22 = 24|0x30000U, /**< HSP_XBAR2_OUT22 output assigned to HSP_XBAR_1_IN24 input. */
    kHSP__XBAR_1_InputHspXbar2Out23 = 25|0x30000U, /**< HSP_XBAR2_OUT23 output assigned to HSP_XBAR_1_IN25 input. */
    kHSP__XBAR_1_InputHspXbar2Out24 = 26|0x30000U, /**< HSP_XBAR2_OUT24 output assigned to HSP_XBAR_1_IN26 input. */
    kHSP__XBAR_1_InputHspXbar2Out25 = 27|0x30000U, /**< HSP_XBAR2_OUT25 output assigned to HSP_XBAR_1_IN27 input. */
    kHSP__XBAR_1_InputHspXbar2Out26 = 28|0x30000U, /**< HSP_XBAR2_OUT26 output assigned to HSP_XBAR_1_IN28 input. */
    kHSP__XBAR_1_InputHspXbar2Out27 = 29|0x30000U, /**< HSP_XBAR2_OUT27 output assigned to HSP_XBAR_1_IN29 input. */
    kHSP__XBAR_1_InputHspXbar2Out28 = 30|0x30000U, /**< HSP_XBAR2_OUT28 output assigned to HSP_XBAR_1_IN30 input. */
    kHSP__XBAR_1_InputHspXbar2Out29 = 31|0x30000U, /**< HSP_XBAR2_OUT29 output assigned to HSP_XBAR_1_IN31 input. */
    kHSP__XBAR_1_InputHspXbar2Out30 = 32|0x30000U, /**< HSP_XBAR2_OUT30 output assigned to HSP_XBAR_1_IN32 input. */
    kHSP__XBAR_1_InputHspXbar2Out31 = 33|0x30000U, /**< HSP_XBAR2_OUT31 output assigned to HSP_XBAR_1_IN33 input. */
    kHSP__XBAR_1_InputHspXbar2Out32 = 34|0x30000U, /**< HSP_XBAR2_OUT32 output assigned to HSP_XBAR_1_IN34 input. */
    kHSP__XBAR_1_InputHspXbar2Out33 = 35|0x30000U, /**< HSP_XBAR2_OUT33 output assigned to HSP_XBAR_1_IN35 input. */
    kHSP__XBAR_1_InputHspXbar2Out34 = 36|0x30000U, /**< HSP_XBAR2_OUT34 output assigned to HSP_XBAR_1_IN36 input. */
    kHSP__XBAR_1_InputHspXbar2Out35 = 37|0x30000U, /**< HSP_XBAR2_OUT35 output assigned to HSP_XBAR_1_IN37 input. */
    kHSP__XBAR_1_InputHspXbar2Out36 = 38|0x30000U, /**< HSP_XBAR2_OUT36 output assigned to HSP_XBAR_1_IN38 input. */
    kHSP__XBAR_1_InputHspXbar2Out37 = 39|0x30000U, /**< HSP_XBAR2_OUT37 output assigned to HSP_XBAR_1_IN39 input. */
    kHSP__XBAR_1_InputHspXbar2Out38 = 40|0x30000U, /**< HSP_XBAR2_OUT38 output assigned to HSP_XBAR_1_IN40 input. */
    kHSP__XBAR_1_InputHspXbar2Out39 = 41|0x30000U, /**< HSP_XBAR2_OUT39 output assigned to HSP_XBAR_1_IN41 input. */
    kHSP__XBAR_1_InputAudioXbarOut5 = 42|0x30000U, /**< AUDIO_XBAR_OUT5 output assigned to HSP_XBAR_1_IN42 input. */
    kHSP__XBAR_1_InputAudioXbarOut6 = 43|0x30000U, /**< AUDIO_XBAR_OUT6 output assigned to HSP_XBAR_1_IN43 input. */
    kHSP__XBAR_1_InputAudioXbarOut7 = 44|0x30000U, /**< AUDIO_XBAR_OUT7 output assigned to HSP_XBAR_1_IN44 input. */
    kHSP__XBAR_1_InputAudioXbarOut8 = 45|0x30000U, /**< AUDIO_XBAR_OUT8 output assigned to HSP_XBAR_1_IN45 input. */
    kHSP__XBAR_1_InputWakeXbarOut21 = 46|0x30000U, /**< WAKE_XBAR_OUT21 output assigned to HSP_XBAR_1_IN46 input. */
    kHSP__XBAR_1_InputWakeXbarOut22 = 47|0x30000U, /**< WAKE_XBAR_OUT22 output assigned to HSP_XBAR_1_IN47 input. */
    kHSP__XBAR_1_InputWakeXbarOut23 = 48|0x30000U, /**< WAKE_XBAR_OUT23 output assigned to HSP_XBAR_1_IN48 input. */
    kHSP__XBAR_1_InputWakeXbarOut24 = 49|0x30000U, /**< WAKE_XBAR_OUT24 output assigned to HSP_XBAR_1_IN49 input. */
    kHSP__XBAR_1_InputWakeXbarOut25 = 50|0x30000U, /**< WAKE_XBAR_OUT25 output assigned to HSP_XBAR_1_IN50 input. */
    kHSP__XBAR_1_InputWakeXbarOut26 = 51|0x30000U, /**< WAKE_XBAR_OUT26 output assigned to HSP_XBAR_1_IN51 input. */
    kHSP__XBAR_1_InputWakeXbarOut27 = 52|0x30000U, /**< WAKE_XBAR_OUT27 output assigned to HSP_XBAR_1_IN52 input. */
    kHSP__XBAR_1_InputWakeXbarOut28 = 53|0x30000U, /**< WAKE_XBAR_OUT28 output assigned to HSP_XBAR_1_IN53 input. */
    kHSP__XBAR_1_InputHspXbar1In0   = 54|0x30000U, /**< HSP_XBAR1_IN0 output assigned to HSP_XBAR_1_IN54 input. */
    kHSP__XBAR_1_InputHspXbar1In1   = 55|0x30000U, /**< HSP_XBAR1_IN1 output assigned to HSP_XBAR_1_IN55 input. */
    kHSP__XBAR_1_InputHspXbar1In2   = 56|0x30000U, /**< HSP_XBAR1_IN2 output assigned to HSP_XBAR_1_IN56 input. */
    kHSP__XBAR_1_InputHspXbar1In3   = 57|0x30000U, /**< HSP_XBAR1_IN3 output assigned to HSP_XBAR_1_IN57 input. */
    kHSP__XBAR_1_InputHspXbar1In4   = 58|0x30000U, /**< HSP_XBAR1_IN4 output assigned to HSP_XBAR_1_IN58 input. */
    kHSP__XBAR_1_InputHspXbar1In5   = 59|0x30000U, /**< HSP_XBAR1_IN5 output assigned to HSP_XBAR_1_IN59 input. */
    kHSP__XBAR_1_InputHspXbar1In6   = 60|0x30000U, /**< HSP_XBAR1_IN6 output assigned to HSP_XBAR_1_IN60 input. */
    kHSP__XBAR_1_InputHspXbar1In7   = 61|0x30000U, /**< HSP_XBAR1_IN7 output assigned to HSP_XBAR_1_IN61 input. */
    kHSP__XBAR_1_InputHspXbar1In8   = 62|0x30000U, /**< HSP_XBAR1_IN8 output assigned to HSP_XBAR_1_IN62 input. */
    kHSP__XBAR_1_InputHspXbar1In9   = 63|0x30000U, /**< HSP_XBAR1_IN9 output assigned to HSP_XBAR_1_IN63 input. */
    kHSP__XBAR_1_InputHspXbar1In10  = 64|0x30000U, /**< HSP_XBAR1_IN10 output assigned to HSP_XBAR_1_IN64 input. */
    kHSP__XBAR_1_InputHspXbar1In11  = 65|0x30000U, /**< HSP_XBAR1_IN11 output assigned to HSP_XBAR_1_IN65 input. */
    kHSP__XBAR_1_InputHspXbar1In12  = 66|0x30000U, /**< HSP_XBAR1_IN12 output assigned to HSP_XBAR_1_IN66 input. */
    kHSP__XBAR_1_InputHspXbar1In13  = 67|0x30000U, /**< HSP_XBAR1_IN13 output assigned to HSP_XBAR_1_IN67 input. */
    kHSP__XBAR_1_InputHspXbar1In14  = 68|0x30000U, /**< HSP_XBAR1_IN14 output assigned to HSP_XBAR_1_IN68 input. */
    kHSP__XBAR_1_InputHspXbar1In15  = 69|0x30000U, /**< HSP_XBAR1_IN15 output assigned to HSP_XBAR_1_IN69 input. */
    kHSP__XBAR_1_InputHspXbar1In16  = 70|0x30000U, /**< HSP_XBAR1_IN16 output assigned to HSP_XBAR_1_IN70 input. */
    kHSP__XBAR_1_InputHspXbar1In17  = 71|0x30000U, /**< HSP_XBAR1_IN17 output assigned to HSP_XBAR_1_IN71 input. */
    kHSP__XBAR_1_InputHspXbar1In18  = 72|0x30000U, /**< HSP_XBAR1_IN18 output assigned to HSP_XBAR_1_IN72 input. */
    kHSP__XBAR_1_InputHspXbar1In19  = 73|0x30000U, /**< HSP_XBAR1_IN19 output assigned to HSP_XBAR_1_IN73 input. */
    kHSP__XBAR_1_InputHspXbar1In20  = 74|0x30000U, /**< HSP_XBAR1_IN20 output assigned to HSP_XBAR_1_IN74 input. */
    kHSP__XBAR_1_InputHspXbar1In21  = 75|0x30000U, /**< HSP_XBAR1_IN21 output assigned to HSP_XBAR_1_IN75 input. */
    kHSP__XBAR_1_InputHspXbar1In22  = 76|0x30000U, /**< HSP_XBAR1_IN22 output assigned to HSP_XBAR_1_IN76 input. */
    kHSP__XBAR_1_InputHspXbar1In23  = 77|0x30000U, /**< HSP_XBAR1_IN23 output assigned to HSP_XBAR_1_IN77 input. */
    kHSP__XBAR_1_InputHspXbar1In24  = 78|0x30000U, /**< HSP_XBAR1_IN24 output assigned to HSP_XBAR_1_IN78 input. */
    kHSP__XBAR_1_InputHspXbar1In25  = 79|0x30000U, /**< HSP_XBAR1_IN25 output assigned to HSP_XBAR_1_IN79 input. */
    kHSP__XBAR_1_InputHspXbar1In26  = 80|0x30000U, /**< HSP_XBAR1_IN26 output assigned to HSP_XBAR_1_IN80 input. */
    kHSP__XBAR_1_InputHspXbar1In27  = 81|0x30000U, /**< HSP_XBAR1_IN27 output assigned to HSP_XBAR_1_IN81 input. */
    kHSP__XBAR_1_InputHspXbar1In28  = 82|0x30000U, /**< HSP_XBAR1_IN28 output assigned to HSP_XBAR_1_IN82 input. */
    kHSP__XBAR_1_InputHspXbar1In29  = 83|0x30000U, /**< HSP_XBAR1_IN29 output assigned to HSP_XBAR_1_IN83 input. */
    kHSP__XBAR_1_InputHspXbar1In30  = 84|0x30000U, /**< HSP_XBAR1_IN30 output assigned to HSP_XBAR_1_IN84 input. */
    kHSP__XBAR_1_InputHspXbar1In31  = 85|0x30000U, /**< HSP_XBAR1_IN31 output assigned to HSP_XBAR_1_IN85 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut0 = 86|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT0 output assigned to HSP_XBAR_1_IN86 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut1 = 87|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT1 output assigned to HSP_XBAR_1_IN87 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut2 = 88|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT2 output assigned to HSP_XBAR_1_IN88 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut3 = 89|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT3 output assigned to HSP_XBAR_1_IN89 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut4 = 90|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT4 output assigned to HSP_XBAR_1_IN90 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut5 = 91|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT5 output assigned to HSP_XBAR_1_IN91 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut6 = 92|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT6 output assigned to HSP_XBAR_1_IN92 input. */
    kHSP__XBAR_1_InputHspTrgsync1TrigOut7 = 93|0x30000U, /**< HSP_TRGSYNC1_TRIG_OUT7 output assigned to HSP_XBAR_1_IN93 input. */
    kHSP__XBAR_2_InputLogicLow      = 0|0x40000U,  /**< LOGIC_LOW output assigned to HSP_XBAR_2_IN0 input. */
    kHSP__XBAR_2_InputLogicHigh     = 1|0x40000U,  /**< LOGIC_HIGH output assigned to HSP_XBAR_2_IN1 input. */
    kHSP__XBAR_2_InputMainEdma1TrigOut0 = 2|0x40000U, /**< MAIN_EDMA1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN2 input. */
    kHSP__XBAR_2_InputMainEdma1TrigOut1 = 3|0x40000U, /**< MAIN_EDMA1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN3 input. */
    kHSP__XBAR_2_InputMainEdma1TrigOut2 = 4|0x40000U, /**< MAIN_EDMA1_TRIG_OUT2 output assigned to HSP_XBAR_2_IN4 input. */
    kHSP__XBAR_2_InputMainEdma1TrigOut3 = 5|0x40000U, /**< MAIN_EDMA1_TRIG_OUT3 output assigned to HSP_XBAR_2_IN5 input. */
    kHSP__XBAR_2_InputMainEdma1Idle = 6|0x40000U,  /**< MAIN_EDMA1_IDLE output assigned to HSP_XBAR_2_IN6 input. */
    kHSP__XBAR_2_InputMainEdma0TrigOut0 = 7|0x40000U, /**< MAIN_EDMA0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN7 input. */
    kHSP__XBAR_2_InputMainEdma0TrigOut1 = 8|0x40000U, /**< MAIN_EDMA0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN8 input. */
    kHSP__XBAR_2_InputMainEdma0Idle = 9|0x40000U,  /**< MAIN_EDMA0_IDLE output assigned to HSP_XBAR_2_IN9 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse0 = 10|0x40000U, /**< HSP_ADC0_TCOMP_PULSE0 output assigned to HSP_XBAR_2_IN10 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse1 = 11|0x40000U, /**< HSP_ADC0_TCOMP_PULSE1 output assigned to HSP_XBAR_2_IN11 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse2 = 12|0x40000U, /**< HSP_ADC0_TCOMP_PULSE2 output assigned to HSP_XBAR_2_IN12 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse3 = 13|0x40000U, /**< HSP_ADC0_TCOMP_PULSE3 output assigned to HSP_XBAR_2_IN13 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse4 = 14|0x40000U, /**< HSP_ADC0_TCOMP_PULSE4 output assigned to HSP_XBAR_2_IN14 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse5 = 15|0x40000U, /**< HSP_ADC0_TCOMP_PULSE5 output assigned to HSP_XBAR_2_IN15 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse6 = 16|0x40000U, /**< HSP_ADC0_TCOMP_PULSE6 output assigned to HSP_XBAR_2_IN16 input. */
    kHSP__XBAR_2_InputHspAdc0TcompPulse7 = 17|0x40000U, /**< HSP_ADC0_TCOMP_PULSE7 output assigned to HSP_XBAR_2_IN17 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse0 = 18|0x40000U, /**< HSP_ADC1_TCOMP_PULSE0 output assigned to HSP_XBAR_2_IN18 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse1 = 19|0x40000U, /**< HSP_ADC1_TCOMP_PULSE1 output assigned to HSP_XBAR_2_IN19 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse2 = 20|0x40000U, /**< HSP_ADC1_TCOMP_PULSE2 output assigned to HSP_XBAR_2_IN20 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse3 = 21|0x40000U, /**< HSP_ADC1_TCOMP_PULSE3 output assigned to HSP_XBAR_2_IN21 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse4 = 22|0x40000U, /**< HSP_ADC1_TCOMP_PULSE4 output assigned to HSP_XBAR_2_IN22 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse5 = 23|0x40000U, /**< HSP_ADC1_TCOMP_PULSE5 output assigned to HSP_XBAR_2_IN23 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse6 = 24|0x40000U, /**< HSP_ADC1_TCOMP_PULSE6 output assigned to HSP_XBAR_2_IN24 input. */
    kHSP__XBAR_2_InputHspAdc1TcompPulse7 = 25|0x40000U, /**< HSP_ADC1_TCOMP_PULSE7 output assigned to HSP_XBAR_2_IN25 input. */
    kHSP__XBAR_2_InputHspLpit0TrigOut0 = 26|0x40000U, /**< HSP_LPIT0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN26 input. */
    kHSP__XBAR_2_InputHspLpit0TrigOut1 = 27|0x40000U, /**< HSP_LPIT0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN27 input. */
    kHSP__XBAR_2_InputHspLpit0TrigOut2 = 28|0x40000U, /**< HSP_LPIT0_TRIG_OUT2 output assigned to HSP_XBAR_2_IN28 input. */
    kHSP__XBAR_2_InputHspLpit0TrigOut3 = 29|0x40000U, /**< HSP_LPIT0_TRIG_OUT3 output assigned to HSP_XBAR_2_IN29 input. */
    kHSP__XBAR_2_InputHspLpit1TrigOut0 = 30|0x40000U, /**< HSP_LPIT1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN30 input. */
    kHSP__XBAR_2_InputHspLpit1TrigOut1 = 31|0x40000U, /**< HSP_LPIT1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN31 input. */
    kHSP__XBAR_2_InputHspLpit1TrigOut2 = 32|0x40000U, /**< HSP_LPIT1_TRIG_OUT2 output assigned to HSP_XBAR_2_IN32 input. */
    kHSP__XBAR_2_InputHspLpit1TrigOut3 = 33|0x40000U, /**< HSP_LPIT1_TRIG_OUT3 output assigned to HSP_XBAR_2_IN33 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm0Reload = 34|0x40000U, /**< HSP_FLEXPWM0_SM0_RELOAD output assigned to HSP_XBAR_2_IN34 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm0TrigOut0 = 35|0x40000U, /**< HSP_FLEXPWM0_SM0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN35 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm0TrigOut1 = 36|0x40000U, /**< HSP_FLEXPWM0_SM0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN36 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm1TrigOut0 = 37|0x40000U, /**< HSP_FLEXPWM0_SM1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN37 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm1TrigOut1 = 38|0x40000U, /**< HSP_FLEXPWM0_SM1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN38 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm2TrigOut0 = 39|0x40000U, /**< HSP_FLEXPWM0_SM2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN39 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm2TrigOut1 = 40|0x40000U, /**< HSP_FLEXPWM0_SM2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN40 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm3TrigOut0 = 41|0x40000U, /**< HSP_FLEXPWM0_SM3_TRIG_OUT0 output assigned to HSP_XBAR_2_IN41 input. */
    kHSP__XBAR_2_InputHspFlexpwm0Sm3TrigOut1 = 42|0x40000U, /**< HSP_FLEXPWM0_SM3_TRIG_OUT1 output assigned to HSP_XBAR_2_IN42 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm0Reload = 43|0x40000U, /**< HSP_FLEXPWM1_SM0_RELOAD output assigned to HSP_XBAR_2_IN43 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm0TrigOut0 = 44|0x40000U, /**< HSP_FLEXPWM1_SM0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN44 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm0TrigOut1 = 45|0x40000U, /**< HSP_FLEXPWM1_SM0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN45 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm1TrigOut0 = 46|0x40000U, /**< HSP_FLEXPWM1_SM1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN46 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm1TrigOut1 = 47|0x40000U, /**< HSP_FLEXPWM1_SM1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN47 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm2TrigOut0 = 48|0x40000U, /**< HSP_FLEXPWM1_SM2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN48 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm2TrigOut1 = 49|0x40000U, /**< HSP_FLEXPWM1_SM2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN49 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm3TrigOut0 = 50|0x40000U, /**< HSP_FLEXPWM1_SM3_TRIG_OUT0 output assigned to HSP_XBAR_2_IN50 input. */
    kHSP__XBAR_2_InputHspFlexpwm1Sm3TrigOut1 = 51|0x40000U, /**< HSP_FLEXPWM1_SM3_TRIG_OUT1 output assigned to HSP_XBAR_2_IN51 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm0Reload = 52|0x40000U, /**< HSP_FLEXPWM2_SM0_RELOAD output assigned to HSP_XBAR_2_IN52 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm0TrigOut0 = 53|0x40000U, /**< HSP_FLEXPWM2_SM0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN53 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm0TrigOut1 = 54|0x40000U, /**< HSP_FLEXPWM2_SM0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN54 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm1TrigOut0 = 55|0x40000U, /**< HSP_FLEXPWM2_SM1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN55 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm1TrigOut1 = 56|0x40000U, /**< HSP_FLEXPWM2_SM1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN56 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm2TrigOut0 = 57|0x40000U, /**< HSP_FLEXPWM2_SM2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN57 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm2TrigOut1 = 58|0x40000U, /**< HSP_FLEXPWM2_SM2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN58 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm3TrigOut0 = 59|0x40000U, /**< HSP_FLEXPWM2_SM3_TRIG_OUT0 output assigned to HSP_XBAR_2_IN59 input. */
    kHSP__XBAR_2_InputHspFlexpwm2Sm3TrigOut1 = 60|0x40000U, /**< HSP_FLEXPWM2_SM3_TRIG_OUT1 output assigned to HSP_XBAR_2_IN60 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm0Reload = 61|0x40000U, /**< HSP_FLEXPWM3_SM0_RELOAD output assigned to HSP_XBAR_2_IN61 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm0TrigOut0 = 62|0x40000U, /**< HSP_FLEXPWM3_SM0_TRIG_OUT0 output assigned to HSP_XBAR_2_IN62 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm0TrigOut1 = 63|0x40000U, /**< HSP_FLEXPWM3_SM0_TRIG_OUT1 output assigned to HSP_XBAR_2_IN63 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm1TrigOut0 = 64|0x40000U, /**< HSP_FLEXPWM3_SM1_TRIG_OUT0 output assigned to HSP_XBAR_2_IN64 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm1TrigOut1 = 65|0x40000U, /**< HSP_FLEXPWM3_SM1_TRIG_OUT1 output assigned to HSP_XBAR_2_IN65 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm2TrigOut0 = 66|0x40000U, /**< HSP_FLEXPWM3_SM2_TRIG_OUT0 output assigned to HSP_XBAR_2_IN66 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm2TrigOut1 = 67|0x40000U, /**< HSP_FLEXPWM3_SM2_TRIG_OUT1 output assigned to HSP_XBAR_2_IN67 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm3TrigOut0 = 68|0x40000U, /**< HSP_FLEXPWM3_SM3_TRIG_OUT0 output assigned to HSP_XBAR_2_IN68 input. */
    kHSP__XBAR_2_InputHspFlexpwm3Sm3TrigOut1 = 69|0x40000U, /**< HSP_FLEXPWM3_SM3_TRIG_OUT1 output assigned to HSP_XBAR_2_IN69 input. */
    kHSP__XBAR_2_InputHspQuadtpm0CntTrigOut0 = 70|0x40000U, /**< HSP_QUADTPM0_CNT_TRIG_OUT0 output assigned to HSP_XBAR_2_IN70 input. */
    kHSP__XBAR_2_InputHspQuadtpm0CntTrigOut1 = 71|0x40000U, /**< HSP_QUADTPM0_CNT_TRIG_OUT1 output assigned to HSP_XBAR_2_IN71 input. */
    kHSP__XBAR_2_InputHspQuadtpm0CntTrigOut2 = 72|0x40000U, /**< HSP_QUADTPM0_CNT_TRIG_OUT2 output assigned to HSP_XBAR_2_IN72 input. */
    kHSP__XBAR_2_InputHspQuadtpm0CntTrigOut3 = 73|0x40000U, /**< HSP_QUADTPM0_CNT_TRIG_OUT3 output assigned to HSP_XBAR_2_IN73 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut0 = 74|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT0 output assigned to HSP_XBAR_2_IN74 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut1 = 75|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT1 output assigned to HSP_XBAR_2_IN75 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut2 = 76|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT2 output assigned to HSP_XBAR_2_IN76 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut3 = 77|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT3 output assigned to HSP_XBAR_2_IN77 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut4 = 78|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT4 output assigned to HSP_XBAR_2_IN78 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut5 = 79|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT5 output assigned to HSP_XBAR_2_IN79 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut6 = 80|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT6 output assigned to HSP_XBAR_2_IN80 input. */
    kHSP__XBAR_2_InputHspQuadtpm0ChTrigOut7 = 81|0x40000U, /**< HSP_QUADTPM0_CH_TRIG_OUT7 output assigned to HSP_XBAR_2_IN81 input. */
    kHSP__XBAR_2_InputRESERVED82    = 82|0x40000U, /**< HSP_XBAR_2_IN82 input is reserved. */
    kHSP__XBAR_2_InputRESERVED83    = 83|0x40000U, /**< HSP_XBAR_2_IN83 input is reserved. */
    kHSP__XBAR_2_InputRESERVED84    = 84|0x40000U, /**< HSP_XBAR_2_IN84 input is reserved. */
    kHSP__XBAR_2_InputRESERVED85    = 85|0x40000U, /**< HSP_XBAR_2_IN85 input is reserved. */
    kHSP__XBAR_2_InputRESERVED86    = 86|0x40000U, /**< HSP_XBAR_2_IN86 input is reserved. */
    kHSP__XBAR_2_InputRESERVED87    = 87|0x40000U, /**< HSP_XBAR_2_IN87 input is reserved. */
    kHSP__XBAR_2_InputRESERVED88    = 88|0x40000U, /**< HSP_XBAR_2_IN88 input is reserved. */
    kHSP__XBAR_2_InputRESERVED89    = 89|0x40000U, /**< HSP_XBAR_2_IN89 input is reserved. */
    kHSP__XBAR_2_InputRESERVED90    = 90|0x40000U, /**< HSP_XBAR_2_IN90 input is reserved. */
    kHSP__XBAR_2_InputRESERVED91    = 91|0x40000U, /**< HSP_XBAR_2_IN91 input is reserved. */
    kHSP__XBAR_2_InputRESERVED92    = 92|0x40000U, /**< HSP_XBAR_2_IN92 input is reserved. */
    kHSP__XBAR_2_InputRESERVED93    = 93|0x40000U, /**< HSP_XBAR_2_IN93 input is reserved. */
    kHSP__XBAR_2_InputRESERVED94    = 94|0x40000U, /**< HSP_XBAR_2_IN94 input is reserved. */
    kHSP__XBAR_2_InputRESERVED95    = 95|0x40000U, /**< HSP_XBAR_2_IN95 input is reserved. */
    kHSP__XBAR_2_InputRESERVED96    = 96|0x40000U, /**< HSP_XBAR_2_IN96 input is reserved. */
    kHSP__XBAR_2_InputRESERVED97    = 97|0x40000U, /**< HSP_XBAR_2_IN97 input is reserved. */
    kHSP__XBAR_2_InputRESERVED98    = 98|0x40000U, /**< HSP_XBAR_2_IN98 input is reserved. */
