zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* CMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE                        (0x560D0000u)
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE_NS                     (0x460D0000u)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0                             ((CMP_Type *)WAKE__ACMP_0_BASE)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0_NS                          ((CMP_Type *)WAKE__ACMP_0_BASE_NS)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE                        (0x560E0000u)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE_NS                     (0x460E0000u)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1                             ((CMP_Type *)WAKE__ACMP_1_BASE)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1_NS                          ((CMP_Type *)WAKE__ACMP_1_BASE_NS)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE                        (0x560F0000u)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE_NS                     (0x460F0000u)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2                             ((CMP_Type *)WAKE__ACMP_2_BASE)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2_NS                          ((CMP_Type *)WAKE__ACMP_2_BASE_NS)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE                        (0x56100000u)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE_NS                     (0x46100000u)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3                             ((CMP_Type *)WAKE__ACMP_3_BASE)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3_NS                          ((CMP_Type *)WAKE__ACMP_3_BASE_NS)
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS                           { WAKE__ACMP_0_BASE, WAKE__ACMP_1_BASE, WAKE__ACMP_2_BASE, WAKE__ACMP_3_BASE }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS                            { WAKE__ACMP_0, WAKE__ACMP_1, WAKE__ACMP_2, WAKE__ACMP_3 }
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS_NS                        { WAKE__ACMP_0_BASE_NS, WAKE__ACMP_1_BASE_NS, WAKE__ACMP_2_BASE_NS, WAKE__ACMP_3_BASE_NS }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS_NS                         { WAKE__ACMP_0_NS, WAKE__ACMP_1_NS, WAKE__ACMP_2_NS, WAKE__ACMP_3_NS }
#else
  /** Peripheral WAKE__ACMP_0 base address */
  #define WAKE__ACMP_0_BASE                        (0x460D0000u)
  /** Peripheral WAKE__ACMP_0 base pointer */
  #define WAKE__ACMP_0                             ((CMP_Type *)WAKE__ACMP_0_BASE)
  /** Peripheral WAKE__ACMP_1 base address */
  #define WAKE__ACMP_1_BASE                        (0x460E0000u)
  /** Peripheral WAKE__ACMP_1 base pointer */
  #define WAKE__ACMP_1                             ((CMP_Type *)WAKE__ACMP_1_BASE)
  /** Peripheral WAKE__ACMP_2 base address */
  #define WAKE__ACMP_2_BASE                        (0x460F0000u)
  /** Peripheral WAKE__ACMP_2 base pointer */
  #define WAKE__ACMP_2                             ((CMP_Type *)WAKE__ACMP_2_BASE)
  /** Peripheral WAKE__ACMP_3 base address */
  #define WAKE__ACMP_3_BASE                        (0x46100000u)
  /** Peripheral WAKE__ACMP_3 base pointer */
  #define WAKE__ACMP_3                             ((CMP_Type *)WAKE__ACMP_3_BASE)
  /** Array initializer of CMP peripheral base addresses */
  #define CMP_BASE_ADDRS                           { WAKE__ACMP_0_BASE, WAKE__ACMP_1_BASE, WAKE__ACMP_2_BASE, WAKE__ACMP_3_BASE }
  /** Array initializer of CMP peripheral base pointers */
  #define CMP_BASE_PTRS                            { WAKE__ACMP_0, WAKE__ACMP_1, WAKE__ACMP_2, WAKE__ACMP_3 }
#endif
/** Interrupt vectors for the CMP peripheral type */
#define CMP_IRQS                                 { WAKE_ACMP0_IRQn, WAKE_ACMP1_IRQn, WAKE_ACMP2_IRQn, WAKE_ACMP3_IRQn }

/* CRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE                            (0x52980000u)
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE_NS                         (0x42980000u)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC                                 ((CRC_Type *)HSP__CRC_BASE)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC_NS                              ((CRC_Type *)HSP__CRC_BASE_NS)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { HSP__CRC_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { HSP__CRC }
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS_NS                        { HSP__CRC_BASE_NS }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS_NS                         { HSP__CRC_NS }
#else
  /** Peripheral HSP__CRC base address */
  #define HSP__CRC_BASE                            (0x42980000u)
  /** Peripheral HSP__CRC base pointer */
  #define HSP__CRC                                 ((CRC_Type *)HSP__CRC_BASE)
  /** Array initializer of CRC peripheral base addresses */
  #define CRC_BASE_ADDRS                           { HSP__CRC_BASE }
  /** Array initializer of CRC peripheral base pointers */
  #define CRC_BASE_PTRS                            { HSP__CRC }
#endif

/* DCIF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MEDIA__DCIF base address */
  #define MEDIA__DCIF_BASE                         (0x5C200000u)
  /** Peripheral MEDIA__DCIF base address */
  #define MEDIA__DCIF_BASE_NS                      (0x4C200000u)
  /** Peripheral MEDIA__DCIF base pointer */
  #define MEDIA__DCIF                              ((DCIF_Type *)MEDIA__DCIF_BASE)
  /** Peripheral MEDIA__DCIF base pointer */
  #define MEDIA__DCIF_NS                           ((DCIF_Type *)MEDIA__DCIF_BASE_NS)
  /** Array initializer of DCIF peripheral base addresses */
  #define DCIF_BASE_ADDRS                          { MEDIA__DCIF_BASE }
  /** Array initializer of DCIF peripheral base pointers */
  #define DCIF_BASE_PTRS                           { MEDIA__DCIF }
  /** Array initializer of DCIF peripheral base addresses */
  #define DCIF_BASE_ADDRS_NS                       { MEDIA__DCIF_BASE_NS }
  /** Array initializer of DCIF peripheral base pointers */
  #define DCIF_BASE_PTRS_NS                        { MEDIA__DCIF_NS }
#else
  /** Peripheral MEDIA__DCIF base address */
  #define MEDIA__DCIF_BASE                         (0x4C200000u)
  /** Peripheral MEDIA__DCIF base pointer */
  #define MEDIA__DCIF                              ((DCIF_Type *)MEDIA__DCIF_BASE)
  /** Array initializer of DCIF peripheral base addresses */
  #define DCIF_BASE_ADDRS                          { MEDIA__DCIF_BASE }
  /** Array initializer of DCIF peripheral base pointers */
  #define DCIF_BASE_PTRS                           { MEDIA__DCIF }
#endif
/** Interrupt vectors for the DCIF peripheral type */
#define DCIF_IRQS                                { MEDIA_DCIF_CH0_IRQn, MEDIA_DCIF_CH1_IRQn, MEDIA_DCIF_CH2_IRQn, MEDIA_DCIF_CH3_IRQn, MEDIA_DCIF_CH4_IRQn, MEDIA_DCIF_CH5_IRQn, MEDIA_DCIF_CH6_IRQn, MEDIA_DCIF_CH7_IRQn, MEDIA_DCIF_CH8_IRQn }

/* DEBUGMAILBOX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__DBGMB base address */
  #define WAKE__DBGMB_BASE                         (0x51E00000u)
  /** Peripheral WAKE__DBGMB base address */
  #define WAKE__DBGMB_BASE_NS                      (0x41E00000u)
  /** Peripheral WAKE__DBGMB base pointer */
  #define WAKE__DBGMB                              ((DEBUGMAILBOX_Type *)WAKE__DBGMB_BASE)
  /** Peripheral WAKE__DBGMB base pointer */
  #define WAKE__DBGMB_NS                           ((DEBUGMAILBOX_Type *)WAKE__DBGMB_BASE_NS)
  /** Array initializer of DEBUGMAILBOX peripheral base addresses */
  #define DEBUGMAILBOX_BASE_ADDRS                  { WAKE__DBGMB_BASE }
  /** Array initializer of DEBUGMAILBOX peripheral base pointers */
  #define DEBUGMAILBOX_BASE_PTRS                   { WAKE__DBGMB }
  /** Array initializer of DEBUGMAILBOX peripheral base addresses */
  #define DEBUGMAILBOX_BASE_ADDRS_NS               { WAKE__DBGMB_BASE_NS }
  /** Array initializer of DEBUGMAILBOX peripheral base pointers */
  #define DEBUGMAILBOX_BASE_PTRS_NS                { WAKE__DBGMB_NS }
#else
  /** Peripheral WAKE__DBGMB base address */
  #define WAKE__DBGMB_BASE                         (0x41E00000u)
  /** Peripheral WAKE__DBGMB base pointer */
  #define WAKE__DBGMB                              ((DEBUGMAILBOX_Type *)WAKE__DBGMB_BASE)
  /** Array initializer of DEBUGMAILBOX peripheral base addresses */
  #define DEBUGMAILBOX_BASE_ADDRS                  { WAKE__DBGMB_BASE }
  /** Array initializer of DEBUGMAILBOX peripheral base pointers */
  #define DEBUGMAILBOX_BASE_PTRS                   { WAKE__DBGMB }
#endif

/* DIGTMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VBAT__TDET base address */
  #define VBAT__TDET_BASE                          (0x56320000u)
  /** Peripheral VBAT__TDET base address */
  #define VBAT__TDET_BASE_NS                       (0x46320000u)
  /** Peripheral VBAT__TDET base pointer */
  #define VBAT__TDET                               ((DIGTMP_Type *)VBAT__TDET_BASE)
  /** Peripheral VBAT__TDET base pointer */
  #define VBAT__TDET_NS                            ((DIGTMP_Type *)VBAT__TDET_BASE_NS)
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS                        { VBAT__TDET_BASE }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS                         { VBAT__TDET }
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS_NS                     { VBAT__TDET_BASE_NS }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS_NS                      { VBAT__TDET_NS }
#else
  /** Peripheral VBAT__TDET base address */
  #define VBAT__TDET_BASE                          (0x46320000u)
  /** Peripheral VBAT__TDET base pointer */
  #define VBAT__TDET                               ((DIGTMP_Type *)VBAT__TDET_BASE)
  /** Array initializer of DIGTMP peripheral base addresses */
  #define DIGTMP_BASE_ADDRS                        { VBAT__TDET_BASE }
  /** Array initializer of DIGTMP peripheral base pointers */
  #define DIGTMP_BASE_PTRS                         { VBAT__TDET }
#endif

/* DMA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__EDMA3 base address */
  #define AUDIO__EDMA3_BASE                        (0x58170000u)
  /** Peripheral AUDIO__EDMA3 base address */
  #define AUDIO__EDMA3_BASE_NS                     (0x48170000u)
  /** Peripheral AUDIO__EDMA3 base pointer */
  #define AUDIO__EDMA3                             ((DMA_Type *)AUDIO__EDMA3_BASE)
  /** Peripheral AUDIO__EDMA3 base pointer */
  #define AUDIO__EDMA3_NS                          ((DMA_Type *)AUDIO__EDMA3_BASE_NS)
  /** Peripheral MAIN__EDMA3 base address */
  #define MAIN__EDMA3_BASE                         (0x500E0000u)
  /** Peripheral MAIN__EDMA3 base address */
  #define MAIN__EDMA3_BASE_NS                      (0x400E0000u)
  /** Peripheral MAIN__EDMA3 base pointer */
  #define MAIN__EDMA3                              ((DMA_Type *)MAIN__EDMA3_BASE)
  /** Peripheral MAIN__EDMA3 base pointer */
  #define MAIN__EDMA3_NS                           ((DMA_Type *)MAIN__EDMA3_BASE_NS)
  /** Peripheral WAKE__EDMA3 base address */
  #define WAKE__EDMA3_BASE                         (0x56270000u)
  /** Peripheral WAKE__EDMA3 base address */
  #define WAKE__EDMA3_BASE_NS                      (0x46270000u)
  /** Peripheral WAKE__EDMA3 base pointer */
  #define WAKE__EDMA3                              ((DMA_Type *)WAKE__EDMA3_BASE)
  /** Peripheral WAKE__EDMA3 base pointer */
  #define WAKE__EDMA3_NS                           ((DMA_Type *)WAKE__EDMA3_BASE_NS)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { AUDIO__EDMA3_BASE, MAIN__EDMA3_BASE, WAKE__EDMA3_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { AUDIO__EDMA3, MAIN__EDMA3, WAKE__EDMA3 }
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS_NS                        { AUDIO__EDMA3_BASE_NS, MAIN__EDMA3_BASE_NS, WAKE__EDMA3_BASE_NS }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS_NS                         { AUDIO__EDMA3_NS, MAIN__EDMA3_NS, WAKE__EDMA3_NS }
#else
  /** Peripheral AUDIO__EDMA3 base address */
  #define AUDIO__EDMA3_BASE                        (0x48170000u)
  /** Peripheral AUDIO__EDMA3 base pointer */
  #define AUDIO__EDMA3                             ((DMA_Type *)AUDIO__EDMA3_BASE)
  /** Peripheral MAIN__EDMA3 base address */
  #define MAIN__EDMA3_BASE                         (0x400E0000u)
  /** Peripheral MAIN__EDMA3 base pointer */
  #define MAIN__EDMA3                              ((DMA_Type *)MAIN__EDMA3_BASE)
  /** Peripheral WAKE__EDMA3 base address */
  #define WAKE__EDMA3_BASE                         (0x46270000u)
  /** Peripheral WAKE__EDMA3 base pointer */
  #define WAKE__EDMA3                              ((DMA_Type *)WAKE__EDMA3_BASE)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { AUDIO__EDMA3_BASE, MAIN__EDMA3_BASE, WAKE__EDMA3_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { AUDIO__EDMA3, MAIN__EDMA3, WAKE__EDMA3 }
#endif
/** Interrupt vectors for the DMA peripheral type */
#define DMA_IRQS                                 { { AUDIO_EDMA3_CH0_IRQn, AUDIO_EDMA3_CH1_IRQn, AUDIO_EDMA3_CH2_IRQn, AUDIO_EDMA3_CH3_IRQn, AUDIO_EDMA3_CH4_IRQn, AUDIO_EDMA3_CH5_IRQn, AUDIO_EDMA3_CH6_IRQn, AUDIO_EDMA3_CH7_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn }, \
                                                   { MAIN_EDMA3_CH0_IRQn, MAIN_EDMA3_CH1_IRQn, MAIN_EDMA3_CH2_IRQn, MAIN_EDMA3_CH3_IRQn, MAIN_EDMA3_CH4_IRQn, MAIN_EDMA3_CH5_IRQn, MAIN_EDMA3_CH6_IRQn, MAIN_EDMA3_CH7_IRQn, MAIN_EDMA3_CH8_IRQn, MAIN_EDMA3_CH9_IRQn, MAIN_EDMA3_CH10_IRQn, MAIN_EDMA3_CH11_IRQn, MAIN_EDMA3_CH12_IRQn, MAIN_EDMA3_CH13_IRQn, MAIN_EDMA3_CH14_IRQn, MAIN_EDMA3_CH15_IRQn, MAIN_EDMA3_CH16_IRQn, MAIN_EDMA3_CH17_IRQn, MAIN_EDMA3_CH18_IRQn, MAIN_EDMA3_CH19_IRQn, MAIN_EDMA3_CH20_IRQn, MAIN_EDMA3_CH21_IRQn, MAIN_EDMA3_CH22_IRQn, MAIN_EDMA3_CH23_IRQn, MAIN_EDMA3_CH24_IRQn, MAIN_EDMA3_CH25_IRQn, MAIN_EDMA3_CH26_IRQn, MAIN_EDMA3_CH27_IRQn, MAIN_EDMA3_CH28_IRQn, MAIN_EDMA3_CH29_IRQn, MAIN_EDMA3_CH30_IRQn, MAIN_EDMA3_CH31_IRQn }, \
                                                   { WAKE_EDMA3_CH0_IRQn, WAKE_EDMA3_CH1_IRQn, WAKE_EDMA3_CH2_IRQn, WAKE_EDMA3_CH3_IRQn, WAKE_EDMA3_CH4_IRQn, WAKE_EDMA3_CH5_IRQn, WAKE_EDMA3_CH6_IRQn, WAKE_EDMA3_CH7_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn } }

