zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* FREQME - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__FREQME base address */
  #define AUDIO__FREQME_BASE                       (0x58090000u)
  /** Peripheral AUDIO__FREQME base address */
  #define AUDIO__FREQME_BASE_NS                    (0x48090000u)
  /** Peripheral AUDIO__FREQME base pointer */
  #define AUDIO__FREQME                            ((FREQME_Type *)AUDIO__FREQME_BASE)
  /** Peripheral AUDIO__FREQME base pointer */
  #define AUDIO__FREQME_NS                         ((FREQME_Type *)AUDIO__FREQME_BASE_NS)
  /** Peripheral CMPT__FREQME base address */
  #define CMPT__FREQME_BASE                        (0x541D0000u)
  /** Peripheral CMPT__FREQME base address */
  #define CMPT__FREQME_BASE_NS                     (0x441D0000u)
  /** Peripheral CMPT__FREQME base pointer */
  #define CMPT__FREQME                             ((FREQME_Type *)CMPT__FREQME_BASE)
  /** Peripheral CMPT__FREQME base pointer */
  #define CMPT__FREQME_NS                          ((FREQME_Type *)CMPT__FREQME_BASE_NS)
  /** Peripheral COMM__FREQME base address */
  #define COMM__FREQME_BASE                        (0x5A120000u)
  /** Peripheral COMM__FREQME base address */
  #define COMM__FREQME_BASE_NS                     (0x4A120000u)
  /** Peripheral COMM__FREQME base pointer */
  #define COMM__FREQME                             ((FREQME_Type *)COMM__FREQME_BASE)
  /** Peripheral COMM__FREQME base pointer */
  #define COMM__FREQME_NS                          ((FREQME_Type *)COMM__FREQME_BASE_NS)
  /** Peripheral MAIN__FREQME base address */
  #define MAIN__FREQME_BASE                        (0x50410000u)
  /** Peripheral MAIN__FREQME base address */
  #define MAIN__FREQME_BASE_NS                     (0x40410000u)
  /** Peripheral MAIN__FREQME base pointer */
  #define MAIN__FREQME                             ((FREQME_Type *)MAIN__FREQME_BASE)
  /** Peripheral MAIN__FREQME base pointer */
  #define MAIN__FREQME_NS                          ((FREQME_Type *)MAIN__FREQME_BASE_NS)
  /** Peripheral MEDIA__FREQME base address */
  #define MEDIA__FREQME_BASE                       (0x5C100000u)
  /** Peripheral MEDIA__FREQME base address */
  #define MEDIA__FREQME_BASE_NS                    (0x4C100000u)
  /** Peripheral MEDIA__FREQME base pointer */
  #define MEDIA__FREQME                            ((FREQME_Type *)MEDIA__FREQME_BASE)
  /** Peripheral MEDIA__FREQME base pointer */
  #define MEDIA__FREQME_NS                         ((FREQME_Type *)MEDIA__FREQME_BASE_NS)
  /** Peripheral SYSCON__FREQME base address */
  #define SYSCON__FREQME_BASE                      (0x50590000u)
  /** Peripheral SYSCON__FREQME base address */
  #define SYSCON__FREQME_BASE_NS                   (0x40590000u)
  /** Peripheral SYSCON__FREQME base pointer */
  #define SYSCON__FREQME                           ((FREQME_Type *)SYSCON__FREQME_BASE)
  /** Peripheral SYSCON__FREQME base pointer */
  #define SYSCON__FREQME_NS                        ((FREQME_Type *)SYSCON__FREQME_BASE_NS)
  /** Peripheral WAKE__FREQME base address */
  #define WAKE__FREQME_BASE                        (0x56080000u)
  /** Peripheral WAKE__FREQME base address */
  #define WAKE__FREQME_BASE_NS                     (0x46080000u)
  /** Peripheral WAKE__FREQME base pointer */
  #define WAKE__FREQME                             ((FREQME_Type *)WAKE__FREQME_BASE)
  /** Peripheral WAKE__FREQME base pointer */
  #define WAKE__FREQME_NS                          ((FREQME_Type *)WAKE__FREQME_BASE_NS)
  /** Array initializer of FREQME peripheral base addresses */
  #define FREQME_BASE_ADDRS                        { AUDIO__FREQME_BASE, CMPT__FREQME_BASE, COMM__FREQME_BASE, MAIN__FREQME_BASE, MEDIA__FREQME_BASE, SYSCON__FREQME_BASE, WAKE__FREQME_BASE }
  /** Array initializer of FREQME peripheral base pointers */
  #define FREQME_BASE_PTRS                         { AUDIO__FREQME, CMPT__FREQME, COMM__FREQME, MAIN__FREQME, MEDIA__FREQME, SYSCON__FREQME, WAKE__FREQME }
  /** Array initializer of FREQME peripheral base addresses */
  #define FREQME_BASE_ADDRS_NS                     { AUDIO__FREQME_BASE_NS, CMPT__FREQME_BASE_NS, COMM__FREQME_BASE_NS, MAIN__FREQME_BASE_NS, MEDIA__FREQME_BASE_NS, SYSCON__FREQME_BASE_NS, WAKE__FREQME_BASE_NS }
  /** Array initializer of FREQME peripheral base pointers */
  #define FREQME_BASE_PTRS_NS                      { AUDIO__FREQME_NS, CMPT__FREQME_NS, COMM__FREQME_NS, MAIN__FREQME_NS, MEDIA__FREQME_NS, SYSCON__FREQME_NS, WAKE__FREQME_NS }
#else
  /** Peripheral AUDIO__FREQME base address */
  #define AUDIO__FREQME_BASE                       (0x48090000u)
  /** Peripheral AUDIO__FREQME base pointer */
  #define AUDIO__FREQME                            ((FREQME_Type *)AUDIO__FREQME_BASE)
  /** Peripheral CMPT__FREQME base address */
  #define CMPT__FREQME_BASE                        (0x441D0000u)
  /** Peripheral CMPT__FREQME base pointer */
  #define CMPT__FREQME                             ((FREQME_Type *)CMPT__FREQME_BASE)
  /** Peripheral COMM__FREQME base address */
  #define COMM__FREQME_BASE                        (0x4A120000u)
  /** Peripheral COMM__FREQME base pointer */
  #define COMM__FREQME                             ((FREQME_Type *)COMM__FREQME_BASE)
  /** Peripheral MAIN__FREQME base address */
  #define MAIN__FREQME_BASE                        (0x40410000u)
  /** Peripheral MAIN__FREQME base pointer */
  #define MAIN__FREQME                             ((FREQME_Type *)MAIN__FREQME_BASE)
  /** Peripheral MEDIA__FREQME base address */
  #define MEDIA__FREQME_BASE                       (0x4C100000u)
  /** Peripheral MEDIA__FREQME base pointer */
  #define MEDIA__FREQME                            ((FREQME_Type *)MEDIA__FREQME_BASE)
  /** Peripheral SYSCON__FREQME base address */
  #define SYSCON__FREQME_BASE                      (0x40590000u)
  /** Peripheral SYSCON__FREQME base pointer */
  #define SYSCON__FREQME                           ((FREQME_Type *)SYSCON__FREQME_BASE)
  /** Peripheral WAKE__FREQME base address */
  #define WAKE__FREQME_BASE                        (0x46080000u)
  /** Peripheral WAKE__FREQME base pointer */
  #define WAKE__FREQME                             ((FREQME_Type *)WAKE__FREQME_BASE)
  /** Array initializer of FREQME peripheral base addresses */
  #define FREQME_BASE_ADDRS                        { AUDIO__FREQME_BASE, CMPT__FREQME_BASE, COMM__FREQME_BASE, MAIN__FREQME_BASE, MEDIA__FREQME_BASE, SYSCON__FREQME_BASE, WAKE__FREQME_BASE }
  /** Array initializer of FREQME peripheral base pointers */
  #define FREQME_BASE_PTRS                         { AUDIO__FREQME, CMPT__FREQME, COMM__FREQME, MAIN__FREQME, MEDIA__FREQME, SYSCON__FREQME, WAKE__FREQME }
#endif
/** Interrupt vectors for the FREQME peripheral type */
#define FREQME_IRQS                              { AUDIO_FREQME_IRQn, CMPT_FREQME_IRQn, COMM_FREQME_IRQn, MAIN_FREQME_IRQn, MEDIA_FREQME_IRQn, SYSCON_FREQME_IRQn, WAKE_FREQME_IRQn }

/* FSB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__FSB base address */
  #define MAIN__FSB_BASE                           (0x50600000u)
  /** Peripheral MAIN__FSB base address */
  #define MAIN__FSB_BASE_NS                        (0x40600000u)
  /** Peripheral MAIN__FSB base pointer */
  #define MAIN__FSB                                ((FSB_Type *)MAIN__FSB_BASE)
  /** Peripheral MAIN__FSB base pointer */
  #define MAIN__FSB_NS                             ((FSB_Type *)MAIN__FSB_BASE_NS)
  /** Array initializer of FSB peripheral base addresses */
  #define FSB_BASE_ADDRS                           { MAIN__FSB_BASE }
  /** Array initializer of FSB peripheral base pointers */
  #define FSB_BASE_PTRS                            { MAIN__FSB }
  /** Array initializer of FSB peripheral base addresses */
  #define FSB_BASE_ADDRS_NS                        { MAIN__FSB_BASE_NS }
  /** Array initializer of FSB peripheral base pointers */
  #define FSB_BASE_PTRS_NS                         { MAIN__FSB_NS }
#else
  /** Peripheral MAIN__FSB base address */
  #define MAIN__FSB_BASE                           (0x40600000u)
  /** Peripheral MAIN__FSB base pointer */
  #define MAIN__FSB                                ((FSB_Type *)MAIN__FSB_BASE)
  /** Array initializer of FSB peripheral base addresses */
  #define FSB_BASE_ADDRS                           { MAIN__FSB_BASE }
  /** Array initializer of FSB peripheral base pointers */
  #define FSB_BASE_PTRS                            { MAIN__FSB }
#endif

