zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* LLC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMPT__LLC base address */
  #define CMPT__LLC_BASE                           (0x541A0000u)
  /** Peripheral CMPT__LLC base address */
  #define CMPT__LLC_BASE_NS                        (0x441A0000u)
  /** Peripheral CMPT__LLC base pointer */
  #define CMPT__LLC                                ((LLC_Type *)CMPT__LLC_BASE)
  /** Peripheral CMPT__LLC base pointer */
  #define CMPT__LLC_NS                             ((LLC_Type *)CMPT__LLC_BASE_NS)
  /** Array initializer of LLC peripheral base addresses */
  #define LLC_BASE_ADDRS                           { CMPT__LLC_BASE }
  /** Array initializer of LLC peripheral base pointers */
  #define LLC_BASE_PTRS                            { CMPT__LLC }
  /** Array initializer of LLC peripheral base addresses */
  #define LLC_BASE_ADDRS_NS                        { CMPT__LLC_BASE_NS }
  /** Array initializer of LLC peripheral base pointers */
  #define LLC_BASE_PTRS_NS                         { CMPT__LLC_NS }
#else
  /** Peripheral CMPT__LLC base address */
  #define CMPT__LLC_BASE                           (0x441A0000u)
  /** Peripheral CMPT__LLC base pointer */
  #define CMPT__LLC                                ((LLC_Type *)CMPT__LLC_BASE)
  /** Array initializer of LLC peripheral base addresses */
  #define LLC_BASE_ADDRS                           { CMPT__LLC_BASE }
  /** Array initializer of LLC peripheral base pointers */
  #define LLC_BASE_PTRS                            { CMPT__LLC }
#endif
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** LLC physical memory base address */
  #define LLC_PHYMEM_BASES                { { 0x78000000u, 0x98000000u } }
  /** LLC physical memory size */
  #define LLC_PHYMEM_SIZES                { { 0x8000000u, 0x8000000u } }
  /** LLC physical memory base address */
  #define LLC_PHYMEM_BASES_NS             { { 0x68000000u, 0x88000000u } }
  /** LLC physical memory size */
  #define LLC_PHYMEM_SIZES_NS             { { 0x8000000u, 0x8000000u } }
#else
  /** LLC physical memory base address */
  #define LLC_PHYMEM_BASES                { { 0x68000000u, 0x88000000u } }
  /** LLC physical memory size */
  #define LLC_PHYMEM_SIZES                { { 0x8000000u, 0x8000000u } }
#endif
/** Number of physical memory base-address aliases per LLC instance.
    Each LLC instance is reachable through a direct (bypass) alias and a
    cached alias, so the LLC_PHYMEM_BASES/SIZES tables carry two columns per
    instance. */
#define LLC_PHYMEM_BASE_ALIAS_COUNT     (2)


/* LPDAC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__DAC base address */
  #define HSP__DAC_BASE                            (0x52060000u)
  /** Peripheral HSP__DAC base address */
  #define HSP__DAC_BASE_NS                         (0x42060000u)
  /** Peripheral HSP__DAC base pointer */
  #define HSP__DAC                                 ((LPDAC_Type *)HSP__DAC_BASE)
  /** Peripheral HSP__DAC base pointer */
  #define HSP__DAC_NS                              ((LPDAC_Type *)HSP__DAC_BASE_NS)
  /** Array initializer of LPDAC peripheral base addresses */
  #define LPDAC_BASE_ADDRS                         { HSP__DAC_BASE }
  /** Array initializer of LPDAC peripheral base pointers */
  #define LPDAC_BASE_PTRS                          { HSP__DAC }
  /** Array initializer of LPDAC peripheral base addresses */
  #define LPDAC_BASE_ADDRS_NS                      { HSP__DAC_BASE_NS }
  /** Array initializer of LPDAC peripheral base pointers */
  #define LPDAC_BASE_PTRS_NS                       { HSP__DAC_NS }
#else
  /** Peripheral HSP__DAC base address */
  #define HSP__DAC_BASE                            (0x42060000u)
  /** Peripheral HSP__DAC base pointer */
  #define HSP__DAC                                 ((LPDAC_Type *)HSP__DAC_BASE)
  /** Array initializer of LPDAC peripheral base addresses */
  #define LPDAC_BASE_ADDRS                         { HSP__DAC_BASE }
  /** Array initializer of LPDAC peripheral base pointers */
  #define LPDAC_BASE_PTRS                          { HSP__DAC }
#endif
/** Interrupt vectors for the LPDAC peripheral type */
#define LPDAC_IRQS                               { HSP_DAC_IRQn }

/* LPI2C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__LPI2C_0 base address */
  #define HSP__LPI2C_0_BASE                        (0x52140000u)
  /** Peripheral HSP__LPI2C_0 base address */
  #define HSP__LPI2C_0_BASE_NS                     (0x42140000u)
  /** Peripheral HSP__LPI2C_0 base pointer */
  #define HSP__LPI2C_0                             ((LPI2C_Type *)HSP__LPI2C_0_BASE)
  /** Peripheral HSP__LPI2C_0 base pointer */
  #define HSP__LPI2C_0_NS                          ((LPI2C_Type *)HSP__LPI2C_0_BASE_NS)
  /** Peripheral HSP__LPI2C_1 base address */
  #define HSP__LPI2C_1_BASE                        (0x52910000u)
  /** Peripheral HSP__LPI2C_1 base address */
  #define HSP__LPI2C_1_BASE_NS                     (0x42910000u)
  /** Peripheral HSP__LPI2C_1 base pointer */
  #define HSP__LPI2C_1                             ((LPI2C_Type *)HSP__LPI2C_1_BASE)
  /** Peripheral HSP__LPI2C_1 base pointer */
  #define HSP__LPI2C_1_NS                          ((LPI2C_Type *)HSP__LPI2C_1_BASE_NS)
  /** Peripheral WAKE__LPI2C_0 base address */
  #define WAKE__LPI2C_0_BASE                       (0x561C0000u)
  /** Peripheral WAKE__LPI2C_0 base address */
  #define WAKE__LPI2C_0_BASE_NS                    (0x461C0000u)
  /** Peripheral WAKE__LPI2C_0 base pointer */
  #define WAKE__LPI2C_0                            ((LPI2C_Type *)WAKE__LPI2C_0_BASE)
  /** Peripheral WAKE__LPI2C_0 base pointer */
  #define WAKE__LPI2C_0_NS                         ((LPI2C_Type *)WAKE__LPI2C_0_BASE_NS)
  /** Peripheral WAKE__LPI2C_1 base address */
  #define WAKE__LPI2C_1_BASE                       (0x561D0000u)
  /** Peripheral WAKE__LPI2C_1 base address */
  #define WAKE__LPI2C_1_BASE_NS                    (0x461D0000u)
  /** Peripheral WAKE__LPI2C_1 base pointer */
  #define WAKE__LPI2C_1                            ((LPI2C_Type *)WAKE__LPI2C_1_BASE)
  /** Peripheral WAKE__LPI2C_1 base pointer */
  #define WAKE__LPI2C_1_NS                         ((LPI2C_Type *)WAKE__LPI2C_1_BASE_NS)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { HSP__LPI2C_0_BASE, HSP__LPI2C_1_BASE, WAKE__LPI2C_0_BASE, WAKE__LPI2C_1_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { HSP__LPI2C_0, HSP__LPI2C_1, WAKE__LPI2C_0, WAKE__LPI2C_1 }
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS_NS                      { HSP__LPI2C_0_BASE_NS, HSP__LPI2C_1_BASE_NS, WAKE__LPI2C_0_BASE_NS, WAKE__LPI2C_1_BASE_NS }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS_NS                       { HSP__LPI2C_0_NS, HSP__LPI2C_1_NS, WAKE__LPI2C_0_NS, WAKE__LPI2C_1_NS }
#else
  /** Peripheral HSP__LPI2C_0 base address */
  #define HSP__LPI2C_0_BASE                        (0x42140000u)
  /** Peripheral HSP__LPI2C_0 base pointer */
  #define HSP__LPI2C_0                             ((LPI2C_Type *)HSP__LPI2C_0_BASE)
  /** Peripheral HSP__LPI2C_1 base address */
  #define HSP__LPI2C_1_BASE                        (0x42910000u)
  /** Peripheral HSP__LPI2C_1 base pointer */
  #define HSP__LPI2C_1                             ((LPI2C_Type *)HSP__LPI2C_1_BASE)
  /** Peripheral WAKE__LPI2C_0 base address */
  #define WAKE__LPI2C_0_BASE                       (0x461C0000u)
  /** Peripheral WAKE__LPI2C_0 base pointer */
  #define WAKE__LPI2C_0                            ((LPI2C_Type *)WAKE__LPI2C_0_BASE)
  /** Peripheral WAKE__LPI2C_1 base address */
  #define WAKE__LPI2C_1_BASE                       (0x461D0000u)
  /** Peripheral WAKE__LPI2C_1 base pointer */
  #define WAKE__LPI2C_1                            ((LPI2C_Type *)WAKE__LPI2C_1_BASE)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { HSP__LPI2C_0_BASE, HSP__LPI2C_1_BASE, WAKE__LPI2C_0_BASE, WAKE__LPI2C_1_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { HSP__LPI2C_0, HSP__LPI2C_1, WAKE__LPI2C_0, WAKE__LPI2C_1 }
#endif
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                               { HSP_LPI2C0_IRQn, HSP_LPI2C1_IRQn, WAKE_LPI2C0_IRQn, WAKE_LPI2C1_IRQn }

/* LPIT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__LPIT_0 base address */
  #define HSP__LPIT_0_BASE                         (0x52070000u)
  /** Peripheral HSP__LPIT_0 base address */
  #define HSP__LPIT_0_BASE_NS                      (0x42070000u)
  /** Peripheral HSP__LPIT_0 base pointer */
  #define HSP__LPIT_0                              ((LPIT_Type *)HSP__LPIT_0_BASE)
  /** Peripheral HSP__LPIT_0 base pointer */
  #define HSP__LPIT_0_NS                           ((LPIT_Type *)HSP__LPIT_0_BASE_NS)
  /** Peripheral HSP__LPIT_1 base address */
  #define HSP__LPIT_1_BASE                         (0x52860000u)
  /** Peripheral HSP__LPIT_1 base address */
  #define HSP__LPIT_1_BASE_NS                      (0x42860000u)
  /** Peripheral HSP__LPIT_1 base pointer */
  #define HSP__LPIT_1                              ((LPIT_Type *)HSP__LPIT_1_BASE)
  /** Peripheral HSP__LPIT_1 base pointer */
  #define HSP__LPIT_1_NS                           ((LPIT_Type *)HSP__LPIT_1_BASE_NS)
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS                          { HSP__LPIT_0_BASE, HSP__LPIT_1_BASE }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS                           { HSP__LPIT_0, HSP__LPIT_1 }
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS_NS                       { HSP__LPIT_0_BASE_NS, HSP__LPIT_1_BASE_NS }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS_NS                        { HSP__LPIT_0_NS, HSP__LPIT_1_NS }
#else
  /** Peripheral HSP__LPIT_0 base address */
  #define HSP__LPIT_0_BASE                         (0x42070000u)
  /** Peripheral HSP__LPIT_0 base pointer */
  #define HSP__LPIT_0                              ((LPIT_Type *)HSP__LPIT_0_BASE)
  /** Peripheral HSP__LPIT_1 base address */
  #define HSP__LPIT_1_BASE                         (0x42860000u)
  /** Peripheral HSP__LPIT_1 base pointer */
  #define HSP__LPIT_1                              ((LPIT_Type *)HSP__LPIT_1_BASE)
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS                          { HSP__LPIT_0_BASE, HSP__LPIT_1_BASE }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS                           { HSP__LPIT_0, HSP__LPIT_1 }
#endif
/** Interrupt vectors for the LPIT peripheral type */
#define LPIT_IRQS                                { { HSP_LPIT0_IRQn, HSP_LPIT0_IRQn, HSP_LPIT0_IRQn, HSP_LPIT0_IRQn }, { HSP_LPIT1_IRQn, HSP_LPIT1_IRQn, HSP_LPIT1_IRQn, HSP_LPIT1_IRQn } }

/* LPSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__LPSPI_0 base address */
  #define HSP__LPSPI_0_BASE                        (0x52160000u)
  /** Peripheral HSP__LPSPI_0 base address */
  #define HSP__LPSPI_0_BASE_NS                     (0x42160000u)
  /** Peripheral HSP__LPSPI_0 base pointer */
  #define HSP__LPSPI_0                             ((LPSPI_Type *)HSP__LPSPI_0_BASE)
  /** Peripheral HSP__LPSPI_0 base pointer */
  #define HSP__LPSPI_0_NS                          ((LPSPI_Type *)HSP__LPSPI_0_BASE_NS)
  /** Peripheral HSP__LPSPI_1 base address */
  #define HSP__LPSPI_1_BASE                        (0x52170000u)
  /** Peripheral HSP__LPSPI_1 base address */
  #define HSP__LPSPI_1_BASE_NS                     (0x42170000u)
  /** Peripheral HSP__LPSPI_1 base pointer */
  #define HSP__LPSPI_1                             ((LPSPI_Type *)HSP__LPSPI_1_BASE)
  /** Peripheral HSP__LPSPI_1 base pointer */
  #define HSP__LPSPI_1_NS                          ((LPSPI_Type *)HSP__LPSPI_1_BASE_NS)
  /** Peripheral HSP__LPSPI_2 base address */
  #define HSP__LPSPI_2_BASE                        (0x52180000u)
  /** Peripheral HSP__LPSPI_2 base address */
  #define HSP__LPSPI_2_BASE_NS                     (0x42180000u)
  /** Peripheral HSP__LPSPI_2 base pointer */
  #define HSP__LPSPI_2                             ((LPSPI_Type *)HSP__LPSPI_2_BASE)
  /** Peripheral HSP__LPSPI_2 base pointer */
  #define HSP__LPSPI_2_NS                          ((LPSPI_Type *)HSP__LPSPI_2_BASE_NS)
  /** Peripheral HSP__LPSPI_3 base address */
  #define HSP__LPSPI_3_BASE                        (0x52930000u)
  /** Peripheral HSP__LPSPI_3 base address */
  #define HSP__LPSPI_3_BASE_NS                     (0x42930000u)
  /** Peripheral HSP__LPSPI_3 base pointer */
  #define HSP__LPSPI_3                             ((LPSPI_Type *)HSP__LPSPI_3_BASE)
  /** Peripheral HSP__LPSPI_3 base pointer */
  #define HSP__LPSPI_3_NS                          ((LPSPI_Type *)HSP__LPSPI_3_BASE_NS)
  /** Peripheral HSP__LPSPI_4 base address */
  #define HSP__LPSPI_4_BASE                        (0x52940000u)
  /** Peripheral HSP__LPSPI_4 base address */
  #define HSP__LPSPI_4_BASE_NS                     (0x42940000u)
  /** Peripheral HSP__LPSPI_4 base pointer */
  #define HSP__LPSPI_4                             ((LPSPI_Type *)HSP__LPSPI_4_BASE)
  /** Peripheral HSP__LPSPI_4 base pointer */
  #define HSP__LPSPI_4_NS                          ((LPSPI_Type *)HSP__LPSPI_4_BASE_NS)
  /** Peripheral WAKE__LPSPI base address */
  #define WAKE__LPSPI_BASE                         (0x561E0000u)
  /** Peripheral WAKE__LPSPI base address */
  #define WAKE__LPSPI_BASE_NS                      (0x461E0000u)
  /** Peripheral WAKE__LPSPI base pointer */
  #define WAKE__LPSPI                              ((LPSPI_Type *)WAKE__LPSPI_BASE)
  /** Peripheral WAKE__LPSPI base pointer */
  #define WAKE__LPSPI_NS                           ((LPSPI_Type *)WAKE__LPSPI_BASE_NS)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { HSP__LPSPI_0_BASE, HSP__LPSPI_1_BASE, HSP__LPSPI_2_BASE, HSP__LPSPI_3_BASE, HSP__LPSPI_4_BASE, WAKE__LPSPI_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { HSP__LPSPI_0, HSP__LPSPI_1, HSP__LPSPI_2, HSP__LPSPI_3, HSP__LPSPI_4, WAKE__LPSPI }
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS_NS                      { HSP__LPSPI_0_BASE_NS, HSP__LPSPI_1_BASE_NS, HSP__LPSPI_2_BASE_NS, HSP__LPSPI_3_BASE_NS, HSP__LPSPI_4_BASE_NS, WAKE__LPSPI_BASE_NS }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS_NS                       { HSP__LPSPI_0_NS, HSP__LPSPI_1_NS, HSP__LPSPI_2_NS, HSP__LPSPI_3_NS, HSP__LPSPI_4_NS, WAKE__LPSPI_NS }
#else
  /** Peripheral HSP__LPSPI_0 base address */
  #define HSP__LPSPI_0_BASE                        (0x42160000u)
  /** Peripheral HSP__LPSPI_0 base pointer */
  #define HSP__LPSPI_0                             ((LPSPI_Type *)HSP__LPSPI_0_BASE)
  /** Peripheral HSP__LPSPI_1 base address */
  #define HSP__LPSPI_1_BASE                        (0x42170000u)
  /** Peripheral HSP__LPSPI_1 base pointer */
  #define HSP__LPSPI_1                             ((LPSPI_Type *)HSP__LPSPI_1_BASE)
  /** Peripheral HSP__LPSPI_2 base address */
  #define HSP__LPSPI_2_BASE                        (0x42180000u)
  /** Peripheral HSP__LPSPI_2 base pointer */
  #define HSP__LPSPI_2                             ((LPSPI_Type *)HSP__LPSPI_2_BASE)
  /** Peripheral HSP__LPSPI_3 base address */
  #define HSP__LPSPI_3_BASE                        (0x42930000u)
  /** Peripheral HSP__LPSPI_3 base pointer */
  #define HSP__LPSPI_3                             ((LPSPI_Type *)HSP__LPSPI_3_BASE)
  /** Peripheral HSP__LPSPI_4 base address */
  #define HSP__LPSPI_4_BASE                        (0x42940000u)
  /** Peripheral HSP__LPSPI_4 base pointer */
  #define HSP__LPSPI_4                             ((LPSPI_Type *)HSP__LPSPI_4_BASE)
  /** Peripheral WAKE__LPSPI base address */
  #define WAKE__LPSPI_BASE                         (0x461E0000u)
  /** Peripheral WAKE__LPSPI base pointer */
  #define WAKE__LPSPI                              ((LPSPI_Type *)WAKE__LPSPI_BASE)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { HSP__LPSPI_0_BASE, HSP__LPSPI_1_BASE, HSP__LPSPI_2_BASE, HSP__LPSPI_3_BASE, HSP__LPSPI_4_BASE, WAKE__LPSPI_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { HSP__LPSPI_0, HSP__LPSPI_1, HSP__LPSPI_2, HSP__LPSPI_3, HSP__LPSPI_4, WAKE__LPSPI }
#endif
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { HSP_LPSPI0_IRQn, HSP_LPSPI1_IRQn, HSP_LPSPI2_IRQn, HSP_LPSPI3_IRQn, HSP_LPSPI4_IRQn, WAKE_LPSPI_IRQn }

/* LPTMR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VBAT__LPTMR base address */
  #define VBAT__LPTMR_BASE                         (0x56330000u)
  /** Peripheral VBAT__LPTMR base address */
  #define VBAT__LPTMR_BASE_NS                      (0x46330000u)
  /** Peripheral VBAT__LPTMR base pointer */
  #define VBAT__LPTMR                              ((LPTMR_Type *)VBAT__LPTMR_BASE)
  /** Peripheral VBAT__LPTMR base pointer */
  #define VBAT__LPTMR_NS                           ((LPTMR_Type *)VBAT__LPTMR_BASE_NS)
  /** Peripheral WAKE__LPTMR_0 base address */
  #define WAKE__LPTMR_0_BASE                       (0x56130000u)
  /** Peripheral WAKE__LPTMR_0 base address */
  #define WAKE__LPTMR_0_BASE_NS                    (0x46130000u)
  /** Peripheral WAKE__LPTMR_0 base pointer */
  #define WAKE__LPTMR_0                            ((LPTMR_Type *)WAKE__LPTMR_0_BASE)
  /** Peripheral WAKE__LPTMR_0 base pointer */
  #define WAKE__LPTMR_0_NS                         ((LPTMR_Type *)WAKE__LPTMR_0_BASE_NS)
  /** Peripheral WAKE__LPTMR_1 base address */
  #define WAKE__LPTMR_1_BASE                       (0x56140000u)
  /** Peripheral WAKE__LPTMR_1 base address */
  #define WAKE__LPTMR_1_BASE_NS                    (0x46140000u)
  /** Peripheral WAKE__LPTMR_1 base pointer */
  #define WAKE__LPTMR_1                            ((LPTMR_Type *)WAKE__LPTMR_1_BASE)
  /** Peripheral WAKE__LPTMR_1 base pointer */
  #define WAKE__LPTMR_1_NS                         ((LPTMR_Type *)WAKE__LPTMR_1_BASE_NS)
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS                         { VBAT__LPTMR_BASE, WAKE__LPTMR_0_BASE, WAKE__LPTMR_1_BASE }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS                          { VBAT__LPTMR, WAKE__LPTMR_0, WAKE__LPTMR_1 }
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS_NS                      { VBAT__LPTMR_BASE_NS, WAKE__LPTMR_0_BASE_NS, WAKE__LPTMR_1_BASE_NS }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS_NS                       { VBAT__LPTMR_NS, WAKE__LPTMR_0_NS, WAKE__LPTMR_1_NS }
#else
  /** Peripheral VBAT__LPTMR base address */
  #define VBAT__LPTMR_BASE                         (0x46330000u)
  /** Peripheral VBAT__LPTMR base pointer */
  #define VBAT__LPTMR                              ((LPTMR_Type *)VBAT__LPTMR_BASE)
  /** Peripheral WAKE__LPTMR_0 base address */
  #define WAKE__LPTMR_0_BASE                       (0x46130000u)
  /** Peripheral WAKE__LPTMR_0 base pointer */
  #define WAKE__LPTMR_0                            ((LPTMR_Type *)WAKE__LPTMR_0_BASE)
  /** Peripheral WAKE__LPTMR_1 base address */
  #define WAKE__LPTMR_1_BASE                       (0x46140000u)
  /** Peripheral WAKE__LPTMR_1 base pointer */
  #define WAKE__LPTMR_1                            ((LPTMR_Type *)WAKE__LPTMR_1_BASE)
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS                         { VBAT__LPTMR_BASE, WAKE__LPTMR_0_BASE, WAKE__LPTMR_1_BASE }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS                          { VBAT__LPTMR, WAKE__LPTMR_0, WAKE__LPTMR_1 }
#endif
/** Interrupt vectors for the LPTMR peripheral type */
#define LPTMR_IRQS                               { VBAT_LPTMR_IRQn, WAKE_LPTMR0_IRQn, WAKE_LPTMR1_IRQn }

