zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* MEMCON_GLOBAL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__MEMCON_GLOBAL base address */
  #define SYSCON__MEMCON_GLOBAL_BASE               (0x50560000u)
  /** Peripheral SYSCON__MEMCON_GLOBAL base address */
  #define SYSCON__MEMCON_GLOBAL_BASE_NS            (0x40560000u)
  /** Peripheral SYSCON__MEMCON_GLOBAL base pointer */
  #define SYSCON__MEMCON_GLOBAL                    ((MEMCON_GLOBAL_Type *)SYSCON__MEMCON_GLOBAL_BASE)
  /** Peripheral SYSCON__MEMCON_GLOBAL base pointer */
  #define SYSCON__MEMCON_GLOBAL_NS                 ((MEMCON_GLOBAL_Type *)SYSCON__MEMCON_GLOBAL_BASE_NS)
  /** Array initializer of MEMCON_GLOBAL peripheral base addresses */
  #define MEMCON_GLOBAL_BASE_ADDRS                 { SYSCON__MEMCON_GLOBAL_BASE }
  /** Array initializer of MEMCON_GLOBAL peripheral base pointers */
  #define MEMCON_GLOBAL_BASE_PTRS                  { SYSCON__MEMCON_GLOBAL }
  /** Array initializer of MEMCON_GLOBAL peripheral base addresses */
  #define MEMCON_GLOBAL_BASE_ADDRS_NS              { SYSCON__MEMCON_GLOBAL_BASE_NS }
  /** Array initializer of MEMCON_GLOBAL peripheral base pointers */
  #define MEMCON_GLOBAL_BASE_PTRS_NS               { SYSCON__MEMCON_GLOBAL_NS }
#else
  /** Peripheral SYSCON__MEMCON_GLOBAL base address */
  #define SYSCON__MEMCON_GLOBAL_BASE               (0x40560000u)
  /** Peripheral SYSCON__MEMCON_GLOBAL base pointer */
  #define SYSCON__MEMCON_GLOBAL                    ((MEMCON_GLOBAL_Type *)SYSCON__MEMCON_GLOBAL_BASE)
  /** Array initializer of MEMCON_GLOBAL peripheral base addresses */
  #define MEMCON_GLOBAL_BASE_ADDRS                 { SYSCON__MEMCON_GLOBAL_BASE }
  /** Array initializer of MEMCON_GLOBAL peripheral base pointers */
  #define MEMCON_GLOBAL_BASE_PTRS                  { SYSCON__MEMCON_GLOBAL }
#endif

/* MEMCON_SLICE - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__MEMCON_S0 base address */
  #define SYSCON__MEMCON_S0_BASE                   (0x50561000u)
  /** Peripheral SYSCON__MEMCON_S0 base address */
  #define SYSCON__MEMCON_S0_BASE_NS                (0x40561000u)
  /** Peripheral SYSCON__MEMCON_S0 base pointer */
  #define SYSCON__MEMCON_S0                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S0_BASE)
  /** Peripheral SYSCON__MEMCON_S0 base pointer */
  #define SYSCON__MEMCON_S0_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S0_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S1 base address */
  #define SYSCON__MEMCON_S1_BASE                   (0x50562000u)
  /** Peripheral SYSCON__MEMCON_S1 base address */
  #define SYSCON__MEMCON_S1_BASE_NS                (0x40562000u)
  /** Peripheral SYSCON__MEMCON_S1 base pointer */
  #define SYSCON__MEMCON_S1                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S1_BASE)
  /** Peripheral SYSCON__MEMCON_S1 base pointer */
  #define SYSCON__MEMCON_S1_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S1_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S2 base address */
  #define SYSCON__MEMCON_S2_BASE                   (0x50563000u)
  /** Peripheral SYSCON__MEMCON_S2 base address */
  #define SYSCON__MEMCON_S2_BASE_NS                (0x40563000u)
  /** Peripheral SYSCON__MEMCON_S2 base pointer */
  #define SYSCON__MEMCON_S2                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S2_BASE)
  /** Peripheral SYSCON__MEMCON_S2 base pointer */
  #define SYSCON__MEMCON_S2_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S2_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S3 base address */
  #define SYSCON__MEMCON_S3_BASE                   (0x50564000u)
  /** Peripheral SYSCON__MEMCON_S3 base address */
  #define SYSCON__MEMCON_S3_BASE_NS                (0x40564000u)
  /** Peripheral SYSCON__MEMCON_S3 base pointer */
  #define SYSCON__MEMCON_S3                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S3_BASE)
  /** Peripheral SYSCON__MEMCON_S3 base pointer */
  #define SYSCON__MEMCON_S3_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S3_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S4 base address */
  #define SYSCON__MEMCON_S4_BASE                   (0x50565000u)
  /** Peripheral SYSCON__MEMCON_S4 base address */
  #define SYSCON__MEMCON_S4_BASE_NS                (0x40565000u)
  /** Peripheral SYSCON__MEMCON_S4 base pointer */
  #define SYSCON__MEMCON_S4                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S4_BASE)
  /** Peripheral SYSCON__MEMCON_S4 base pointer */
  #define SYSCON__MEMCON_S4_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S4_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S5 base address */
  #define SYSCON__MEMCON_S5_BASE                   (0x50566000u)
  /** Peripheral SYSCON__MEMCON_S5 base address */
  #define SYSCON__MEMCON_S5_BASE_NS                (0x40566000u)
  /** Peripheral SYSCON__MEMCON_S5 base pointer */
  #define SYSCON__MEMCON_S5                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S5_BASE)
  /** Peripheral SYSCON__MEMCON_S5 base pointer */
  #define SYSCON__MEMCON_S5_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S5_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S6 base address */
  #define SYSCON__MEMCON_S6_BASE                   (0x50567000u)
  /** Peripheral SYSCON__MEMCON_S6 base address */
  #define SYSCON__MEMCON_S6_BASE_NS                (0x40567000u)
  /** Peripheral SYSCON__MEMCON_S6 base pointer */
  #define SYSCON__MEMCON_S6                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S6_BASE)
  /** Peripheral SYSCON__MEMCON_S6 base pointer */
  #define SYSCON__MEMCON_S6_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S6_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S7 base address */
  #define SYSCON__MEMCON_S7_BASE                   (0x50568000u)
  /** Peripheral SYSCON__MEMCON_S7 base address */
  #define SYSCON__MEMCON_S7_BASE_NS                (0x40568000u)
  /** Peripheral SYSCON__MEMCON_S7 base pointer */
  #define SYSCON__MEMCON_S7                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S7_BASE)
  /** Peripheral SYSCON__MEMCON_S7 base pointer */
  #define SYSCON__MEMCON_S7_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S7_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S8 base address */
  #define SYSCON__MEMCON_S8_BASE                   (0x50569000u)
  /** Peripheral SYSCON__MEMCON_S8 base address */
  #define SYSCON__MEMCON_S8_BASE_NS                (0x40569000u)
  /** Peripheral SYSCON__MEMCON_S8 base pointer */
  #define SYSCON__MEMCON_S8                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S8_BASE)
  /** Peripheral SYSCON__MEMCON_S8 base pointer */
  #define SYSCON__MEMCON_S8_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S8_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S9 base address */
  #define SYSCON__MEMCON_S9_BASE                   (0x5056A000u)
  /** Peripheral SYSCON__MEMCON_S9 base address */
  #define SYSCON__MEMCON_S9_BASE_NS                (0x4056A000u)
  /** Peripheral SYSCON__MEMCON_S9 base pointer */
  #define SYSCON__MEMCON_S9                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S9_BASE)
  /** Peripheral SYSCON__MEMCON_S9 base pointer */
  #define SYSCON__MEMCON_S9_NS                     ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S9_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S10 base address */
  #define SYSCON__MEMCON_S10_BASE                  (0x5056B000u)
  /** Peripheral SYSCON__MEMCON_S10 base address */
  #define SYSCON__MEMCON_S10_BASE_NS               (0x4056B000u)
  /** Peripheral SYSCON__MEMCON_S10 base pointer */
  #define SYSCON__MEMCON_S10                       ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S10_BASE)
  /** Peripheral SYSCON__MEMCON_S10 base pointer */
  #define SYSCON__MEMCON_S10_NS                    ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S10_BASE_NS)
  /** Peripheral SYSCON__MEMCON_S11 base address */
  #define SYSCON__MEMCON_S11_BASE                  (0x5056C000u)
  /** Peripheral SYSCON__MEMCON_S11 base address */
  #define SYSCON__MEMCON_S11_BASE_NS               (0x4056C000u)
  /** Peripheral SYSCON__MEMCON_S11 base pointer */
  #define SYSCON__MEMCON_S11                       ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S11_BASE)
  /** Peripheral SYSCON__MEMCON_S11 base pointer */
  #define SYSCON__MEMCON_S11_NS                    ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S11_BASE_NS)
  /** Array initializer of MEMCON_SLICE peripheral base addresses */
  #define MEMCON_SLICE_BASE_ADDRS                  { SYSCON__MEMCON_S0_BASE, SYSCON__MEMCON_S1_BASE, SYSCON__MEMCON_S2_BASE, SYSCON__MEMCON_S3_BASE, SYSCON__MEMCON_S4_BASE, SYSCON__MEMCON_S5_BASE, SYSCON__MEMCON_S6_BASE, SYSCON__MEMCON_S7_BASE, SYSCON__MEMCON_S8_BASE, SYSCON__MEMCON_S9_BASE, SYSCON__MEMCON_S10_BASE, SYSCON__MEMCON_S11_BASE }
  /** Array initializer of MEMCON_SLICE peripheral base pointers */
  #define MEMCON_SLICE_BASE_PTRS                   { SYSCON__MEMCON_S0, SYSCON__MEMCON_S1, SYSCON__MEMCON_S2, SYSCON__MEMCON_S3, SYSCON__MEMCON_S4, SYSCON__MEMCON_S5, SYSCON__MEMCON_S6, SYSCON__MEMCON_S7, SYSCON__MEMCON_S8, SYSCON__MEMCON_S9, SYSCON__MEMCON_S10, SYSCON__MEMCON_S11 }
  /** Array initializer of MEMCON_SLICE peripheral base addresses */
  #define MEMCON_SLICE_BASE_ADDRS_NS               { SYSCON__MEMCON_S0_BASE_NS, SYSCON__MEMCON_S1_BASE_NS, SYSCON__MEMCON_S2_BASE_NS, SYSCON__MEMCON_S3_BASE_NS, SYSCON__MEMCON_S4_BASE_NS, SYSCON__MEMCON_S5_BASE_NS, SYSCON__MEMCON_S6_BASE_NS, SYSCON__MEMCON_S7_BASE_NS, SYSCON__MEMCON_S8_BASE_NS, SYSCON__MEMCON_S9_BASE_NS, SYSCON__MEMCON_S10_BASE_NS, SYSCON__MEMCON_S11_BASE_NS }
  /** Array initializer of MEMCON_SLICE peripheral base pointers */
  #define MEMCON_SLICE_BASE_PTRS_NS                { SYSCON__MEMCON_S0_NS, SYSCON__MEMCON_S1_NS, SYSCON__MEMCON_S2_NS, SYSCON__MEMCON_S3_NS, SYSCON__MEMCON_S4_NS, SYSCON__MEMCON_S5_NS, SYSCON__MEMCON_S6_NS, SYSCON__MEMCON_S7_NS, SYSCON__MEMCON_S8_NS, SYSCON__MEMCON_S9_NS, SYSCON__MEMCON_S10_NS, SYSCON__MEMCON_S11_NS }
#else
  /** Peripheral SYSCON__MEMCON_S0 base address */
  #define SYSCON__MEMCON_S0_BASE                   (0x40561000u)
  /** Peripheral SYSCON__MEMCON_S0 base pointer */
  #define SYSCON__MEMCON_S0                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S0_BASE)
  /** Peripheral SYSCON__MEMCON_S1 base address */
  #define SYSCON__MEMCON_S1_BASE                   (0x40562000u)
  /** Peripheral SYSCON__MEMCON_S1 base pointer */
  #define SYSCON__MEMCON_S1                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S1_BASE)
  /** Peripheral SYSCON__MEMCON_S2 base address */
  #define SYSCON__MEMCON_S2_BASE                   (0x40563000u)
  /** Peripheral SYSCON__MEMCON_S2 base pointer */
  #define SYSCON__MEMCON_S2                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S2_BASE)
  /** Peripheral SYSCON__MEMCON_S3 base address */
  #define SYSCON__MEMCON_S3_BASE                   (0x40564000u)
  /** Peripheral SYSCON__MEMCON_S3 base pointer */
  #define SYSCON__MEMCON_S3                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S3_BASE)
  /** Peripheral SYSCON__MEMCON_S4 base address */
  #define SYSCON__MEMCON_S4_BASE                   (0x40565000u)
  /** Peripheral SYSCON__MEMCON_S4 base pointer */
  #define SYSCON__MEMCON_S4                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S4_BASE)
  /** Peripheral SYSCON__MEMCON_S5 base address */
  #define SYSCON__MEMCON_S5_BASE                   (0x40566000u)
  /** Peripheral SYSCON__MEMCON_S5 base pointer */
  #define SYSCON__MEMCON_S5                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S5_BASE)
  /** Peripheral SYSCON__MEMCON_S6 base address */
  #define SYSCON__MEMCON_S6_BASE                   (0x40567000u)
  /** Peripheral SYSCON__MEMCON_S6 base pointer */
  #define SYSCON__MEMCON_S6                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S6_BASE)
  /** Peripheral SYSCON__MEMCON_S7 base address */
  #define SYSCON__MEMCON_S7_BASE                   (0x40568000u)
  /** Peripheral SYSCON__MEMCON_S7 base pointer */
  #define SYSCON__MEMCON_S7                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S7_BASE)
  /** Peripheral SYSCON__MEMCON_S8 base address */
  #define SYSCON__MEMCON_S8_BASE                   (0x40569000u)
  /** Peripheral SYSCON__MEMCON_S8 base pointer */
  #define SYSCON__MEMCON_S8                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S8_BASE)
  /** Peripheral SYSCON__MEMCON_S9 base address */
  #define SYSCON__MEMCON_S9_BASE                   (0x4056A000u)
  /** Peripheral SYSCON__MEMCON_S9 base pointer */
  #define SYSCON__MEMCON_S9                        ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S9_BASE)
  /** Peripheral SYSCON__MEMCON_S10 base address */
  #define SYSCON__MEMCON_S10_BASE                  (0x4056B000u)
  /** Peripheral SYSCON__MEMCON_S10 base pointer */
  #define SYSCON__MEMCON_S10                       ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S10_BASE)
  /** Peripheral SYSCON__MEMCON_S11 base address */
  #define SYSCON__MEMCON_S11_BASE                  (0x4056C000u)
  /** Peripheral SYSCON__MEMCON_S11 base pointer */
  #define SYSCON__MEMCON_S11                       ((MEMCON_SLICE_Type *)SYSCON__MEMCON_S11_BASE)
  /** Array initializer of MEMCON_SLICE peripheral base addresses */
  #define MEMCON_SLICE_BASE_ADDRS                  { SYSCON__MEMCON_S0_BASE, SYSCON__MEMCON_S1_BASE, SYSCON__MEMCON_S2_BASE, SYSCON__MEMCON_S3_BASE, SYSCON__MEMCON_S4_BASE, SYSCON__MEMCON_S5_BASE, SYSCON__MEMCON_S6_BASE, SYSCON__MEMCON_S7_BASE, SYSCON__MEMCON_S8_BASE, SYSCON__MEMCON_S9_BASE, SYSCON__MEMCON_S10_BASE, SYSCON__MEMCON_S11_BASE }
  /** Array initializer of MEMCON_SLICE peripheral base pointers */
  #define MEMCON_SLICE_BASE_PTRS                   { SYSCON__MEMCON_S0, SYSCON__MEMCON_S1, SYSCON__MEMCON_S2, SYSCON__MEMCON_S3, SYSCON__MEMCON_S4, SYSCON__MEMCON_S5, SYSCON__MEMCON_S6, SYSCON__MEMCON_S7, SYSCON__MEMCON_S8, SYSCON__MEMCON_S9, SYSCON__MEMCON_S10, SYSCON__MEMCON_S11 }
#endif

