zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* POWERCON_SOC_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base address */
  #define SYSCON__POWERCON_SOC_CTRL_BASE           (0x50548000u)
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base address */
  #define SYSCON__POWERCON_SOC_CTRL_BASE_NS        (0x40548000u)
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base pointer */
  #define SYSCON__POWERCON_SOC_CTRL                ((POWERCON_SOC_CTRL_Type *)SYSCON__POWERCON_SOC_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base pointer */
  #define SYSCON__POWERCON_SOC_CTRL_NS             ((POWERCON_SOC_CTRL_Type *)SYSCON__POWERCON_SOC_CTRL_BASE_NS)
  /** Array initializer of POWERCON_SOC_CTRL peripheral base addresses */
  #define POWERCON_SOC_CTRL_BASE_ADDRS             { SYSCON__POWERCON_SOC_CTRL_BASE }
  /** Array initializer of POWERCON_SOC_CTRL peripheral base pointers */
  #define POWERCON_SOC_CTRL_BASE_PTRS              { SYSCON__POWERCON_SOC_CTRL }
  /** Array initializer of POWERCON_SOC_CTRL peripheral base addresses */
  #define POWERCON_SOC_CTRL_BASE_ADDRS_NS          { SYSCON__POWERCON_SOC_CTRL_BASE_NS }
  /** Array initializer of POWERCON_SOC_CTRL peripheral base pointers */
  #define POWERCON_SOC_CTRL_BASE_PTRS_NS           { SYSCON__POWERCON_SOC_CTRL_NS }
#else
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base address */
  #define SYSCON__POWERCON_SOC_CTRL_BASE           (0x40548000u)
  /** Peripheral SYSCON__POWERCON_SOC_CTRL base pointer */
  #define SYSCON__POWERCON_SOC_CTRL                ((POWERCON_SOC_CTRL_Type *)SYSCON__POWERCON_SOC_CTRL_BASE)
  /** Array initializer of POWERCON_SOC_CTRL peripheral base addresses */
  #define POWERCON_SOC_CTRL_BASE_ADDRS             { SYSCON__POWERCON_SOC_CTRL_BASE }
  /** Array initializer of POWERCON_SOC_CTRL peripheral base pointers */
  #define POWERCON_SOC_CTRL_BASE_PTRS              { SYSCON__POWERCON_SOC_CTRL }
#endif

/* POWERCON_SYS_SLEEP_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base address */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE     (0x50540400u)
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base address */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE_NS  (0x40540400u)
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base pointer */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL          ((POWERCON_SYS_SLEEP_CTRL_Type *)SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE)
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base pointer */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL_NS       ((POWERCON_SYS_SLEEP_CTRL_Type *)SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE_NS)
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base addresses */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_ADDRS       { SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE }
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base pointers */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_PTRS        { SYSCON__POWERCON_SYS_SLEEP_CTRL }
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base addresses */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_ADDRS_NS    { SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE_NS }
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base pointers */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_PTRS_NS     { SYSCON__POWERCON_SYS_SLEEP_CTRL_NS }
#else
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base address */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE     (0x40540400u)
  /** Peripheral SYSCON__POWERCON_SYS_SLEEP_CTRL base pointer */
  #define SYSCON__POWERCON_SYS_SLEEP_CTRL          ((POWERCON_SYS_SLEEP_CTRL_Type *)SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE)
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base addresses */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_ADDRS       { SYSCON__POWERCON_SYS_SLEEP_CTRL_BASE }
  /** Array initializer of POWERCON_SYS_SLEEP_CTRL peripheral base pointers */
  #define POWERCON_SYS_SLEEP_CTRL_BASE_PTRS        { SYSCON__POWERCON_SYS_SLEEP_CTRL }
#endif

/* PWM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__FLEXPWM_0 base address */
  #define HSP__FLEXPWM_0_BASE                      (0x52080000u)
  /** Peripheral HSP__FLEXPWM_0 base address */
  #define HSP__FLEXPWM_0_BASE_NS                   (0x42080000u)
  /** Peripheral HSP__FLEXPWM_0 base pointer */
  #define HSP__FLEXPWM_0                           ((PWM_Type *)HSP__FLEXPWM_0_BASE)
  /** Peripheral HSP__FLEXPWM_0 base pointer */
  #define HSP__FLEXPWM_0_NS                        ((PWM_Type *)HSP__FLEXPWM_0_BASE_NS)
  /** Peripheral HSP__FLEXPWM_1 base address */
  #define HSP__FLEXPWM_1_BASE                      (0x52090000u)
  /** Peripheral HSP__FLEXPWM_1 base address */
  #define HSP__FLEXPWM_1_BASE_NS                   (0x42090000u)
  /** Peripheral HSP__FLEXPWM_1 base pointer */
  #define HSP__FLEXPWM_1                           ((PWM_Type *)HSP__FLEXPWM_1_BASE)
  /** Peripheral HSP__FLEXPWM_1 base pointer */
  #define HSP__FLEXPWM_1_NS                        ((PWM_Type *)HSP__FLEXPWM_1_BASE_NS)
  /** Peripheral HSP__FLEXPWM_2 base address */
  #define HSP__FLEXPWM_2_BASE                      (0x52870000u)
  /** Peripheral HSP__FLEXPWM_2 base address */
  #define HSP__FLEXPWM_2_BASE_NS                   (0x42870000u)
  /** Peripheral HSP__FLEXPWM_2 base pointer */
  #define HSP__FLEXPWM_2                           ((PWM_Type *)HSP__FLEXPWM_2_BASE)
  /** Peripheral HSP__FLEXPWM_2 base pointer */
  #define HSP__FLEXPWM_2_NS                        ((PWM_Type *)HSP__FLEXPWM_2_BASE_NS)
  /** Peripheral HSP__FLEXPWM_3 base address */
  #define HSP__FLEXPWM_3_BASE                      (0x52880000u)
  /** Peripheral HSP__FLEXPWM_3 base address */
  #define HSP__FLEXPWM_3_BASE_NS                   (0x42880000u)
  /** Peripheral HSP__FLEXPWM_3 base pointer */
  #define HSP__FLEXPWM_3                           ((PWM_Type *)HSP__FLEXPWM_3_BASE)
  /** Peripheral HSP__FLEXPWM_3 base pointer */
  #define HSP__FLEXPWM_3_NS                        ((PWM_Type *)HSP__FLEXPWM_3_BASE_NS)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { HSP__FLEXPWM_0_BASE, HSP__FLEXPWM_1_BASE, HSP__FLEXPWM_2_BASE, HSP__FLEXPWM_3_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { HSP__FLEXPWM_0, HSP__FLEXPWM_1, HSP__FLEXPWM_2, HSP__FLEXPWM_3 }
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS_NS                        { HSP__FLEXPWM_0_BASE_NS, HSP__FLEXPWM_1_BASE_NS, HSP__FLEXPWM_2_BASE_NS, HSP__FLEXPWM_3_BASE_NS }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS_NS                         { HSP__FLEXPWM_0_NS, HSP__FLEXPWM_1_NS, HSP__FLEXPWM_2_NS, HSP__FLEXPWM_3_NS }
#else
  /** Peripheral HSP__FLEXPWM_0 base address */
  #define HSP__FLEXPWM_0_BASE                      (0x42080000u)
  /** Peripheral HSP__FLEXPWM_0 base pointer */
  #define HSP__FLEXPWM_0                           ((PWM_Type *)HSP__FLEXPWM_0_BASE)
  /** Peripheral HSP__FLEXPWM_1 base address */
  #define HSP__FLEXPWM_1_BASE                      (0x42090000u)
  /** Peripheral HSP__FLEXPWM_1 base pointer */
  #define HSP__FLEXPWM_1                           ((PWM_Type *)HSP__FLEXPWM_1_BASE)
  /** Peripheral HSP__FLEXPWM_2 base address */
  #define HSP__FLEXPWM_2_BASE                      (0x42870000u)
  /** Peripheral HSP__FLEXPWM_2 base pointer */
  #define HSP__FLEXPWM_2                           ((PWM_Type *)HSP__FLEXPWM_2_BASE)
  /** Peripheral HSP__FLEXPWM_3 base address */
  #define HSP__FLEXPWM_3_BASE                      (0x42880000u)
  /** Peripheral HSP__FLEXPWM_3 base pointer */
  #define HSP__FLEXPWM_3                           ((PWM_Type *)HSP__FLEXPWM_3_BASE)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { HSP__FLEXPWM_0_BASE, HSP__FLEXPWM_1_BASE, HSP__FLEXPWM_2_BASE, HSP__FLEXPWM_3_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { HSP__FLEXPWM_0, HSP__FLEXPWM_1, HSP__FLEXPWM_2, HSP__FLEXPWM_3 }
#endif
/** Interrupt vectors for the PWM peripheral type */
#define PWM_CMP_IRQS                             { { HSP_EFLEXPWM0_CH0_IRQn, HSP_EFLEXPWM0_CH1_IRQn, HSP_EFLEXPWM0_CH2_IRQn, HSP_EFLEXPWM0_CH3_IRQn }, { HSP_EFLEXPWM1_CH0_IRQn, HSP_EFLEXPWM1_CH1_IRQn, HSP_EFLEXPWM1_CH2_IRQn, HSP_EFLEXPWM1_CH3_IRQn }, { HSP_EFLEXPWM2_CH0_IRQn, HSP_EFLEXPWM2_CH1_IRQn, HSP_EFLEXPWM2_CH2_IRQn, HSP_EFLEXPWM2_CH3_IRQn }, { HSP_EFLEXPWM3_CH0_IRQn, HSP_EFLEXPWM3_CH1_IRQn, HSP_EFLEXPWM3_CH2_IRQn, HSP_EFLEXPWM3_CH3_IRQn } }
#define PWM_RELOAD_IRQS                          { { HSP_EFLEXPWM0_CH0_IRQn, HSP_EFLEXPWM0_CH1_IRQn, HSP_EFLEXPWM0_CH2_IRQn, HSP_EFLEXPWM0_CH3_IRQn }, { HSP_EFLEXPWM1_CH0_IRQn, HSP_EFLEXPWM1_CH1_IRQn, HSP_EFLEXPWM1_CH2_IRQn, HSP_EFLEXPWM1_CH3_IRQn }, { HSP_EFLEXPWM2_CH0_IRQn, HSP_EFLEXPWM2_CH1_IRQn, HSP_EFLEXPWM2_CH2_IRQn, HSP_EFLEXPWM2_CH3_IRQn }, { HSP_EFLEXPWM3_CH0_IRQn, HSP_EFLEXPWM3_CH1_IRQn, HSP_EFLEXPWM3_CH2_IRQn, HSP_EFLEXPWM3_CH3_IRQn } }
#define PWM_CAPTURE_IRQS                         { { HSP_EFLEXPWM0_CH0_IRQn, HSP_EFLEXPWM0_CH1_IRQn, HSP_EFLEXPWM0_CH2_IRQn, HSP_EFLEXPWM0_CH3_IRQn }, { HSP_EFLEXPWM1_CH0_IRQn, HSP_EFLEXPWM1_CH1_IRQn, HSP_EFLEXPWM1_CH2_IRQn, HSP_EFLEXPWM1_CH3_IRQn }, { HSP_EFLEXPWM2_CH0_IRQn, HSP_EFLEXPWM2_CH1_IRQn, HSP_EFLEXPWM2_CH2_IRQn, HSP_EFLEXPWM2_CH3_IRQn }, { HSP_EFLEXPWM3_CH0_IRQn, HSP_EFLEXPWM3_CH1_IRQn, HSP_EFLEXPWM3_CH2_IRQn, HSP_EFLEXPWM3_CH3_IRQn } }
#define PWM_FAULT_IRQS                           { HSP_EFLEXPWM0_ERROR_IRQn, HSP_EFLEXPWM1_ERROR_IRQn, HSP_EFLEXPWM2_ERROR_IRQn, HSP_EFLEXPWM3_ERROR_IRQn }

