zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* TRGSYNC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__TRGSYNC_0 base address */
  #define HSP__TRGSYNC_0_BASE                      (0x52990000u)
  /** Peripheral HSP__TRGSYNC_0 base address */
  #define HSP__TRGSYNC_0_BASE_NS                   (0x42990000u)
  /** Peripheral HSP__TRGSYNC_0 base pointer */
  #define HSP__TRGSYNC_0                           ((TRGSYNC_Type *)HSP__TRGSYNC_0_BASE)
  /** Peripheral HSP__TRGSYNC_0 base pointer */
  #define HSP__TRGSYNC_0_NS                        ((TRGSYNC_Type *)HSP__TRGSYNC_0_BASE_NS)
  /** Peripheral HSP__TRGSYNC_1 base address */
  #define HSP__TRGSYNC_1_BASE                      (0x529A0000u)
  /** Peripheral HSP__TRGSYNC_1 base address */
  #define HSP__TRGSYNC_1_BASE_NS                   (0x429A0000u)
  /** Peripheral HSP__TRGSYNC_1 base pointer */
  #define HSP__TRGSYNC_1                           ((TRGSYNC_Type *)HSP__TRGSYNC_1_BASE)
  /** Peripheral HSP__TRGSYNC_1 base pointer */
  #define HSP__TRGSYNC_1_NS                        ((TRGSYNC_Type *)HSP__TRGSYNC_1_BASE_NS)
  /** Peripheral WAKE__TRGSYNC base address */
  #define WAKE__TRGSYNC_BASE                       (0x560C0000u)
  /** Peripheral WAKE__TRGSYNC base address */
  #define WAKE__TRGSYNC_BASE_NS                    (0x460C0000u)
  /** Peripheral WAKE__TRGSYNC base pointer */
  #define WAKE__TRGSYNC                            ((TRGSYNC_Type *)WAKE__TRGSYNC_BASE)
  /** Peripheral WAKE__TRGSYNC base pointer */
  #define WAKE__TRGSYNC_NS                         ((TRGSYNC_Type *)WAKE__TRGSYNC_BASE_NS)
  /** Array initializer of TRGSYNC peripheral base addresses */
  #define TRGSYNC_BASE_ADDRS                       { HSP__TRGSYNC_0_BASE, HSP__TRGSYNC_1_BASE, WAKE__TRGSYNC_BASE }
  /** Array initializer of TRGSYNC peripheral base pointers */
  #define TRGSYNC_BASE_PTRS                        { HSP__TRGSYNC_0, HSP__TRGSYNC_1, WAKE__TRGSYNC }
  /** Array initializer of TRGSYNC peripheral base addresses */
  #define TRGSYNC_BASE_ADDRS_NS                    { HSP__TRGSYNC_0_BASE_NS, HSP__TRGSYNC_1_BASE_NS, WAKE__TRGSYNC_BASE_NS }
  /** Array initializer of TRGSYNC peripheral base pointers */
  #define TRGSYNC_BASE_PTRS_NS                     { HSP__TRGSYNC_0_NS, HSP__TRGSYNC_1_NS, WAKE__TRGSYNC_NS }
#else
  /** Peripheral HSP__TRGSYNC_0 base address */
  #define HSP__TRGSYNC_0_BASE                      (0x42990000u)
  /** Peripheral HSP__TRGSYNC_0 base pointer */
  #define HSP__TRGSYNC_0                           ((TRGSYNC_Type *)HSP__TRGSYNC_0_BASE)
  /** Peripheral HSP__TRGSYNC_1 base address */
  #define HSP__TRGSYNC_1_BASE                      (0x429A0000u)
  /** Peripheral HSP__TRGSYNC_1 base pointer */
  #define HSP__TRGSYNC_1                           ((TRGSYNC_Type *)HSP__TRGSYNC_1_BASE)
  /** Peripheral WAKE__TRGSYNC base address */
  #define WAKE__TRGSYNC_BASE                       (0x460C0000u)
  /** Peripheral WAKE__TRGSYNC base pointer */
  #define WAKE__TRGSYNC                            ((TRGSYNC_Type *)WAKE__TRGSYNC_BASE)
  /** Array initializer of TRGSYNC peripheral base addresses */
  #define TRGSYNC_BASE_ADDRS                       { HSP__TRGSYNC_0_BASE, HSP__TRGSYNC_1_BASE, WAKE__TRGSYNC_BASE }
  /** Array initializer of TRGSYNC peripheral base pointers */
  #define TRGSYNC_BASE_PTRS                        { HSP__TRGSYNC_0, HSP__TRGSYNC_1, WAKE__TRGSYNC }
#endif

/* USB - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USBFS base address */
  #define COMM__USBFS_BASE                         (0x5A0B0000u)
  /** Peripheral COMM__USBFS base address */
  #define COMM__USBFS_BASE_NS                      (0x4A0B0000u)
  /** Peripheral COMM__USBFS base pointer */
  #define COMM__USBFS                              ((USB_Type *)COMM__USBFS_BASE)
  /** Peripheral COMM__USBFS base pointer */
  #define COMM__USBFS_NS                           ((USB_Type *)COMM__USBFS_BASE_NS)
  /** Array initializer of USB peripheral base addresses */
  #define USB_BASE_ADDRS                           { COMM__USBFS_BASE }
  /** Array initializer of USB peripheral base pointers */
  #define USB_BASE_PTRS                            { COMM__USBFS }
  /** Array initializer of USB peripheral base addresses */
  #define USB_BASE_ADDRS_NS                        { COMM__USBFS_BASE_NS }
  /** Array initializer of USB peripheral base pointers */
  #define USB_BASE_PTRS_NS                         { COMM__USBFS_NS }
#else
  /** Peripheral COMM__USBFS base address */
  #define COMM__USBFS_BASE                         (0x4A0B0000u)
  /** Peripheral COMM__USBFS base pointer */
  #define COMM__USBFS                              ((USB_Type *)COMM__USBFS_BASE)
  /** Array initializer of USB peripheral base addresses */
  #define USB_BASE_ADDRS                           { COMM__USBFS_BASE }
  /** Array initializer of USB peripheral base pointers */
  #define USB_BASE_PTRS                            { COMM__USBFS }
#endif
/** Interrupt vectors for the USB peripheral type */
#define USB_IRQS                                 { COMM_USB1_IRQn }
/* Backward compatibility */
#define USBFS_IRQS                               USB_IRQS
#define USBFS_IRQHandler                         COMM_USB1_IRQHandler


/* USBHS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USBC base address */
  #define COMM__USBC_BASE                          (0x5A0A0000u)
  /** Peripheral COMM__USBC base address */
  #define COMM__USBC_BASE_NS                       (0x4A0A0000u)
  /** Peripheral COMM__USBC base pointer */
  #define COMM__USBC                               ((USBHS_Type *)COMM__USBC_BASE)
  /** Peripheral COMM__USBC base pointer */
  #define COMM__USBC_NS                            ((USBHS_Type *)COMM__USBC_BASE_NS)
  /** Array initializer of USBHS peripheral base addresses */
  #define USBHS_BASE_ADDRS                         { COMM__USBC_BASE }
  /** Array initializer of USBHS peripheral base pointers */
  #define USBHS_BASE_PTRS                          { COMM__USBC }
  /** Array initializer of USBHS peripheral base addresses */
  #define USBHS_BASE_ADDRS_NS                      { COMM__USBC_BASE_NS }
  /** Array initializer of USBHS peripheral base pointers */
  #define USBHS_BASE_PTRS_NS                       { COMM__USBC_NS }
#else
  /** Peripheral COMM__USBC base address */
  #define COMM__USBC_BASE                          (0x4A0A0000u)
  /** Peripheral COMM__USBC base pointer */
  #define COMM__USBC                               ((USBHS_Type *)COMM__USBC_BASE)
  /** Array initializer of USBHS peripheral base addresses */
  #define USBHS_BASE_ADDRS                         { COMM__USBC_BASE }
  /** Array initializer of USBHS peripheral base pointers */
  #define USBHS_BASE_PTRS                          { COMM__USBC }
#endif
/** Interrupt vectors for the USBHS peripheral type */
#define USBHS_IRQS                               { COMM_USB0_IRQn }

/* USBHSDCD - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USBDCD base address */
  #define COMM__USBDCD_BASE                        (0x5A0F0800u)
  /** Peripheral COMM__USBDCD base address */
  #define COMM__USBDCD_BASE_NS                     (0x4A0F0800u)
  /** Peripheral COMM__USBDCD base pointer */
  #define COMM__USBDCD                             ((USBHSDCD_Type *)COMM__USBDCD_BASE)
  /** Peripheral COMM__USBDCD base pointer */
  #define COMM__USBDCD_NS                          ((USBHSDCD_Type *)COMM__USBDCD_BASE_NS)
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS                      { COMM__USBDCD_BASE }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS                       { COMM__USBDCD }
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS_NS                   { COMM__USBDCD_BASE_NS }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS_NS                    { COMM__USBDCD_NS }
#else
  /** Peripheral COMM__USBDCD base address */
  #define COMM__USBDCD_BASE                        (0x4A0F0800u)
  /** Peripheral COMM__USBDCD base pointer */
  #define COMM__USBDCD                             ((USBHSDCD_Type *)COMM__USBDCD_BASE)
  /** Array initializer of USBHSDCD peripheral base addresses */
  #define USBHSDCD_BASE_ADDRS                      { COMM__USBDCD_BASE }
  /** Array initializer of USBHSDCD peripheral base pointers */
  #define USBHSDCD_BASE_PTRS                       { COMM__USBDCD }
#endif
/* Backward compatibility */
#define USBHSDCD_IRQS                              USBPHY_IRQS
#define USBHSDCD_STACK_BASE_ADDRS                  { COMM__USBDCD_BASE }


/* USBNC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USBNC base address */
  #define COMM__USBNC_BASE                         (0x5A0A0200u)
  /** Peripheral COMM__USBNC base address */
  #define COMM__USBNC_BASE_NS                      (0x4A0A0200u)
  /** Peripheral COMM__USBNC base pointer */
  #define COMM__USBNC                              ((USBNC_Type *)COMM__USBNC_BASE)
  /** Peripheral COMM__USBNC base pointer */
  #define COMM__USBNC_NS                           ((USBNC_Type *)COMM__USBNC_BASE_NS)
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS                         { COMM__USBNC_BASE }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS                          { COMM__USBNC }
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS_NS                      { COMM__USBNC_BASE_NS }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS_NS                       { COMM__USBNC_NS }
#else
  /** Peripheral COMM__USBNC base address */
  #define COMM__USBNC_BASE                         (0x4A0A0200u)
  /** Peripheral COMM__USBNC base pointer */
  #define COMM__USBNC                              ((USBNC_Type *)COMM__USBNC_BASE)
  /** Array initializer of USBNC peripheral base addresses */
  #define USBNC_BASE_ADDRS                         { COMM__USBNC_BASE }
  /** Array initializer of USBNC peripheral base pointers */
  #define USBNC_BASE_PTRS                          { COMM__USBNC }
#endif
/* Backward compatibility */
#define USB_OTGn_CTRL     CTRL1
#define USBNC_USB_OTGn_CTRL_OVER_CUR_DIS_MASK     USBNC_CTRL1_OVER_CUR_DIS_MASK
#define USBNC_USB_OTGn_CTRL_OVER_CUR_DIS_SHIFT     USBNC_CTRL1_OVER_CUR_DIS_SHIFT
#define USBNC_USB_OTGn_CTRL_OVER_CUR_DIS(x)     USBNC_CTRL1_OVER_CUR_DIS(x)
#define USBNC_USB_OTGn_CTRL_OVER_CUR_POL_MASK     USBNC_CTRL1_OVER_CUR_POL_MASK
#define USBNC_USB_OTGn_CTRL_OVER_CUR_POL_SHIFT     USBNC_CTRL1_OVER_CUR_POL_SHIFT
#define USBNC_USB_OTGn_CTRL_OVER_CUR_POL(x)     USBNC_CTRL1_OVER_CUR_POL(x)
#define USBNC_USB_OTGn_CTRL_PWR_POL_MASK     USBNC_CTRL1_PWR_POL_MASK
#define USBNC_USB_OTGn_CTRL_PWR_POL_SHIFT     USBNC_CTRL1_PWR_POL_SHIFT
#define USBNC_USB_OTGn_CTRL_PWR_POL(x)     USBNC_CTRL1_PWR_POL(x)
#define USBNC_USB_OTGn_CTRL_WIE_MASK     USBNC_CTRL1_WIE_MASK
#define USBNC_USB_OTGn_CTRL_WIE_SHIFT     USBNC_CTRL1_WIE_SHIFT
#define USBNC_USB_OTGn_CTRL_WIE(x)     USBNC_CTRL1_WIE(x)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_EN_MASK     USBNC_CTRL1_WKUP_SW_EN_MASK
#define USBNC_USB_OTGn_CTRL_WKUP_SW_EN_SHIFT     USBNC_CTRL1_WKUP_SW_EN_SHIFT
#define USBNC_USB_OTGn_CTRL_WKUP_SW_EN(x)     USBNC_CTRL1_WKUP_SW_EN(x)
#define USBNC_USB_OTGn_CTRL_WKUP_SW_MASK     USBNC_CTRL1_WKUP_SW_MASK
#define USBNC_USB_OTGn_CTRL_WKUP_SW_SHIFT     USBNC_CTRL1_WKUP_SW_SHIFT
#define USBNC_USB_OTGn_CTRL_WKUP_SW(x)     USBNC_CTRL1_WKUP_SW(x)
#define USBNC_USB_OTGn_CTRL_WKUP_ID_EN_MASK     USBNC_CTRL1_WKUP_ID_EN_MASK
#define USBNC_USB_OTGn_CTRL_WKUP_ID_EN_SHIFT     USBNC_CTRL1_WKUP_ID_EN_SHIFT
#define USBNC_USB_OTGn_CTRL_WKUP_ID_EN(x)     USBNC_CTRL1_WKUP_ID_EN(x)
#define USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN_MASK     USBNC_CTRL1_WKUP_VBUS_EN_MASK
#define USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN_SHIFT     USBNC_CTRL1_WKUP_VBUS_EN_SHIFT
#define USBNC_USB_OTGn_CTRL_WKUP_VBUS_EN(x)     USBNC_CTRL1_WKUP_VBUS_EN(x)
#define USBNC_USB_OTGn_CTRL_REMOTE_WAKEUP_EN_MASK     USBNC_CTRL1_REMOTE_WAKEUP_EN_MASK
#define USBNC_USB_OTGn_CTRL_REMOTE_WAKEUP_EN_SHIFT     USBNC_CTRL1_REMOTE_WAKEUP_EN_SHIFT
#define USBNC_USB_OTGn_CTRL_REMOTE_WAKEUP_EN(x)     USBNC_CTRL1_REMOTE_WAKEUP_EN(x)
#define USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN_MASK     USBNC_CTRL1_WKUP_DPDM_EN_MASK
#define USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN_SHIFT     USBNC_CTRL1_WKUP_DPDM_EN_SHIFT
#define USBNC_USB_OTGn_CTRL_WKUP_DPDM_EN(x)     USBNC_CTRL1_WKUP_DPDM_EN(x)
#define USBNC_USB_OTGn_CTRL_WIR_MASK     USBNC_CTRL1_WIR_MASK
#define USBNC_USB_OTGn_CTRL_WIR_SHIFT     USBNC_CTRL1_WIR_SHIFT
#define USBNC_USB_OTGn_CTRL_WIR(x)     USBNC_CTRL1_WIR(x)
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
#define USBNC_STACK_BASE_ADDRS                { COMM__USBNC_BASE }
#define USBNC_STACK_BASE_ADDRS_NS             { COMM__USBNC_BASE_NS }
#else
#define USBNC_STACK_BASE_ADDRS                { COMM__USBNC_BASE }
#endif


/* USBPHY - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USBPHY base address */
  #define COMM__USBPHY_BASE                        (0x5A0F0000u)
  /** Peripheral COMM__USBPHY base address */
  #define COMM__USBPHY_BASE_NS                     (0x4A0F0000u)
  /** Peripheral COMM__USBPHY base pointer */
  #define COMM__USBPHY                             ((USBPHY_Type *)COMM__USBPHY_BASE)
  /** Peripheral COMM__USBPHY base pointer */
  #define COMM__USBPHY_NS                          ((USBPHY_Type *)COMM__USBPHY_BASE_NS)
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS                        { COMM__USBPHY_BASE }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS                         { COMM__USBPHY }
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS_NS                     { COMM__USBPHY_BASE_NS }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS_NS                      { COMM__USBPHY_NS }
#else
  /** Peripheral COMM__USBPHY base address */
  #define COMM__USBPHY_BASE                        (0x4A0F0000u)
  /** Peripheral COMM__USBPHY base pointer */
  #define COMM__USBPHY                             ((USBPHY_Type *)COMM__USBPHY_BASE)
  /** Array initializer of USBPHY peripheral base addresses */
  #define USBPHY_BASE_ADDRS                        { COMM__USBPHY_BASE }
  /** Array initializer of USBPHY peripheral base pointers */
  #define USBPHY_BASE_PTRS                         { COMM__USBPHY }
#endif
/** Interrupt vectors for the USBPHY peripheral type */
#define USBPHY_IRQS                              { COMM_USBPHY_IRQn }
/* Backward compatibility */
#define USBPHY_TX_TXCAL45DM_MASK            USBPHY_TX_TXCAL45DN_MASK
#define USBPHY_TX_TXCAL45DM_SHIFT           USBPHY_TX_TXCAL45DN_SHIFT
#define USBPHY_TX_TXCAL45DM(x)              USBPHY_TX_TXCAL45DN(x)
#define USBPHY_IRQHandler                   COMM_USBPHY_IRQHandler

#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
#define USBPHY_STACK_BASE_ADDRS             { COMM__USBPHY_BASE }
#define USBPHY_STACK_BASE_ADDRS_NS          { COMM__USBPHY_BASE_NS }
#else
#define USBPHY_STACK_BASE_ADDRS             { COMM__USBPHY_BASE }
#endif


