zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/MIMXRT2660_COMMON.h
/* USDHC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral COMM__USDHC_0 base address */
  #define COMM__USDHC_0_BASE                       (0x5A080000u)
  /** Peripheral COMM__USDHC_0 base address */
  #define COMM__USDHC_0_BASE_NS                    (0x4A080000u)
  /** Peripheral COMM__USDHC_0 base pointer */
  #define COMM__USDHC_0                            ((USDHC_Type *)COMM__USDHC_0_BASE)
  /** Peripheral COMM__USDHC_0 base pointer */
  #define COMM__USDHC_0_NS                         ((USDHC_Type *)COMM__USDHC_0_BASE_NS)
  /** Peripheral COMM__USDHC_1 base address */
  #define COMM__USDHC_1_BASE                       (0x5A090000u)
  /** Peripheral COMM__USDHC_1 base address */
  #define COMM__USDHC_1_BASE_NS                    (0x4A090000u)
  /** Peripheral COMM__USDHC_1 base pointer */
  #define COMM__USDHC_1                            ((USDHC_Type *)COMM__USDHC_1_BASE)
  /** Peripheral COMM__USDHC_1 base pointer */
  #define COMM__USDHC_1_NS                         ((USDHC_Type *)COMM__USDHC_1_BASE_NS)
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS                         { COMM__USDHC_0_BASE, COMM__USDHC_1_BASE }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS                          { COMM__USDHC_0, COMM__USDHC_1 }
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS_NS                      { COMM__USDHC_0_BASE_NS, COMM__USDHC_1_BASE_NS }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS_NS                       { COMM__USDHC_0_NS, COMM__USDHC_1_NS }
#else
  /** Peripheral COMM__USDHC_0 base address */
  #define COMM__USDHC_0_BASE                       (0x4A080000u)
  /** Peripheral COMM__USDHC_0 base pointer */
  #define COMM__USDHC_0                            ((USDHC_Type *)COMM__USDHC_0_BASE)
  /** Peripheral COMM__USDHC_1 base address */
  #define COMM__USDHC_1_BASE                       (0x4A090000u)
  /** Peripheral COMM__USDHC_1 base pointer */
  #define COMM__USDHC_1                            ((USDHC_Type *)COMM__USDHC_1_BASE)
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS                         { COMM__USDHC_0_BASE, COMM__USDHC_1_BASE }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS                          { COMM__USDHC_0, COMM__USDHC_1 }
#endif
/** Interrupt vectors for the USDHC peripheral type */
#define USDHC_IRQS                               { COMM_USDHC0_IRQn, COMM_USDHC1_IRQn }

/* VBATCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VBAT__VBATCON base address */
  #define VBAT__VBATCON_BASE                       (0x56370000u)
  /** Peripheral VBAT__VBATCON base address */
  #define VBAT__VBATCON_BASE_NS                    (0x46370000u)
  /** Peripheral VBAT__VBATCON base pointer */
  #define VBAT__VBATCON                            ((VBATCON_Type *)VBAT__VBATCON_BASE)
  /** Peripheral VBAT__VBATCON base pointer */
  #define VBAT__VBATCON_NS                         ((VBATCON_Type *)VBAT__VBATCON_BASE_NS)
  /** Array initializer of VBATCON peripheral base addresses */
  #define VBATCON_BASE_ADDRS                       { VBAT__VBATCON_BASE }
  /** Array initializer of VBATCON peripheral base pointers */
  #define VBATCON_BASE_PTRS                        { VBAT__VBATCON }
  /** Array initializer of VBATCON peripheral base addresses */
  #define VBATCON_BASE_ADDRS_NS                    { VBAT__VBATCON_BASE_NS }
  /** Array initializer of VBATCON peripheral base pointers */
  #define VBATCON_BASE_PTRS_NS                     { VBAT__VBATCON_NS }
#else
  /** Peripheral VBAT__VBATCON base address */
  #define VBAT__VBATCON_BASE                       (0x46370000u)
  /** Peripheral VBAT__VBATCON base pointer */
  #define VBAT__VBATCON                            ((VBATCON_Type *)VBAT__VBATCON_BASE)
  /** Array initializer of VBATCON peripheral base addresses */
  #define VBATCON_BASE_ADDRS                       { VBAT__VBATCON_BASE }
  /** Array initializer of VBATCON peripheral base pointers */
  #define VBATCON_BASE_PTRS                        { VBAT__VBATCON }
#endif

/* XBAR0 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__XBAR base address */
  #define AUDIO__XBAR_BASE                         (0x58160000u)
  /** Peripheral AUDIO__XBAR base address */
  #define AUDIO__XBAR_BASE_NS                      (0x48160000u)
  /** Peripheral AUDIO__XBAR base pointer */
  #define AUDIO__XBAR                              ((XBAR0_Type *)AUDIO__XBAR_BASE)
  /** Peripheral AUDIO__XBAR base pointer */
  #define AUDIO__XBAR_NS                           ((XBAR0_Type *)AUDIO__XBAR_BASE_NS)
  /** Array initializer of XBAR0 peripheral base addresses */
  #define XBAR0_BASE_ADDRS                         { AUDIO__XBAR_BASE }
  /** Array initializer of XBAR0 peripheral base pointers */
  #define XBAR0_BASE_PTRS                          { AUDIO__XBAR }
  /** Array initializer of XBAR0 peripheral base addresses */
  #define XBAR0_BASE_ADDRS_NS                      { AUDIO__XBAR_BASE_NS }
  /** Array initializer of XBAR0 peripheral base pointers */
  #define XBAR0_BASE_PTRS_NS                       { AUDIO__XBAR_NS }
#else
  /** Peripheral AUDIO__XBAR base address */
  #define AUDIO__XBAR_BASE                         (0x48160000u)
  /** Peripheral AUDIO__XBAR base pointer */
  #define AUDIO__XBAR                              ((XBAR0_Type *)AUDIO__XBAR_BASE)
  /** Array initializer of XBAR0 peripheral base addresses */
  #define XBAR0_BASE_ADDRS                         { AUDIO__XBAR_BASE }
  /** Array initializer of XBAR0 peripheral base pointers */
  #define XBAR0_BASE_PTRS                          { AUDIO__XBAR }
#endif

/* XBAR1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__XBAR_0 base address */
  #define HSP__XBAR_0_BASE                         (0x52820000u)
  /** Peripheral HSP__XBAR_0 base address */
  #define HSP__XBAR_0_BASE_NS                      (0x42820000u)
  /** Peripheral HSP__XBAR_0 base pointer */
  #define HSP__XBAR_0                              ((XBAR1_Type *)HSP__XBAR_0_BASE)
  /** Peripheral HSP__XBAR_0 base pointer */
  #define HSP__XBAR_0_NS                           ((XBAR1_Type *)HSP__XBAR_0_BASE_NS)
  /** Array initializer of XBAR1 peripheral base addresses */
  #define XBAR1_BASE_ADDRS                         { HSP__XBAR_0_BASE }
  /** Array initializer of XBAR1 peripheral base pointers */
  #define XBAR1_BASE_PTRS                          { HSP__XBAR_0 }
  /** Array initializer of XBAR1 peripheral base addresses */
  #define XBAR1_BASE_ADDRS_NS                      { HSP__XBAR_0_BASE_NS }
  /** Array initializer of XBAR1 peripheral base pointers */
  #define XBAR1_BASE_PTRS_NS                       { HSP__XBAR_0_NS }
#else
  /** Peripheral HSP__XBAR_0 base address */
  #define HSP__XBAR_0_BASE                         (0x42820000u)
  /** Peripheral HSP__XBAR_0 base pointer */
  #define HSP__XBAR_0                              ((XBAR1_Type *)HSP__XBAR_0_BASE)
  /** Array initializer of XBAR1 peripheral base addresses */
  #define XBAR1_BASE_ADDRS                         { HSP__XBAR_0_BASE }
  /** Array initializer of XBAR1 peripheral base pointers */
  #define XBAR1_BASE_PTRS                          { HSP__XBAR_0 }
#endif

/* XBAR2 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__XBAR_1 base address */
  #define HSP__XBAR_1_BASE                         (0x52830000u)
  /** Peripheral HSP__XBAR_1 base address */
  #define HSP__XBAR_1_BASE_NS                      (0x42830000u)
  /** Peripheral HSP__XBAR_1 base pointer */
  #define HSP__XBAR_1                              ((XBAR2_Type *)HSP__XBAR_1_BASE)
  /** Peripheral HSP__XBAR_1 base pointer */
  #define HSP__XBAR_1_NS                           ((XBAR2_Type *)HSP__XBAR_1_BASE_NS)
  /** Array initializer of XBAR2 peripheral base addresses */
  #define XBAR2_BASE_ADDRS                         { HSP__XBAR_1_BASE }
  /** Array initializer of XBAR2 peripheral base pointers */
  #define XBAR2_BASE_PTRS                          { HSP__XBAR_1 }
  /** Array initializer of XBAR2 peripheral base addresses */
  #define XBAR2_BASE_ADDRS_NS                      { HSP__XBAR_1_BASE_NS }
  /** Array initializer of XBAR2 peripheral base pointers */
  #define XBAR2_BASE_PTRS_NS                       { HSP__XBAR_1_NS }
#else
  /** Peripheral HSP__XBAR_1 base address */
  #define HSP__XBAR_1_BASE                         (0x42830000u)
  /** Peripheral HSP__XBAR_1 base pointer */
  #define HSP__XBAR_1                              ((XBAR2_Type *)HSP__XBAR_1_BASE)
  /** Array initializer of XBAR2 peripheral base addresses */
  #define XBAR2_BASE_ADDRS                         { HSP__XBAR_1_BASE }
  /** Array initializer of XBAR2 peripheral base pointers */
  #define XBAR2_BASE_PTRS                          { HSP__XBAR_1 }
#endif

/* XBAR3 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__XBAR_2 base address */
  #define HSP__XBAR_2_BASE                         (0x52840000u)
  /** Peripheral HSP__XBAR_2 base address */
  #define HSP__XBAR_2_BASE_NS                      (0x42840000u)
  /** Peripheral HSP__XBAR_2 base pointer */
  #define HSP__XBAR_2                              ((XBAR3_Type *)HSP__XBAR_2_BASE)
  /** Peripheral HSP__XBAR_2 base pointer */
  #define HSP__XBAR_2_NS                           ((XBAR3_Type *)HSP__XBAR_2_BASE_NS)
  /** Array initializer of XBAR3 peripheral base addresses */
  #define XBAR3_BASE_ADDRS                         { HSP__XBAR_2_BASE }
  /** Array initializer of XBAR3 peripheral base pointers */
  #define XBAR3_BASE_PTRS                          { HSP__XBAR_2 }
  /** Array initializer of XBAR3 peripheral base addresses */
  #define XBAR3_BASE_ADDRS_NS                      { HSP__XBAR_2_BASE_NS }
  /** Array initializer of XBAR3 peripheral base pointers */
  #define XBAR3_BASE_PTRS_NS                       { HSP__XBAR_2_NS }
#else
  /** Peripheral HSP__XBAR_2 base address */
  #define HSP__XBAR_2_BASE                         (0x42840000u)
  /** Peripheral HSP__XBAR_2 base pointer */
  #define HSP__XBAR_2                              ((XBAR3_Type *)HSP__XBAR_2_BASE)
  /** Array initializer of XBAR3 peripheral base addresses */
  #define XBAR3_BASE_ADDRS                         { HSP__XBAR_2_BASE }
  /** Array initializer of XBAR3 peripheral base pointers */
  #define XBAR3_BASE_PTRS                          { HSP__XBAR_2 }
#endif

/* XBAR4 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral WAKE__XBAR base address */
  #define WAKE__XBAR_BASE                          (0x560B0000u)
  /** Peripheral WAKE__XBAR base address */
  #define WAKE__XBAR_BASE_NS                       (0x460B0000u)
  /** Peripheral WAKE__XBAR base pointer */
  #define WAKE__XBAR                               ((XBAR4_Type *)WAKE__XBAR_BASE)
  /** Peripheral WAKE__XBAR base pointer */
  #define WAKE__XBAR_NS                            ((XBAR4_Type *)WAKE__XBAR_BASE_NS)
  /** Array initializer of XBAR4 peripheral base addresses */
  #define XBAR4_BASE_ADDRS                         { WAKE__XBAR_BASE }
  /** Array initializer of XBAR4 peripheral base pointers */
  #define XBAR4_BASE_PTRS                          { WAKE__XBAR }
  /** Array initializer of XBAR4 peripheral base addresses */
  #define XBAR4_BASE_ADDRS_NS                      { WAKE__XBAR_BASE_NS }
  /** Array initializer of XBAR4 peripheral base pointers */
  #define XBAR4_BASE_PTRS_NS                       { WAKE__XBAR_NS }
#else
  /** Peripheral WAKE__XBAR base address */
  #define WAKE__XBAR_BASE                          (0x460B0000u)
  /** Peripheral WAKE__XBAR base pointer */
  #define WAKE__XBAR                               ((XBAR4_Type *)WAKE__XBAR_BASE)
  /** Array initializer of XBAR4 peripheral base addresses */
  #define XBAR4_BASE_ADDRS                         { WAKE__XBAR_BASE }
  /** Array initializer of XBAR4 peripheral base pointers */
  #define XBAR4_BASE_PTRS                          { WAKE__XBAR }
#endif

/* XSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__XSPI_0 base address */
  #define MAIN__XSPI_0_BASE                        (0x50460000u)
  /** Peripheral MAIN__XSPI_0 base address */
  #define MAIN__XSPI_0_BASE_NS                     (0x40460000u)
  /** Peripheral MAIN__XSPI_0 base pointer */
  #define MAIN__XSPI_0                             ((XSPI_Type *)MAIN__XSPI_0_BASE)
  /** Peripheral MAIN__XSPI_0 base pointer */
  #define MAIN__XSPI_0_NS                          ((XSPI_Type *)MAIN__XSPI_0_BASE_NS)
  /** Peripheral MAIN__XSPI_1 base address */
  #define MAIN__XSPI_1_BASE                        (0x50470000u)
  /** Peripheral MAIN__XSPI_1 base address */
  #define MAIN__XSPI_1_BASE_NS                     (0x40470000u)
  /** Peripheral MAIN__XSPI_1 base pointer */
  #define MAIN__XSPI_1                             ((XSPI_Type *)MAIN__XSPI_1_BASE)
  /** Peripheral MAIN__XSPI_1 base pointer */
  #define MAIN__XSPI_1_NS                          ((XSPI_Type *)MAIN__XSPI_1_BASE_NS)
  /** Array initializer of XSPI peripheral base addresses */
  #define XSPI_BASE_ADDRS                          { MAIN__XSPI_0_BASE, MAIN__XSPI_1_BASE }
  /** Array initializer of XSPI peripheral base pointers */
  #define XSPI_BASE_PTRS                           { MAIN__XSPI_0, MAIN__XSPI_1 }
  /** Array initializer of XSPI peripheral base addresses */
  #define XSPI_BASE_ADDRS_NS                       { MAIN__XSPI_0_BASE_NS, MAIN__XSPI_1_BASE_NS }
  /** Array initializer of XSPI peripheral base pointers */
  #define XSPI_BASE_PTRS_NS                        { MAIN__XSPI_0_NS, MAIN__XSPI_1_NS }
#else
  /** Peripheral MAIN__XSPI_0 base address */
  #define MAIN__XSPI_0_BASE                        (0x40460000u)
  /** Peripheral MAIN__XSPI_0 base pointer */
  #define MAIN__XSPI_0                             ((XSPI_Type *)MAIN__XSPI_0_BASE)
  /** Peripheral MAIN__XSPI_1 base address */
  #define MAIN__XSPI_1_BASE                        (0x40470000u)
  /** Peripheral MAIN__XSPI_1 base pointer */
  #define MAIN__XSPI_1                             ((XSPI_Type *)MAIN__XSPI_1_BASE)
  /** Array initializer of XSPI peripheral base addresses */
  #define XSPI_BASE_ADDRS                          { MAIN__XSPI_0_BASE, MAIN__XSPI_1_BASE }
  /** Array initializer of XSPI peripheral base pointers */
  #define XSPI_BASE_PTRS                           { MAIN__XSPI_0, MAIN__XSPI_1 }
#endif
/** Interrupt vectors for the XSPI peripheral type */
#define XSPI_IRQS                                { MAIN_XSPI0_IRQn, MAIN_XSPI1_IRQn }
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /* XSPI AMBA address. */
  #define XSPI0_AMBA_BASE      (0x70000000u)
  #define XSPI1_AMBA_BASE      (0x90000000u)
  #define XSPI0_AMBA_BASE_NS   (0x60000000u)
  #define XSPI1_AMBA_BASE_NS   (0x80000000u)
  #define XSPI_AMBA_BASES      {0x70000000u, 0x90000000u}
  #define XSPI_AMBA_BASES_NS   {0x60000000u, 0x80000000u}
#else
  /* XSPI AMBA address. */
  #define XSPI0_AMBA_BASE      (0x60000000u)
  #define XSPI1_AMBA_BASE      (0x80000000u)
  #define XSPI_AMBA_BASES      {0x60000000u, 0x80000000u}
#endif


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MIMXRT2660_COMMON_H_ */

